{
    "name": "Image Hover Effects for Elementor with Lightbox and Flipbox",
    "slug": "image-hover-effects-with-carousel",
    "version": "3.0.2",
    "author": "<a href=\"https:\/\/oxilab.org\">biplob018<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/biplob018\/",
    "contributors": {
        "biplob018": {
            "profile": "https:\/\/profiles.wordpress.org\/biplob018\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/8c736ef242eb8b60d4df2258f7e8ca66?s=96&d=monsterid&r=g",
            "display_name": "biplob018"
        }
    },
    "requires": "4.4",
    "tested": "6.4.4",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 76,
    "ratings": {
        "5": 5,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 2
    },
    "num_ratings": 8,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/image-hover-effects-with-carousel\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 21252,
    "last_updated": "2023-11-19 4:35pm GMT",
    "added": "2017-06-29",
    "homepage": "https:\/\/wordpress.org\/plugins\/image-hover-effects-with-carousel\/",
    "sections": {
        "description": "<blockquote><p>\n   <strong>1500+ Image Hover Effects for Elementor Page Builder<\/strong><br \/>\n   \n<\/p><\/blockquote>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is the all-in-one image effects add-ons bundle for Elementor. These lightweight yet heavily effective hover effect addons are packed with 1500+ fantastic styles, stunning hover effects, and unlimited eye-catchy caption hover effects.<\/p>\n<p>Usually, the plugin is bundled with three major addons for Elementor – Flipbox Effects, Image Hover Effects, and Caption Effects. They all come with the most modern and exclusive designs that will certainly enhance your page-building experience with Elementor page builder. This Image Hover Effects for Elementor with Lightbox and Flipbox plugin is one of the best in the market right now that offers all the essential features you ever need to develop a dynamic, and sophisticated website.<\/p>\n<blockquote>\n<p><a href=\"https:\/\/www.oxilabdemos.com\/image-hover-elementor\/\" title=\"Live Demo Of Image Hover Effects\" rel=\"nofollow ugc\">Live Demo <\/a> |<br \/>\n  <a href=\"https:\/\/youtu.be\/44L2Q6ahOtI\" title=\"Watch video tutorial\" rel=\"nofollow ugc\">Video tutorial<\/a> |<br \/>\n  <a href=\"https:\/\/wordpress.org\/support\/plugin\/image-hover-effects-with-carousel\/\" title=\"Free support\" rel=\"ugc\">Support forum<\/a><\/p>\n<\/blockquote>\n<p><strong>Why You Should Choose Our Image Addon Over Others?<br \/>\n<\/strong><\/p>\n<p>With this lightweight and easy-to-use handy plugin, your page-building task will become so effortless that it wasn’t ever before. Image Hover Effects for Elementor with Lightbox and Flipbox plugin contains the most important module for your upcoming business page. It has image hover with some awesome functionality like image effect, hover effect, flip box, lightbox, caption hover, and so on.<\/p>\n<p><strong>Our Image hover Addon is the best use for the following:<\/strong><\/p>\n<ul>\n        <\/p>\n<li>Create a Portfolio showcasing page<\/li>\n<p>        <\/p>\n<li>Build Team Showcasing page<\/li>\n<p>        <\/p>\n<li>Add some stunning Products Gallery<\/li>\n<p>        <\/p>\n<li>Product showcasing<\/li>\n<p>        <\/p>\n<li>Make a Custom Image display page<\/li>\n<p>        <\/p>\n<li>Social media network showcase<\/li>\n<p>        <\/p>\n<li>Stunning and optimized Blog Post showcasing<\/li>\n<p>        <\/p>\n<li>Content Box with Amazing Call to Action button<\/li>\n<p>        <\/p>\n<li>Dynamic Image Gallery<\/li>\n<p>        <\/p>\n<li>Responsive device behavior<\/li>\n<p>    <\/ul>\n<p>These Elementor shortcodes with image hover effects are best used for portfolio\/gallery\/image showcase items on WordPress sites. To make developers&#8217; lives easier, we&#8217;ve released our Elementor Addons plugin, as an advanced pure CSS3-based hover effect (Image Gallery, Image Effects, Flipbox, Lightbox, Caption Effect, and so on). It is completely responsive and dynamic in any device and system. With this awesome plugin, you can bring your images to life with beautiful animation and transitions.<\/p>\n<p><strong>Image Hover Effects for Elementor with Lightbox and Flipbox: All in One Place!<\/strong><\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is by far the most useful page builder widget plugin in the market specially made for image effects. It currently contains the major 3 image hover elements, with more on the way for your future cuisine. Image Hover Effects for Elementor with Lightbox and Flipbox also includes a plethora of website templates, pre-designs, blocks, and other elements. Our developers are working night and day to make all those possibilities the reality in your grasp!<\/p>\n<p>However, within our element list, you will find every widget required to give stunning effects to any type of image item on the website. Image Hover Effects for Elementor with Lightbox and Flipbox has everything you need to create a personal blog, eCommerce product listing page, or a massive corporate-purpose professional website. Dynamic media contents, image hover, flip box effects, service listing, hover profiles, testimonial showcasing, portfolio\/posts grid, photo carousels, caption hover, lightbox effects, and much more, are all included.<\/p>\n<p>As mentioned earlier, the Elementor Addons for Image hover effects has the major three elements. Let’s have a closer look into them now:<\/p>\n<p><strong>Image Hover Effects<\/strong><\/p>\n<p>For the convenience of developers, we&#8217;ve added the most required Image Hover effects add-ons, an advanced pure CSS3-based Image hover effect extension to build some catchy Image Gallery, Effects, Lightbox, Comparison, or Magnifier. You can also add animations and transitions to your gallery.<\/p>\n<p>It includes 30+ customizable hover effects for your Elementor page to design. However, having 30+ effects on the menu does not imply that you are limited to those pre-built elementor image hover effects styles. We made our add-ons plugin so flexible with loads of options so that you can personalize each style and use multiple filters to create a variety of effects based on your imagination. So in that POV, you’re going to get an unlimited number of image effects with our Image Hover Effects widget of Elementor Addon.<\/p>\n<p>The image hover effects on your website are a very appealing and important part of your page. Thus, to make your media page beautiful, we created our exclusive widget Image Hover Effects. With this awesome addon, you can bring your images to life with some beautiful animation and transition hover effects.<\/p>\n<p>Using our plugin, a non-programmer can easily decorate their media riched web page within minutes. We made our image hover widget for Elementor very user-friendly so without any scripting, a developer can easily add 500+ amazing image hover effects\/caption hover.<\/p>\n<p>The image hovers effect element has a simple and magnificent yet highly customizable design dashboard. Even inexperienced WordPress users can create their first image effect with the slide show, carousel, and lots of pro things in a matter of minutes. At the same time, WordPress professional developers can benefit from advanced tools and creative freedom.<\/p>\n<p><strong>Flipbox Effects<\/strong><\/p>\n<p>Flipbox Effect Elementor add-ons are excellent for making your site more interactive with rich media. If you want to draw the attention of your visitors, you&#8217;ll need the Flipbox Effect widget in your Elementor widget library. And here with the Image Hover Effects for Elementor with Lightbox and Flipbox, you’ve got one.<\/p>\n<p>FlipBox allows you to convey your valuable messages in a visually appealing manner by using both before and after effects. Our flip box effects widget will assist you in creating incredible flip box media on your elementor page dashboard. This elementor Flipbox widget has a lot of customization options.<\/p>\n<p><strong>Some awesome features of the Flipbox effect including <\/strong><\/p>\n<ul>\n        <\/p>\n<li>Awesome Functionality<\/li>\n<p>        <\/p>\n<li>Motion Effects with 40+ Entrance Animation<\/li>\n<p>        <\/p>\n<li>Custom Transformation options<\/li>\n<p>        <\/p>\n<li>Custom Background<\/li>\n<p>        <\/p>\n<li>Masking features<\/li>\n<p>        <\/p>\n<li>100% Responsive to every screen size<\/li>\n<p>        <\/p>\n<li>Custom CSS Field<\/li>\n<p>        <\/p>\n<li>Custom HTML attribute<\/li>\n<p>        <\/p>\n<li>Unique Design<\/li>\n<p>        <\/p>\n<li>Fully live design and custom interface<\/li>\n<p>        <\/p>\n<li>Animated sliding Panel<\/li>\n<p>        <\/p>\n<li>Looks great on desktop &amp; mobile<\/li>\n<p>    <\/ul>\n<p>Flipbox widget of the Image Hover Effects for Elementor with Lightbox and Flipbox combines the power of the &#8220;Info Box&#8221; and &#8220;Call to Action&#8221; blocks together. On the surface, it appears to be a standard Info Box, but as the visitor hovers over the block, it flips with a cool CSS3 effect and displays a Call to Action section, prompting him to call. This is the best way to navigate your viewers into the action you want!<\/p>\n<p>Add a Flip Box to the Any page builder in WordPress to give users more flexibility in the back box, such as an icon list, an image, a web link, and text information, among other things. Flip box provides incredible elements that will help you create a beautiful site. You can select from several different flip animations and add two or more items with a variety of cycling options.<\/p>\n<p>The content of this Elementor widget is completely customizable as it includes images, videos, icons, buttons, maps, and so on to create an amazing image flip effect. Furthermore, the beautiful and unique effects on your image give your website a more professional appearance. It includes 30+ distinct templates, each with an unlimited number of background colors and over 120 effects.<\/p>\n<p>This extension assists in the creation of images with hover effects and scrolling animation. Images in a circle and square shape can be customized. Set the animation speed to be fully responsive and pure CSS3. You can represent your data in both a visually appealing and descriptive manner.<\/p>\n<p><strong>Caption Effects<\/strong><\/p>\n<p>Caption effects are another superb addition to our Elementor Addon. This image effect widget offers you some of the most attractive caption hover effects to decorate your web pages. With this addon, you can customarily add image, title, description text, and CTA buttons and put some stunning effects on top of that. On top of that, the Caption Effects widget will allow you to have a pop-up dialog with the caption effect image. This is such a superb addition for those who want the most out of their websites including eCommerce stores.<\/p>\n<p>The amazing transition effects will allow you to customize the media page and bring the website to another level of beauty. Not only that, you can get effectiveness at the same time. The core code is so sophisticated that you can run your website at a lightning speed. Where other similar kinds of plugins and addons make the site slower with such heavy images and effects, our Image Hover Effects for Elementor with Lightbox and Flipbox makes the site faster. And don’t worry, our plugin doesn’t lack quality. When you try our product, you’ll see the proof yourself.<\/p>\n<p><strong>Easy-to-Use Versatile Elementor Addons Plugin<\/strong><\/p>\n<p>Our plugins have an easy-to-use interface with so many customization options and remarkable, extremely important widgets like image hover. It makes designing your next WordPress page or post easier than ever. And with Elementor page builders, take your WordPress website to the next level by making your page more visually appealing.<\/p>\n<p>We have filled all of the free elements with every possible option. If you still require one, please do not hesitate to contact us. Your requests will always be prioritized, and we will try to bring everyone’s query to the main attention to solve them as soon as possible.<\/p>\n<p><strong>Sophisticated Build that Speed-up your Website<\/strong><\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox do not demand any programming skills on your part. The plugin is simple enough for newbies to use, but high-tech developers will appreciate the fully customizable widgets for a professional web designing journey.<\/p>\n<p>This ultra-fast plugin was created using the best coding that compliments the WordPress user base, and with the highest compatibility with the most recent PHP, CSS, CSS3, JS, HTML5, and WordPress core essentials. Thus, rather than slowing down, Image Hover Effects for Elementor with Lightbox and Flipbox accelerates your website with an intelligent SEO-optimized site-booster framework. With just a single plugin, you’ll get many features like these.<\/p>\n<p>So, why are you waiting? Get the Elementor Addons plugin from us today to grasp more traffic using the cutting-edge blogging builder within a minute!<\/p>\n<p><strong>Build with Lots of Features and Functionality<\/strong><\/p>\n<p>With extraordinary themes and plugins, powerful content management systems (CMS) like WordPress have made site-building jobs easier. Add some more flexibility to that, and you have page builders like Visual Composer, Divi, Elementor, or Beaver Builder to choose from. Among them, Elementor is proven to be the most effective yet easiest builder ever. And for those who are comfortable using this builder, we’re continuously developing our plugin line to expand your working facility. Currently, we’re offering a bunch of effective tools and plugins including the Shortcode Addons with 100+ add-ons and widgets.<\/p>\n<p>In addition, with the mighty Image Hover Effects for Elementor with Lightbox and Flipbox, we’ve just given you the final tonic – the simplest and most flexible way out to be at the top!<\/p>\n<p>It is the most powerful, impressive, lightweight, and responsive Image Hover Addons for Elementor with hundreds of customizing options, effects, transitions, and design variations. We have designed and developed the Image Hover Effects for Elementor with Lightbox and Flipbox for making your development life the easiest when it comes to creating a wonderful website with images.<\/p>\n<p>All of our plugins are made with a maximum level of flexibility. Our core coding framework is lightweight yet effective. Thus, we could leave the Image Hover Effects for Elementor with Lightbox and Flipbox with a bunch of developer tools. Advanced developers can play with these tools and make the application more effective for their projects. Custom CSS is such a flexible and effective addition.<\/p>\n<p>WordPress experts can enjoy such advanced tools and apply their creativity to our plugin. Developers can use their own made custom-designed styling and templates with our Image Effects Elementor Addon. And the task is not that hard. Even beginner coders can do that very easily.<\/p>\n<p><strong>Major features of Image Hover Effects for Elementor with Lightbox and Flipbox<\/strong><\/p>\n<p>Adding image hover effects to the website’s content was never easier before. It was hard and complex coding knowledge was required. Then there come plugins to make the developer’s life simpler. And to take a step closer to perfection with zero effort, page builders like Elementor emerged.<\/p>\n<p>And collaborating with such page builders, we, the developers of Image Hover Effects Ultimate- Elementor Addon bring the task out of the world kinda easy!<\/p>\n<p>With our add-ons plugin and Elementor page builder, you can easily develop some stunning pages and rock your business.<\/p>\n<p>I am sure you have become confident that the variety of functions you will end up receiving after installing Image Hover Effects for Elementor with Lightbox and Flipbox is tremendous. Yet it does not stop there. You will indeed receive support from the wonderful development team, which has worked tirelessly to create the plugin and addons for the users&#8217; accessibility. You will be treated equally regardless of your WordPress skill level. Support will always find a way to assist, whether you are a beginner or an expert.<\/p>\n<p>It is critical for any commercial website that their product appears appealing to visitors so that they are persuaded and sellers can convert those visitors into buyers. eCommerce and other professionals can boost their profits by incorporating an image hover effect into their websites to build some eye-catchy product listing pages.<\/p>\n<p>Our Image Hover Effects Ultimate – Elementor Addons are the best solution and way to make any e-commerce website more appealing to visitors. An e-commerce website developer can easily design user-friendly and attractive hovered products with noticeable Call to Action button representation using this WordPress Addon. By adding their product in this manner, they can capture the attention of their customers at first glance. Thus, the business will thrive as the sales will skyrocket!<\/p>\n<p>On top of that, a WordPress developer can easily create SEO-friendly image hover effects for an individual image using the Image Hover Effect Ultimate – Elementor Addons WordPress Plugin so that their customers can quickly reach the correct product\/item details. Moreover, you can easily add links to popular social media platforms, such as Facebook, Twitter, Tumblr, Instagram, VK, Google Plus, and so on, to your image hover, so that your customers can help you spread the word about your product! Isn&#8217;t that pretty cool?<\/p>\n<p><strong>Key Features of the Plugin<\/strong><\/p>\n<p>Image Hover Effects Ultimate – Elementor Addons come with a lot of useful features and pro tools. Here you can find the major three widgets for the Elementor page builder. Each widget is packed with features – from basic to advanced!<\/p>\n<p>Let’s now have a look over those iconic features of the plugin:<\/p>\n<ul>\n <\/p>\n<li>The media manager of Image Hover Effects Addon allows you to make some additional customization of your media, like rotation, flip, crop, and manual resizing within the page builder.<\/li>\n<p> <\/p>\n<li>Customize Font settings- Image Hover Effects Ultimate – Elementor Addon has advanced text style editor options built-in. With this convenience, you have full control over the customization of your texts including the title, caption, buttons, and description of every image. <\/li>\n<p> <\/p>\n<li>Ensures maximum security- Along with our other plugins, this Elementor Addon plugin also uses the native classes to create Image Hover Effects Ultimate – Elementor Addon which makes this fully a secure plugin. <\/li>\n<p> <\/p>\n<li>Designed with Classic hover layout-  the designs of each widget of the image hover Addon have a classic style or grid layout, every hover effect on the page could have its styles and settings. There are a whole bunch of effects, customization styles, and flexible settings to make your styles more versatile and unique. <\/li>\n<p> <\/p>\n<li>Super compatibility-  this plugin works perfectly in Microsoft Edge, Mozilla Firefox, Safari, Opera Mini, and Google Chrome. This Addon plugin supports all the latest versions of popular browsers. <\/li>\n<p> <\/p>\n<li>Hover overlay effects- all hover effects of the Image Hover Effects Ultimate – Elementor Addon thumbnails are highly customizable and have a full set of options. <\/li>\n<p> <\/p>\n<li>Backend text settings, preview all hover effects images, titles, captions, and descriptions are highly customizable, and also, we have a live preview of the changes in the image hover backend. <\/li>\n<p> <\/p>\n<li>Flexible mobile tech support- Our Addon supports all mobile devices and screen sizes to let you customize these responsive gallery layout settings in different screen sizes. <\/li>\n<p> <\/p>\n<li>Best for Blog sites- This plugin can insert images into the WordPress post, page, or widget anything that Elementor supports. You can also import other elements to the Image effect, flip box effects, or caption effects by using the powerful shortcode. Image Hover Effects Ultimate – Elementor Addon has the easiest user interface to work with that functions. You just simply put your code into the box and are done with it. <\/li>\n<p> <\/p>\n<li>Image Alignment- The alignment of the image in the post or page varies on your requirements. You no longer need to use HTML tags or some complex CSS tricks to accomplish this task. You can easily customize the image alignment to any of our widgets within the Elementor. This function is going to help you to align your images the way you need. <\/li>\n<p> <\/p>\n<li>It is, however, possible to select one from implementing alignment modes – left, right, and center of images hovering item alignment inside a post or page content. <\/li>\n<p> <\/p>\n<li>Custom Padding- New padding options for images allows you to set custom values in pixels for the padding of an image block in the content of a post or page. Padding can be defined separately on the left, right, top, and bottom sides. You can customize them according to your device aspect ratio as well. <\/li>\n<p> <\/p>\n<li>Fully Responsive- Image Hover Effects for Elementor with Lightbox and Flipbox is completely responsive and mobile-friendly. This addon plugin has advanced settings for different device screen sizes. <\/li>\n<p> <\/p>\n<li>Advanced Color picker &#8211; With this plugin, you can easily change the color of any image, text, background image, or effect style. <\/li>\n<p> <\/p>\n<li>Stunning styling settings- Image effects borders and shadows have advanced configuration options for configuring the design and style of these image effect elements. <\/li>\n<p> <\/p>\n<li>Background Color &#8211; In the image hover element settings, you can change the background color using a convenient color picker. <\/li>\n<p> <\/p>\n<li>Background transparency &#8211; Using the color picker in the image hover settings, you can change the transparency of the background. You can also enter your decimal value. <\/li>\n<p> <\/p>\n<li>Customizable hover icons &#8211; all gallery button icons are fully customizable, and each icon can be easily replaced with built-in icons <\/li>\n<p> <\/p>\n<li>Image Font color on hover &#8211; In the image hover settings, you can change the font color using a simple color picker. <\/li>\n<p> <\/p>\n<li>Incredible responsive style effects<\/li>\n<p> <\/p>\n<li>There are an infinite number of hover effects items. <\/li>\n<p> <\/p>\n<li>Customize the font size for both headings and descriptions. <\/li>\n<p> <\/p>\n<li>There are over 650 Google fonts. <\/li>\n<li>Text underline visibility\/hiding <\/li>\n<p> <\/p>\n<li>The color of the heading font is unlimited. <\/li>\n<p> <\/p>\n<li>The description font color is unlimited. <\/li>\n<p> <\/p>\n<li>Textual changes. <\/li>\n<p> <\/p>\n<li>Display or hide the border. <\/li>\n<p> <\/p>\n<li>Add a link or lightbox <\/li>\n<p> <\/p>\n<li>Open the link in a new tab. <\/li>\n<p> <\/p>\n<li>Creating custom CSS. <\/li>\n<p> <\/p>\n<li>Very simple video tutorial. <\/li>\n<p> <\/p>\n<li>Customer service is available around the clock. <\/li>\n<p> <\/p>\n<li>Support is available within 12 hours. <\/li>\n<\/ul>\n<p>The design and functionality of your website will be meaningless if visitors cannot access it from a variety of devices and have a positive experience. Sites that are not responsive do not look good on smaller-screen devices such as phones and tablets. As a result, phone and tablet users no longer visit that site. However, it is critical to ensure that everyone, regardless of device, receives all of your website&#8217;s features and functionalities. Otherwise, you&#8217;ll end up losing potential traffic.<\/p>\n<p>However, Image Hover Effects for Elementor with Lightbox and Flipbox will be a great addition and complementary tool for keeping the brilliant designs done with an amazing page builder like Elementor. There is no need to be concerned about the responsiveness of the site when using this plugin&#8217;s widgets or elements. Whatever style, effect, and color you choose for widgets like image hovers, flip boxes, light boxes, or caption effects, you will always get maximum responsiveness, which will keep the site&#8217;s user experience consistent across all devices.<\/p>\n<p>Very User-Friendly Plugin<strong><\/strong><\/p>\n<p>Our fantastic plugin will not only make it easier to build websites, but it will also allow you to use seemingly complex page builders like Elementor with ease. The mechanism behind using Image Hover Effects for Elementor with Lightbox and Flipbox to apply widgets or elements is so simple that people with no coding experience can take full advantage and improve their site-building skills overnight.<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox also comes with a ton of pre-designed layouts, templates, and customizable settings, so you won&#8217;t have to worry about creating anything. We have everything in our box for you; all you have to do is open it!<\/p>\n<p>SEO Friendly Algorithms<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is an addon plugin for Elementor with an SEO-friendly algorithm built into it. The developer team behind this fantastic plugin understands the significance of Google’s Search Engine Algorithms. After all, if we want to stay in business for a long time, we need to make our website visible in search engines as well. That is why Image Hover Effects for Elementor with Lightbox and Flipbox is designed in such a way that it improves rather than degrades your site&#8217;s SEO ranking.<\/p>\n<p>Simply use Image Hover Effects for Elementor with Lightbox and Flipbox in conjunction with Elementor to create a killer SEO combination. With our fully customizable, adaptable add-ons, you will be able to place your targeted keywords anywhere on your webpage, ensuring that Google&#8217;s robots do not ignore you when they visit.<\/p>\n<p>Image Hover Effects Ultimate – Elementor Addon includes over 500 different hover effect styles both pre-made and customizable. There are more variations in the effects. If you&#8217;re not sure which one is best for you, you can check out our live demo section on our website. All Effects-style live demos can be found there. You can also choose directly from those effects. We designed our plugin to be very user-friendly and convenient for using these types of features.<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox comes with a plethora of features and pre-made offers. It will undoubtedly provide you with the jumpstart you&#8217;ve been looking for to build a media-based yet sophisticated website in WordPress using Page Builder like Elementor. The Image Hover Effects for Elementor with Lightbox and Flipbox are also highly customizable and simple to use and will take your WordPress website to the next level.<\/p>\n<p>However, our mission and vision at Oxilab Team are to ensure complete user satisfaction. If users are satisfied with our plugin and its functions, we will be encouraged to create many more addons and widgets for their convenience. We will, on the other hand, continue to research and include more and more elements to the Image Hover Effects for Elementor with Lightbox and Flipbox plugins.<\/p>\n<p>We are confident that you are now persuaded to give us a try! Please share your thoughts on your plugin&#8217;s performance.<\/p>\n",
        "installation": "<p>The installation process of this plugin is very easy.<\/p>\n<blockquote><p>\n     <strong>Option 1<\/strong><br \/>\n    <\/p>\n<ul>\n        <\/p>\n<li>Download the plugin image-hover-effects-with-carousel.zip from WordPress Plugin Directory.<\/li>\n<p>        <\/p>\n<li>Unzip the zip file and extract the plugin folder named <strong>Image Hover Effects for Elementor with Lightbox and Flipbox<\/strong><\/li>\n<p>        <\/p>\n<li>Left that plugin folder into your wp-content\/plugins folder.<\/li>\n<p>        <\/p>\n<li>Go and refresh your WordPress administration panels and from the menu bar click on Plugins.<\/li>\n<p>        <\/p>\n<li>Now you may see your plugin listed under the inactive plug-in tab.<\/li>\n<p>        <\/p>\n<li>Click actively to turn your WordPress plugin on.<\/li>\n<p>    <\/ul>\n<\/blockquote>\n<blockquote>\n<p>    <strong>Option 2<\/strong><br \/>\n    <\/p>\n<ul>\n        <\/p>\n<li>Like the first option you have to download the zip file from the download location.<\/li>\n<p>        <\/p>\n<li>Unzip the zip file and extract the image-hover-effects-with-carousel plugin folder.<\/li>\n<p>        <\/p>\n<li>Double click on the installable folder in order to get image-hover-effects-with-carousel.zip.<\/li>\n<p>        <\/p>\n<li>Go to the WordPress admin panel and press Add New from the Menu bar under the plugins tab.<\/li>\n<p>        <\/p>\n<li>Select the upload link and drag the available image Hover Effects Plugin file and click install now.<\/li>\n<p>        <\/p>\n<li>After successfully installing finally click on ‘activate’ to turn it on.<\/li>\n<p>    <\/ul>\n<\/blockquote>\n<p>That’s all about the installation process. For further queries, you’re welcome to contact us<\/p>\n",
        "faq": "<p>WordPress Image Hover Effects for Elementor with Lightbox and Flipbox<\/p>\n\n<dt id='is%20the%20image%20hover%20effects%20support%20basic%20html%20elements%3F'>\nIs the Image hover Effects support basic HTML Elements?\n<\/h4>\n<p>\n<p>Yes. Basic Html has a support possibility. for example ,  <strong>.<\/strong><\/p>\n<\/p>\n<dt id='are%20your%20plugins%20%C2%A0responsive%3F'>\nAre your plugins  Responsive?\n<\/h4>\n<p>\n<p>Yes, reacts and displays resizing images, titles, and descriptions for mobile devices and tablets. If you faced any problem that means there have a CSS conflict. Try to solve via deacive others plugins. If can&#8217;t contract vai oxilab.org or open a ticket in the support forum.  <\/p>\n<\/p>\n<dt id='how%20to%20enable%20the%20image%20to%20hover%20effects%20with%20carousel%20in%20a%20post%20or%20page%3F'>\nHow to enable the Image to hover effects with Carousel in a post or page?\n<\/h4>\n<p>\n<p>Use elementor Page Builder<\/p>\n<\/p>\n\n",
        "changelog": "<h4>3.0.2<\/h4>\n<p>*Fixed Bugs<\/p>\n<h4>1.0<\/h4>\n<ul>\n<li>Initial Release<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-1.png?rev=2858459\"><img src=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-1.png?rev=2858459\" alt=\"screenshot 1\"><\/a><p>screenshot 1<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-2.png?rev=2858459\"><img src=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-2.png?rev=2858459\" alt=\"screenshot 2\"><\/a><p>screenshot 2<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-3.png?rev=2858459\"><img src=\"https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-3.png?rev=2858459\" alt=\"screenshot 3\"><\/a><p>screenshot 3<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good Slider<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/bambas\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/fe48298b42873ff8de2ecf9519066789?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/fe48298b42873ff8de2ecf9519066789?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/bambas\/\" class=\"reviewer-name\">bambas<\/a> on <span class=\"review-date\">June 11, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>Best Slider for Elementor<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">عالیه<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/aminhajian\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/486ca4134b4d082fade2d2b0376ff697?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/486ca4134b4d082fade2d2b0376ff697?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/aminhajian\/\" class=\"reviewer-name\">aminhajian<\/a> on <span class=\"review-date\">April 19, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>ممنون از سازندگان این افزونه<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Image Hover Effects for Elementor with Lightbox and Flipbox<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/books95\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/8a526776f9e41a08d1609b8c33a5c09f?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/8a526776f9e41a08d1609b8c33a5c09f?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/books95\/\" class=\"reviewer-name\">books95<\/a> on <span class=\"review-date\">March 19, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>Плагин с классными эффектами! Очень удобный<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">MUY MALO EL SOPORTE TÉCNICO<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/malditasea\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/c08823e76e66d34299a7d399f48e36b1?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/c08823e76e66d34299a7d399f48e36b1?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/malditasea\/\" class=\"reviewer-name\">malditasea<\/a> on <span class=\"review-date\">August 26, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">MUY MALO EL SOPORTE TÉCNICO, INCLUSO SI ES CON EL PLUGIN PREMIUM, NO LO RECOMIENDO PARA NADA!<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great Plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/qwertyellow\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/52b64e4052c45d60f6be26598eeb9d1a?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/52b64e4052c45d60f6be26598eeb9d1a?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/qwertyellow\/\" class=\"reviewer-name\">qwertyellow<\/a> on <span class=\"review-date\">June 24, 2019<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Easy to use with lots of options.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Select Effects<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"3 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"3\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/sathyaseelan\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/24884fa7a93427e8cde9c57901fca46f?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/24884fa7a93427e8cde9c57901fca46f?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/sathyaseelan\/\" class=\"reviewer-name\">sathyaseelan<\/a> on <span class=\"review-date\">March 8, 2019<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Can't select any effects.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Basic functionality<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/isf62\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/c020a8a5e3724b80f473e045eea5865d?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/c020a8a5e3724b80f473e045eea5865d?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/isf62\/\" class=\"reviewer-name\">isf62<\/a> on <span class=\"review-date\">February 22, 2018<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">It's a nice app, but if you want to do ANYTHING other than the basics you have to buy the upgrade. I mean, deciding how long a slide lasts should be the open to discussion, right?\nThe rest I can see existing for the pro, anyway here is the list so you don't install it and then be disappointed:\nAutoplay Time Pro Only\nView Animation Pro Only\nBox Shadow Pro Only\nFont Family Pro Only\nButton Font Family Pro Only\nDescription Font Family Pro Only\nAdd Your Custom CSS Code Here Pro Only\nImage Background Pro Only\nTitle Color Pro Only\nTitle Animation Pro Only\nDescription Color Pro Only\nDescription Animation Pro Only\nButton Color Pro Only\nButton Animation Pro Only\nButton Background Pro Only<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Wonderful options, great support!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/martinekooi\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/6a419376a93053e4f43538455c206044?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/6a419376a93053e4f43538455c206044?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/martinekooi\/\" class=\"reviewer-name\">Martinekooi<\/a> on <span class=\"review-date\">December 28, 2017<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">I love the simplicity in the great range of options this plugin has to offer! And when I had a question, within 10 minutes I got the support I needed. Simply great!<\/div>\n<\/div>\n"
    },
    "short_description": "Image Hover Effects for Elementor with Lightbox and Flipbox is an in-one image hover effect solution at Elementor Page Builder.",
    "description": "<blockquote><p>\n   <strong>1500+ Image Hover Effects for Elementor Page Builder<\/strong><br \/>\n   \n<\/p><\/blockquote>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is the all-in-one image effects add-ons bundle for Elementor. These lightweight yet heavily effective hover effect addons are packed with 1500+ fantastic styles, stunning hover effects, and unlimited eye-catchy caption hover effects.<\/p>\n<p>Usually, the plugin is bundled with three major addons for Elementor – Flipbox Effects, Image Hover Effects, and Caption Effects. They all come with the most modern and exclusive designs that will certainly enhance your page-building experience with Elementor page builder. This Image Hover Effects for Elementor with Lightbox and Flipbox plugin is one of the best in the market right now that offers all the essential features you ever need to develop a dynamic, and sophisticated website.<\/p>\n<blockquote>\n<p><a href=\"https:\/\/www.oxilabdemos.com\/image-hover-elementor\/\" title=\"Live Demo Of Image Hover Effects\" rel=\"nofollow ugc\">Live Demo <\/a> |<br \/>\n  <a href=\"https:\/\/youtu.be\/44L2Q6ahOtI\" title=\"Watch video tutorial\" rel=\"nofollow ugc\">Video tutorial<\/a> |<br \/>\n  <a href=\"https:\/\/wordpress.org\/support\/plugin\/image-hover-effects-with-carousel\/\" title=\"Free support\" rel=\"ugc\">Support forum<\/a><\/p>\n<\/blockquote>\n<p><strong>Why You Should Choose Our Image Addon Over Others?<br \/>\n<\/strong><\/p>\n<p>With this lightweight and easy-to-use handy plugin, your page-building task will become so effortless that it wasn’t ever before. Image Hover Effects for Elementor with Lightbox and Flipbox plugin contains the most important module for your upcoming business page. It has image hover with some awesome functionality like image effect, hover effect, flip box, lightbox, caption hover, and so on.<\/p>\n<p><strong>Our Image hover Addon is the best use for the following:<\/strong><\/p>\n<ul>\n        <\/p>\n<li>Create a Portfolio showcasing page<\/li>\n<p>        <\/p>\n<li>Build Team Showcasing page<\/li>\n<p>        <\/p>\n<li>Add some stunning Products Gallery<\/li>\n<p>        <\/p>\n<li>Product showcasing<\/li>\n<p>        <\/p>\n<li>Make a Custom Image display page<\/li>\n<p>        <\/p>\n<li>Social media network showcase<\/li>\n<p>        <\/p>\n<li>Stunning and optimized Blog Post showcasing<\/li>\n<p>        <\/p>\n<li>Content Box with Amazing Call to Action button<\/li>\n<p>        <\/p>\n<li>Dynamic Image Gallery<\/li>\n<p>        <\/p>\n<li>Responsive device behavior<\/li>\n<p>    <\/ul>\n<p>These Elementor shortcodes with image hover effects are best used for portfolio\/gallery\/image showcase items on WordPress sites. To make developers&#8217; lives easier, we&#8217;ve released our Elementor Addons plugin, as an advanced pure CSS3-based hover effect (Image Gallery, Image Effects, Flipbox, Lightbox, Caption Effect, and so on). It is completely responsive and dynamic in any device and system. With this awesome plugin, you can bring your images to life with beautiful animation and transitions.<\/p>\n<p><strong>Image Hover Effects for Elementor with Lightbox and Flipbox: All in One Place!<\/strong><\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is by far the most useful page builder widget plugin in the market specially made for image effects. It currently contains the major 3 image hover elements, with more on the way for your future cuisine. Image Hover Effects for Elementor with Lightbox and Flipbox also includes a plethora of website templates, pre-designs, blocks, and other elements. Our developers are working night and day to make all those possibilities the reality in your grasp!<\/p>\n<p>However, within our element list, you will find every widget required to give stunning effects to any type of image item on the website. Image Hover Effects for Elementor with Lightbox and Flipbox has everything you need to create a personal blog, eCommerce product listing page, or a massive corporate-purpose professional website. Dynamic media contents, image hover, flip box effects, service listing, hover profiles, testimonial showcasing, portfolio\/posts grid, photo carousels, caption hover, lightbox effects, and much more, are all included.<\/p>\n<p>As mentioned earlier, the Elementor Addons for Image hover effects has the major three elements. Let’s have a closer look into them now:<\/p>\n<p><strong>Image Hover Effects<\/strong><\/p>\n<p>For the convenience of developers, we&#8217;ve added the most required Image Hover effects add-ons, an advanced pure CSS3-based Image hover effect extension to build some catchy Image Gallery, Effects, Lightbox, Comparison, or Magnifier. You can also add animations and transitions to your gallery.<\/p>\n<p>It includes 30+ customizable hover effects for your Elementor page to design. However, having 30+ effects on the menu does not imply that you are limited to those pre-built elementor image hover effects styles. We made our add-ons plugin so flexible with loads of options so that you can personalize each style and use multiple filters to create a variety of effects based on your imagination. So in that POV, you’re going to get an unlimited number of image effects with our Image Hover Effects widget of Elementor Addon.<\/p>\n<p>The image hover effects on your website are a very appealing and important part of your page. Thus, to make your media page beautiful, we created our exclusive widget Image Hover Effects. With this awesome addon, you can bring your images to life with some beautiful animation and transition hover effects.<\/p>\n<p>Using our plugin, a non-programmer can easily decorate their media riched web page within minutes. We made our image hover widget for Elementor very user-friendly so without any scripting, a developer can easily add 500+ amazing image hover effects\/caption hover.<\/p>\n<p>The image hovers effect element has a simple and magnificent yet highly customizable design dashboard. Even inexperienced WordPress users can create their first image effect with the slide show, carousel, and lots of pro things in a matter of minutes. At the same time, WordPress professional developers can benefit from advanced tools and creative freedom.<\/p>\n<p><strong>Flipbox Effects<\/strong><\/p>\n<p>Flipbox Effect Elementor add-ons are excellent for making your site more interactive with rich media. If you want to draw the attention of your visitors, you&#8217;ll need the Flipbox Effect widget in your Elementor widget library. And here with the Image Hover Effects for Elementor with Lightbox and Flipbox, you’ve got one.<\/p>\n<p>FlipBox allows you to convey your valuable messages in a visually appealing manner by using both before and after effects. Our flip box effects widget will assist you in creating incredible flip box media on your elementor page dashboard. This elementor Flipbox widget has a lot of customization options.<\/p>\n<p><strong>Some awesome features of the Flipbox effect including <\/strong><\/p>\n<ul>\n        <\/p>\n<li>Awesome Functionality<\/li>\n<p>        <\/p>\n<li>Motion Effects with 40+ Entrance Animation<\/li>\n<p>        <\/p>\n<li>Custom Transformation options<\/li>\n<p>        <\/p>\n<li>Custom Background<\/li>\n<p>        <\/p>\n<li>Masking features<\/li>\n<p>        <\/p>\n<li>100% Responsive to every screen size<\/li>\n<p>        <\/p>\n<li>Custom CSS Field<\/li>\n<p>        <\/p>\n<li>Custom HTML attribute<\/li>\n<p>        <\/p>\n<li>Unique Design<\/li>\n<p>        <\/p>\n<li>Fully live design and custom interface<\/li>\n<p>        <\/p>\n<li>Animated sliding Panel<\/li>\n<p>        <\/p>\n<li>Looks great on desktop &amp; mobile<\/li>\n<p>    <\/ul>\n<p>Flipbox widget of the Image Hover Effects for Elementor with Lightbox and Flipbox combines the power of the &#8220;Info Box&#8221; and &#8220;Call to Action&#8221; blocks together. On the surface, it appears to be a standard Info Box, but as the visitor hovers over the block, it flips with a cool CSS3 effect and displays a Call to Action section, prompting him to call. This is the best way to navigate your viewers into the action you want!<\/p>\n<p>Add a Flip Box to the Any page builder in WordPress to give users more flexibility in the back box, such as an icon list, an image, a web link, and text information, among other things. Flip box provides incredible elements that will help you create a beautiful site. You can select from several different flip animations and add two or more items with a variety of cycling options.<\/p>\n<p>The content of this Elementor widget is completely customizable as it includes images, videos, icons, buttons, maps, and so on to create an amazing image flip effect. Furthermore, the beautiful and unique effects on your image give your website a more professional appearance. It includes 30+ distinct templates, each with an unlimited number of background colors and over 120 effects.<\/p>\n<p>This extension assists in the creation of images with hover effects and scrolling animation. Images in a circle and square shape can be customized. Set the animation speed to be fully responsive and pure CSS3. You can represent your data in both a visually appealing and descriptive manner.<\/p>\n<p><strong>Caption Effects<\/strong><\/p>\n<p>Caption effects are another superb addition to our Elementor Addon. This image effect widget offers you some of the most attractive caption hover effects to decorate your web pages. With this addon, you can customarily add image, title, description text, and CTA buttons and put some stunning effects on top of that. On top of that, the Caption Effects widget will allow you to have a pop-up dialog with the caption effect image. This is such a superb addition for those who want the most out of their websites including eCommerce stores.<\/p>\n<p>The amazing transition effects will allow you to customize the media page and bring the website to another level of beauty. Not only that, you can get effectiveness at the same time. The core code is so sophisticated that you can run your website at a lightning speed. Where other similar kinds of plugins and addons make the site slower with such heavy images and effects, our Image Hover Effects for Elementor with Lightbox and Flipbox makes the site faster. And don’t worry, our plugin doesn’t lack quality. When you try our product, you’ll see the proof yourself.<\/p>\n<p><strong>Easy-to-Use Versatile Elementor Addons Plugin<\/strong><\/p>\n<p>Our plugins have an easy-to-use interface with so many customization options and remarkable, extremely important widgets like image hover. It makes designing your next WordPress page or post easier than ever. And with Elementor page builders, take your WordPress website to the next level by making your page more visually appealing.<\/p>\n<p>We have filled all of the free elements with every possible option. If you still require one, please do not hesitate to contact us. Your requests will always be prioritized, and we will try to bring everyone’s query to the main attention to solve them as soon as possible.<\/p>\n<p><strong>Sophisticated Build that Speed-up your Website<\/strong><\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox do not demand any programming skills on your part. The plugin is simple enough for newbies to use, but high-tech developers will appreciate the fully customizable widgets for a professional web designing journey.<\/p>\n<p>This ultra-fast plugin was created using the best coding that compliments the WordPress user base, and with the highest compatibility with the most recent PHP, CSS, CSS3, JS, HTML5, and WordPress core essentials. Thus, rather than slowing down, Image Hover Effects for Elementor with Lightbox and Flipbox accelerates your website with an intelligent SEO-optimized site-booster framework. With just a single plugin, you’ll get many features like these.<\/p>\n<p>So, why are you waiting? Get the Elementor Addons plugin from us today to grasp more traffic using the cutting-edge blogging builder within a minute!<\/p>\n<p><strong>Build with Lots of Features and Functionality<\/strong><\/p>\n<p>With extraordinary themes and plugins, powerful content management systems (CMS) like WordPress have made site-building jobs easier. Add some more flexibility to that, and you have page builders like Visual Composer, Divi, Elementor, or Beaver Builder to choose from. Among them, Elementor is proven to be the most effective yet easiest builder ever. And for those who are comfortable using this builder, we’re continuously developing our plugin line to expand your working facility. Currently, we’re offering a bunch of effective tools and plugins including the Shortcode Addons with 100+ add-ons and widgets.<\/p>\n<p>In addition, with the mighty Image Hover Effects for Elementor with Lightbox and Flipbox, we’ve just given you the final tonic – the simplest and most flexible way out to be at the top!<\/p>\n<p>It is the most powerful, impressive, lightweight, and responsive Image Hover Addons for Elementor with hundreds of customizing options, effects, transitions, and design variations. We have designed and developed the Image Hover Effects for Elementor with Lightbox and Flipbox for making your development life the easiest when it comes to creating a wonderful website with images.<\/p>\n<p>All of our plugins are made with a maximum level of flexibility. Our core coding framework is lightweight yet effective. Thus, we could leave the Image Hover Effects for Elementor with Lightbox and Flipbox with a bunch of developer tools. Advanced developers can play with these tools and make the application more effective for their projects. Custom CSS is such a flexible and effective addition.<\/p>\n<p>WordPress experts can enjoy such advanced tools and apply their creativity to our plugin. Developers can use their own made custom-designed styling and templates with our Image Effects Elementor Addon. And the task is not that hard. Even beginner coders can do that very easily.<\/p>\n<p><strong>Major features of Image Hover Effects for Elementor with Lightbox and Flipbox<\/strong><\/p>\n<p>Adding image hover effects to the website’s content was never easier before. It was hard and complex coding knowledge was required. Then there come plugins to make the developer’s life simpler. And to take a step closer to perfection with zero effort, page builders like Elementor emerged.<\/p>\n<p>And collaborating with such page builders, we, the developers of Image Hover Effects Ultimate- Elementor Addon bring the task out of the world kinda easy!<\/p>\n<p>With our add-ons plugin and Elementor page builder, you can easily develop some stunning pages and rock your business.<\/p>\n<p>I am sure you have become confident that the variety of functions you will end up receiving after installing Image Hover Effects for Elementor with Lightbox and Flipbox is tremendous. Yet it does not stop there. You will indeed receive support from the wonderful development team, which has worked tirelessly to create the plugin and addons for the users&#8217; accessibility. You will be treated equally regardless of your WordPress skill level. Support will always find a way to assist, whether you are a beginner or an expert.<\/p>\n<p>It is critical for any commercial website that their product appears appealing to visitors so that they are persuaded and sellers can convert those visitors into buyers. eCommerce and other professionals can boost their profits by incorporating an image hover effect into their websites to build some eye-catchy product listing pages.<\/p>\n<p>Our Image Hover Effects Ultimate – Elementor Addons are the best solution and way to make any e-commerce website more appealing to visitors. An e-commerce website developer can easily design user-friendly and attractive hovered products with noticeable Call to Action button representation using this WordPress Addon. By adding their product in this manner, they can capture the attention of their customers at first glance. Thus, the business will thrive as the sales will skyrocket!<\/p>\n<p>On top of that, a WordPress developer can easily create SEO-friendly image hover effects for an individual image using the Image Hover Effect Ultimate – Elementor Addons WordPress Plugin so that their customers can quickly reach the correct product\/item details. Moreover, you can easily add links to popular social media platforms, such as Facebook, Twitter, Tumblr, Instagram, VK, Google Plus, and so on, to your image hover, so that your customers can help you spread the word about your product! Isn&#8217;t that pretty cool?<\/p>\n<p><strong>Key Features of the Plugin<\/strong><\/p>\n<p>Image Hover Effects Ultimate – Elementor Addons come with a lot of useful features and pro tools. Here you can find the major three widgets for the Elementor page builder. Each widget is packed with features – from basic to advanced!<\/p>\n<p>Let’s now have a look over those iconic features of the plugin:<\/p>\n<ul>\n <\/p>\n<li>The media manager of Image Hover Effects Addon allows you to make some additional customization of your media, like rotation, flip, crop, and manual resizing within the page builder.<\/li>\n<p> <\/p>\n<li>Customize Font settings- Image Hover Effects Ultimate – Elementor Addon has advanced text style editor options built-in. With this convenience, you have full control over the customization of your texts including the title, caption, buttons, and description of every image. <\/li>\n<p> <\/p>\n<li>Ensures maximum security- Along with our other plugins, this Elementor Addon plugin also uses the native classes to create Image Hover Effects Ultimate – Elementor Addon which makes this fully a secure plugin. <\/li>\n<p> <\/p>\n<li>Designed with Classic hover layout-  the designs of each widget of the image hover Addon have a classic style or grid layout, every hover effect on the page could have its styles and settings. There are a whole bunch of effects, customization styles, and flexible settings to make your styles more versatile and unique. <\/li>\n<p> <\/p>\n<li>Super compatibility-  this plugin works perfectly in Microsoft Edge, Mozilla Firefox, Safari, Opera Mini, and Google Chrome. This Addon plugin supports all the latest versions of popular browsers. <\/li>\n<p> <\/p>\n<li>Hover overlay effects- all hover effects of the Image Hover Effects Ultimate – Elementor Addon thumbnails are highly customizable and have a full set of options. <\/li>\n<p> <\/p>\n<li>Backend text settings, preview all hover effects images, titles, captions, and descriptions are highly customizable, and also, we have a live preview of the changes in the image hover backend. <\/li>\n<p> <\/p>\n<li>Flexible mobile tech support- Our Addon supports all mobile devices and screen sizes to let you customize these responsive gallery layout settings in different screen sizes. <\/li>\n<p> <\/p>\n<li>Best for Blog sites- This plugin can insert images into the WordPress post, page, or widget anything that Elementor supports. You can also import other elements to the Image effect, flip box effects, or caption effects by using the powerful shortcode. Image Hover Effects Ultimate – Elementor Addon has the easiest user interface to work with that functions. You just simply put your code into the box and are done with it. <\/li>\n<p> <\/p>\n<li>Image Alignment- The alignment of the image in the post or page varies on your requirements. You no longer need to use HTML tags or some complex CSS tricks to accomplish this task. You can easily customize the image alignment to any of our widgets within the Elementor. This function is going to help you to align your images the way you need. <\/li>\n<p> <\/p>\n<li>It is, however, possible to select one from implementing alignment modes – left, right, and center of images hovering item alignment inside a post or page content. <\/li>\n<p> <\/p>\n<li>Custom Padding- New padding options for images allows you to set custom values in pixels for the padding of an image block in the content of a post or page. Padding can be defined separately on the left, right, top, and bottom sides. You can customize them according to your device aspect ratio as well. <\/li>\n<p> <\/p>\n<li>Fully Responsive- Image Hover Effects for Elementor with Lightbox and Flipbox is completely responsive and mobile-friendly. This addon plugin has advanced settings for different device screen sizes. <\/li>\n<p> <\/p>\n<li>Advanced Color picker &#8211; With this plugin, you can easily change the color of any image, text, background image, or effect style. <\/li>\n<p> <\/p>\n<li>Stunning styling settings- Image effects borders and shadows have advanced configuration options for configuring the design and style of these image effect elements. <\/li>\n<p> <\/p>\n<li>Background Color &#8211; In the image hover element settings, you can change the background color using a convenient color picker. <\/li>\n<p> <\/p>\n<li>Background transparency &#8211; Using the color picker in the image hover settings, you can change the transparency of the background. You can also enter your decimal value. <\/li>\n<p> <\/p>\n<li>Customizable hover icons &#8211; all gallery button icons are fully customizable, and each icon can be easily replaced with built-in icons <\/li>\n<p> <\/p>\n<li>Image Font color on hover &#8211; In the image hover settings, you can change the font color using a simple color picker. <\/li>\n<p> <\/p>\n<li>Incredible responsive style effects<\/li>\n<p> <\/p>\n<li>There are an infinite number of hover effects items. <\/li>\n<p> <\/p>\n<li>Customize the font size for both headings and descriptions. <\/li>\n<p> <\/p>\n<li>There are over 650 Google fonts. <\/li>\n<li>Text underline visibility\/hiding <\/li>\n<p> <\/p>\n<li>The color of the heading font is unlimited. <\/li>\n<p> <\/p>\n<li>The description font color is unlimited. <\/li>\n<p> <\/p>\n<li>Textual changes. <\/li>\n<p> <\/p>\n<li>Display or hide the border. <\/li>\n<p> <\/p>\n<li>Add a link or lightbox <\/li>\n<p> <\/p>\n<li>Open the link in a new tab. <\/li>\n<p> <\/p>\n<li>Creating custom CSS. <\/li>\n<p> <\/p>\n<li>Very simple video tutorial. <\/li>\n<p> <\/p>\n<li>Customer service is available around the clock. <\/li>\n<p> <\/p>\n<li>Support is available within 12 hours. <\/li>\n<\/ul>\n<p>The design and functionality of your website will be meaningless if visitors cannot access it from a variety of devices and have a positive experience. Sites that are not responsive do not look good on smaller-screen devices such as phones and tablets. As a result, phone and tablet users no longer visit that site. However, it is critical to ensure that everyone, regardless of device, receives all of your website&#8217;s features and functionalities. Otherwise, you&#8217;ll end up losing potential traffic.<\/p>\n<p>However, Image Hover Effects for Elementor with Lightbox and Flipbox will be a great addition and complementary tool for keeping the brilliant designs done with an amazing page builder like Elementor. There is no need to be concerned about the responsiveness of the site when using this plugin&#8217;s widgets or elements. Whatever style, effect, and color you choose for widgets like image hovers, flip boxes, light boxes, or caption effects, you will always get maximum responsiveness, which will keep the site&#8217;s user experience consistent across all devices.<\/p>\n<p>Very User-Friendly Plugin<strong><\/strong><\/p>\n<p>Our fantastic plugin will not only make it easier to build websites, but it will also allow you to use seemingly complex page builders like Elementor with ease. The mechanism behind using Image Hover Effects for Elementor with Lightbox and Flipbox to apply widgets or elements is so simple that people with no coding experience can take full advantage and improve their site-building skills overnight.<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox also comes with a ton of pre-designed layouts, templates, and customizable settings, so you won&#8217;t have to worry about creating anything. We have everything in our box for you; all you have to do is open it!<\/p>\n<p>SEO Friendly Algorithms<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox is an addon plugin for Elementor with an SEO-friendly algorithm built into it. The developer team behind this fantastic plugin understands the significance of Google’s Search Engine Algorithms. After all, if we want to stay in business for a long time, we need to make our website visible in search engines as well. That is why Image Hover Effects for Elementor with Lightbox and Flipbox is designed in such a way that it improves rather than degrades your site&#8217;s SEO ranking.<\/p>\n<p>Simply use Image Hover Effects for Elementor with Lightbox and Flipbox in conjunction with Elementor to create a killer SEO combination. With our fully customizable, adaptable add-ons, you will be able to place your targeted keywords anywhere on your webpage, ensuring that Google&#8217;s robots do not ignore you when they visit.<\/p>\n<p>Image Hover Effects Ultimate – Elementor Addon includes over 500 different hover effect styles both pre-made and customizable. There are more variations in the effects. If you&#8217;re not sure which one is best for you, you can check out our live demo section on our website. All Effects-style live demos can be found there. You can also choose directly from those effects. We designed our plugin to be very user-friendly and convenient for using these types of features.<\/p>\n<p>Image Hover Effects for Elementor with Lightbox and Flipbox comes with a plethora of features and pre-made offers. It will undoubtedly provide you with the jumpstart you&#8217;ve been looking for to build a media-based yet sophisticated website in WordPress using Page Builder like Elementor. The Image Hover Effects for Elementor with Lightbox and Flipbox are also highly customizable and simple to use and will take your WordPress website to the next level.<\/p>\n<p>However, our mission and vision at Oxilab Team are to ensure complete user satisfaction. If users are satisfied with our plugin and its functions, we will be encouraged to create many more addons and widgets for their convenience. We will, on the other hand, continue to research and include more and more elements to the Image Hover Effects for Elementor with Lightbox and Flipbox plugins.<\/p>\n<p>We are confident that you are now persuaded to give us a try! Please share your thoughts on your plugin&#8217;s performance.<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.3.0.2.zip",
    "upgrade_notice": {
        "3.0.0": "<p>Fixed Bugs<\/p>",
        "1.1": "<p>Redesign Responsive and viewport checker <\/p>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-1.png?rev=2858459",
            "caption": "screenshot 1"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-2.png?rev=2858459",
            "caption": "screenshot 2"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/screenshot-3.png?rev=2858459",
            "caption": "screenshot 3"
        }
    },
    "tags": {
        "caption-hover": "Caption Hover",
        "hover-effects": "hover effects",
        "image-hover": "image hover",
        "image-hover-effects": "image hover effects",
        "image-hover-effects-with-slider": "image hover effects with slider"
    },
    "stable_tag": "3.0.2",
    "versions": {
        "1.0": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.1.0.zip",
        "2.8": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.2.8.zip",
        "3.0.0": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.3.0.0.zip",
        "3.0.1": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.3.0.1.zip",
        "3.0.2": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.3.0.2.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/image-hover-effects-with-carousel.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/www.oxilab.org",
    "banners": {
        "low": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/banner-772x250.png?rev=2858459",
        "high": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/banner-1544x500.png?rev=2858459"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/icon-128x128.png?rev=2858459",
        "2x": "https:\/\/ps.w.org\/image-hover-effects-with-carousel\/assets\/icon-256x256.png?rev=2858459"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 76,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}