{
    "name": "Majestic Support &#8211; Help Desk &amp; Support Plugin",
    "slug": "majestic-support",
    "version": "1.0.1",
    "author": "Ahmad Bilal",
    "author_profile": "https:\/\/profiles.wordpress.org\/ahmadmj\/",
    "contributors": {
        "ahmadmj": {
            "profile": "https:\/\/profiles.wordpress.org\/ahmadmj\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/f913a3f8d2a061d63cf93017e43327d1?s=96&d=monsterid&r=g",
            "display_name": "ahmadmj"
        }
    },
    "requires": "5.5",
    "tested": "6.4.4",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/majestic-support\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 900,
    "downloaded": 2446,
    "last_updated": "2024-02-26 7:27am GMT",
    "added": "2023-11-24",
    "homepage": "https:\/\/www.majesticsupport.com",
    "sections": {
        "description": "<p>Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#8217; support experience. This plugin generates and manages support tickets online, offering innovative features such as email piping, unlimited agents, customizable reply responses, invoicing history, and file attachment options.<\/p>\n<p>This plugin is particularly useful because customers can easily submit tickets from your website&#8217;s front end without needing to register. In addition, the administrator can create and complete tasks on behalf of users, streamlining the support process. Furthermore, you have complete control over the plugin&#8217;s support form customization, allowing you to display any relevant information to customers. Lastly, customers can attach files to their support tickets, ensuring that all necessary information is available to address their concerns.<\/p>\n<ul>\n<li><a href=\"https:\/\/majesticsupport.com\/\" rel=\"nofollow ugc\">Plugin Website<\/a>  <\/li>\n<\/ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/8zdTsKbgeYE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<p><strong>Key Features Of Majestic Support<\/strong>:<br \/>\nKey features that make Majestic Support stand out from the rest include:<\/p>\n<ul>\n<li>Users on the front end can create tickets<\/li>\n<li>Ticket-specific smart reply answers that can be modified<\/li>\n<li>Allows you to place support icons in a variety of places on your website.<\/li>\n<li>Tickets can be made by administrators and agents on behalf of users<\/li>\n<li>You can manage an unlimited number of agents in the base version<\/li>\n<li>Users may request to have their data removed, and administrators may delete or anonymize it<\/li>\n<li>The base version does not impose ticket limitations<\/li>\n<li>Several attachments can be uploaded by a user, agent, or administrator while creating a ticket or replying to a ticket<\/li>\n<li>Manage an unlimited number of tickets and create an unlimited number of agent profiles<\/li>\n<li>Agent performance reports will provide you with valuable insights into the performance of your support system<\/li>\n<li><\/li>\n<\/ul>\n<h3>THE PLUGIN&#8217;S KEY FREE VERSION FEATURES THAT MAKE IT MAJESTIC:<\/h3>\n<p>There are many top-notch help desk plugins for WordPress, but Majestic Support stands out as the most practical one. This is because its basic free version provides several following enhancements over competing solutions.<\/p>\n<ul>\n<li>\n<p><strong>Smart Replies To New Tickets<\/strong><br \/>\nIn response to new tickets, the Smart Reply functionality allows you to automatically search for and provide relevant responses back to the user. When a new ticket is received, Majestic Support will perform a search and suggest quick and relevant responses to a customer query.<\/p>\n<\/li>\n<li>\n<p><strong>Fields Manager<\/strong><br \/>\nThis plugin allows you to create customized support forms by adding custom fields. An admin can add, edit, rename, publish, unpublish, and require or unrequire fields for users and visitors. Additionally, you can also change the display order of the fields, like where you want to show the fields on the support form.<\/p>\n<\/li>\n<li>\n<p><strong>Custom Fields<\/strong><br \/>\nExtra fields are sometimes required; this is no problem. Majestic Support offers 12+ custom fields (text field, dropdown, checkbox, radio button, text area, dependent fields, admin only, date, email, upload file, multi-select, and T&amp;C ).<\/p>\n<\/li>\n<li>\n<p><strong>Themes<\/strong><br \/>\nThemes make our site more beautiful and eye-catching. The plugin is flexible and easy to use, it can integrate seamlessly with any WordPress theme, so it can be used right away. With this feature, you can also change the plugin&#8217;s colors from seven preset color themes with different color palettes.<\/p>\n<\/li>\n<li>\n<p><strong>Support To Everyone<\/strong><br \/>\nBoth free and paid users can access Majestic Support; user-friendly support is also available in the form of video support. The plugin explains nearly all of its Majestic features through video tutorials.<\/p>\n<\/li>\n<li>\n<p><strong>System Log<\/strong><br \/>\nAs an admin, you&#8217;d like to know everything that happened on the system. With the system log, you will know everything about tickets, from when they arrived at your help desk to how an agent reacted to them and what happened next.<\/p>\n<\/li>\n<li>\n<p><strong>Slugs<\/strong><br \/>\nMake the web address unique according to your needs for identifying a particular page on a website in an easy-to-read form.<\/p>\n<\/li>\n<\/ul>\n<h3>MORE FEATURES WITH THE FREE VERSION<\/h3>\n<ul>\n<li>\n<p><strong>Front-end Tickets<\/strong>: Users can create tickets from the front end.<\/p>\n<\/li>\n<li>\n<p><strong>Visitor\/Guest Tickets<\/strong>: Often users do not want to create an account to open a support ticket. Guest tickets are a very important feature and it is free.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Tickets<\/strong>: There are not any limits on tickets in the base version.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Agents<\/strong>: The system support unlimited agents in the admin area in the base version.<\/p>\n<\/li>\n<li>\n<p><strong>Support Icon<\/strong>: This is very important to show the support icon on your site, Majestic Support offers a support icon for the front end with various position options.<\/p>\n<\/li>\n<li>\n<p><strong>Create Ticket for Users<\/strong>: Admin\/agent can create a ticket on behalf of any user.<\/p>\n<\/li>\n<li>\n<p><strong>GDPR<\/strong>: Majestic Support is fully compatible with GDPR law and can be easily configured to show GDPR-related information.<\/p>\n<\/li>\n<li>\n<p><strong>Erase Data Requests<\/strong>: Users can ask to erase their data and the admin has the option to delete or anonymize their data.<\/p>\n<\/li>\n<li>\n<p><strong>Multiple Attachments<\/strong>: User\/agent\/admin can upload multiple attachments in ticket creation and ticket replies<\/p>\n<\/li>\n<li>\n<p><strong>Attachment Size and Type<\/strong>: Admin can control ticket attachments by their size and extension type.<\/p>\n<\/li>\n<li>\n<p><strong>Powerful Filters and Sorting<\/strong>: The system offers powerful filters for both user and admin to search tickets with sorting options.<\/p>\n<\/li>\n<li>\n<p><strong>Priorities<\/strong>: Priority associated with the ticket defines the importance, and the system highlights the priorities with an admin-defined different color on the ticket listing and ticket detail page.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Departments<\/strong>: Create departments that relate to the various business units in your organization. It will be sales, support, and billing, you can create any department in the admin panel. The user will select a department when he creates the ticket.<\/p>\n<\/li>\n<li>\n<p><strong>Ticket Status<\/strong>: Show the ticket status message and different colors to highlight it.<\/p>\n<\/li>\n<li>\n<p><strong>Email Notification<\/strong>: The system sends an email notification to the user, agents, and admin in different actions i.e new ticket, reply, close ticket, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Edit Ticket<\/strong>: Admin\/agent can edit any ticket at any time.<\/p>\n<\/li>\n<li>\n<p><strong>Registration<\/strong>: The system offers a beautiful registration form to register a new user.<\/p>\n<\/li>\n<li>\n<p><strong>Login Form<\/strong>: The system has its login form to log in to the user.<\/p>\n<\/li>\n<li>\n<p><strong>Captcha\/ReCaptcha<\/strong>: Another exciting feature. The system offers its captcha and googles Recaptcha to stop spamming.<\/p>\n<\/li>\n<li>\n<p><strong>Thank you Message for Visitor<\/strong>: Admin can add a special message for the visitor, a message will show after the successful ticket submission.<\/p>\n<\/li>\n<li>\n<p><strong>HTML Editor<\/strong>: HTML editor for ticket summary, ticket reply, notes, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Term &amp; Conditions<\/strong>: Admin can add Terms &amp; Conditions on the ticket submission page.<\/p>\n<\/li>\n<li>\n<p><strong>Themes<\/strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color themes with different color palettes.<\/p>\n<\/li>\n<li>\n<p><strong>Email Templates<\/strong>: Majestic Support offers full power to the admin, the admin can edit any email template in the HTML editor. The system includes beautiful predefined email templates.<\/p>\n<\/li>\n<li>\n<p><strong>Custom Message for new ticket<\/strong>: This is an important feature in that the admin shows a message\/instruction (any message in Text Editor) on the ticket submission form.<\/p>\n<\/li>\n<li>\n<p><strong>Admin\/Agent Only<\/strong>: This field is visible to the admin and agent only.<\/p>\n<\/li>\n<li>\n<p><strong>Hide Agent\/Admin Info<\/strong>: Admin can hide agent information like email, and name from the user.<\/p>\n<\/li>\n<li>\n<p><strong>Email Configuration<\/strong>: Another admin power is the system offering enable\/disable action base email notifications like ticket reply, close ticket, change priority, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Strength &amp; Flexibility<\/strong>: Majestic Support is built using WordPress best practices both on the front end and the back end. This results in an efficient, robust, and intuitive plugin.<\/p>\n<\/li>\n<li>\n<p><strong>Easy to Use:<\/strong> The ticket system builds based on the latest style. You will find it very easy to use.<\/p>\n<\/li>\n<li>\n<p><strong>RTL ready<\/strong>: Majestic Support also supports RTL languages.<\/p>\n<\/li>\n<li>\n<p><strong>Fully Responsive<\/strong>: Majestic Support work on all type of devices including smartphones, tablets, laptops, and desktops. Layouts auto-adjust according to devices.<\/p>\n<\/li>\n<li>\n<p><strong>System Errors<\/strong>: The system record every error and shows it in the admin area.<\/p>\n<\/li>\n<li>\n<p><strong>Hide\/Show Menu<\/strong>: In configurations, administrators can hide or show Majestic Support for any menu item.<\/p>\n<\/li>\n<li>\n<p><strong>Translation<\/strong>: Majestic Support is multi-language and has over 35 translations available.<\/p>\n<\/li>\n<li>\n<p><strong>Pagination<\/strong>: On the configurations page, the administrator can specify one record per page.<\/p>\n<\/li>\n<li>\n<p><strong>Majestic Support has reported on<\/strong><\/p>\n<\/li>\n<li>Get a summary of tickets handled by every staff member<\/li>\n<li>Get a detailed report of tickets handled by every staff member<\/li>\n<li>Get a detailed report of tickets created by every user<\/li>\n<li>Get a summary of tickets by status<\/li>\n<li>Get a summary of tickets by priorities<\/li>\n<li>Get a summary of tickets by departments<\/li>\n<li>Get a summary of tickets created by the channel<\/li>\n<\/ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/YDYnagRWyEU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>PREMIUM EXTENTIONS<\/h3>\n<p>In addition to providing a thorough overview of your support tickets, the plugin offers several handy premium features that make them easier to manage.<\/p>\n<ul>\n<li>\n<p>Agents &#8211; Agents assist users connected to the support system and play a crucial role in the help desk. By adding this add-on, you may add more agents and give them different permissions to make it easier for users to take action on their tickets. Additionally, agents can create, delete, close, and perform any other action given to them by the admin.<\/p>\n<\/li>\n<li>\n<p>Agent Auto Assign &#8211; Ticket auto-assignment is a simple but critical process in the handling and closing of help desk tickets. When auto-assign is enabled, the ticket is assigned to an appropriate agent based on the rules.<\/p>\n<\/li>\n<li>\n<p>Multi Forms &#8211; By using this multi-form functionality, admins, agents, and users, as well as visitors with the necessary permissions, can create different ticket forms to accommodate various request types based on user roles.<\/p>\n<\/li>\n<li>\n<p>Paid Support &#8211; For using your support services, charge users. Create subscriptions based on duration, such as a monthly membership, or the number of tickets, like 10 tickets per month, or charge for each ticket.<\/p>\n<\/li>\n<li>\n<p>Time Tracking &#8211; Track the time spent on tickets in the most precise manner while also providing client and agent-level reporting. Keep a manual record of the time invested in each ticket response.  When the ticket is open in the agent&#8217;s browser track the time with a single click, and stop the time tracking with one click once the agent has finished with the ticket.<\/p>\n<\/li>\n<li>\n<p>WooCommerce &#8211; If you have a WooCommerce store, then integrate Majestic Support with it to offer a smooth support solution. This is a must-have bridge between your WooCommerce store and Majestic Support. This means that consumers can submit tickets to report a specific order or to express any issues they may be having with the website.<\/p>\n<\/li>\n<li>\n<p>Email Piping &#8211; From the comfort of an email account, create tickets or reply to them. For example, you could offer your clients a special email address like support@yourdomain.com. The emails received in this email will be converted to tickets. The add-on also contains built-in options to control how to manage responses to tickets that have been closed, unrecognized email addresses, and much more.<\/p>\n<\/li>\n<li>\n<p>Merge Tickets &#8211; Hundreds of tickets have been submitted for assistance, some of which may be on the same topic and have similar questions. To provide support for each ticket with the same topic would be a waste of time. With this add-on, you can merge any of the two tickets or more with the same topic and query and provide support.<\/p>\n<\/li>\n<li>\n<p>Ticket Overdue &#8211; An &#8220;overdue ticket&#8221; is one that has not been resolved or has not been responded to in a timely manner. By adding this add-on, you can set auto-overdue tickets, overdue by priority, and cron job overdue.<\/p>\n<\/li>\n<li>\n<p>SMTP &#8211; Emails are sent and received using the TCP\/IP protocol known as SMTP (Simple Mail Transfer Protocol). The administrator can define a certain email protocol for sending and receiving emails in support tickets by adding this add-on.<\/p>\n<\/li>\n<li>\n<p>Ban Email &#8211; The ban email function is used to prevent the user from creating new tickets. You can ban any of the user&#8217;s emails with this add-on; however, he will be unable to create new tickets.<\/p>\n<\/li>\n<li>\n<p>Private Credentials &#8211; This feature gives your tickets an additional layer of security so that users can safely enter passwords and other sensitive credentials onto the tickets.<\/p>\n<\/li>\n<li>\n<p>Email CC &#8211; Would you like to email another email address? It&#8217;s simple with the email&#8217;s CC addon. Simply choose the action, and then add the email, to perform it. A system email will also be sent to the specified email address. An exact copy of the email will be sent to the CC recipient.<\/p>\n<\/li>\n<li>\n<p>Export &#8211; Exports are used to keep data on the local system. By adding this add-on, you can export any of the ticket data, like ticket detail, ticket history, etc.<\/p>\n<\/li>\n<li>\n<p>Multi-Language Email Templates &#8211; It allows you to create a language-based email template for all default email templates in the Majestic Support.<\/p>\n<\/li>\n<li>\n<p>Easy Digital Download &#8211; The Easy Digital Download (EDD) add-on offers support for both EDD, the Software Licensing add-on, and the Frontend Submission add-on. By using this add-on, your EDD clients will automatically be granted permission to submit support tickets.<\/p>\n<\/li>\n<li>\n<p>Social Login &#8211; There is no need to register in WordPress when using the Social Login addon, and guests can use their social information as login information in Majestic Support.<\/p>\n<\/li>\n<li>\n<p>Front-End Widgets &#8211; Widgets in WordPress allow you to add content and features to the widgetized areas of your theme, which are mostly the sidebar. However, these widget-ready areas can be in the header, footer, sidebar, below the content, and any other area in your theme. By adding this add-on, a widget is offering two default widgets: the &#8220;Latest Ticket&#8221; and &#8220;Email Notification&#8221; widgets.<\/p>\n<\/li>\n<li>\n<p>Envato Validation &#8211; You can only allow your legitimate clients to submit tickets using the Envato Validation addon. The addon will verify Envato licenses by requesting their Envato purchase code before enabling a user to open an issue. It provides support for one product, multiple products, and pre-products.<\/p>\n<\/li>\n<li>\n<p>Desktop Notification &#8211; The desktop notifications add-on will always keep you informed of the status of your support activities. You receive immediate notification each time something occurs on your support.<\/p>\n<\/li>\n<li>\n<p>Ticket History &#8211; As an admin, you&#8217;d like to know everything that happened on a ticket, from when it arrived at your help desk to how an agent reacted to it and what happened next. So, with the ticket history extension, you can see a summary of all the activities that have taken place on a ticket.<\/p>\n<\/li>\n<li>\n<p>Ticket Auto Close &#8211; Automatic ticket closure reduces your effort to close the ticket manually. By enabling the add-on, tickets will be automatically closed after a set period or pre-defined rules, as determined by the administrator. While a ticket is open, it can also be closed based on the agent&#8217;s response.<\/p>\n<\/li>\n<li>\n<p>Feedback &#8211; By adding this add-on, you can get feedback from your users to enhance the quality of your services. This add-on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add-on sends a feedback link after a ticket is closed. The user will click on a survey link and fill out the survey  &hellip;<\/p>\n<\/li>\n<\/ul>\n",
        "changelog": "<p>= 1.0.1<br \/>\n* Security update.<br \/>\n* Bug fix.<\/p>\n<p>= 1.0.0<br \/>\n* Just release.<\/p>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-1.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-1.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-2.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-2.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-3.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-3.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-4.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-4.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-5.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-5.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-6.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-6.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-7.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-7.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-8.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-8.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-9.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-9.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-10.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-10.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-11.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-11.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-12.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-12.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-13.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-13.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-14.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-14.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-15.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-15.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-16.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-16.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-17.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-17.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-18.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-18.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-19.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-19.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-20.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-20.png?rev=3001137\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-21.png?rev=3001137\"><img src=\"https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-21.png?rev=3001137\" alt=\"\"><\/a><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Easy to use<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/preston39\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1abf952eb77c3e19d365303909589aa7?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1abf952eb77c3e19d365303909589aa7?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/preston39\/\" class=\"reviewer-name\">preston39<\/a> on <span class=\"review-date\">January 11, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Easy to use, majestic support did what I needed for customer support.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#039; support experience.",
    "description": "<p>Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#8217; support experience. This plugin generates and manages support tickets online, offering innovative features such as email piping, unlimited agents, customizable reply responses, invoicing history, and file attachment options.<\/p>\n<p>This plugin is particularly useful because customers can easily submit tickets from your website&#8217;s front end without needing to register. In addition, the administrator can create and complete tasks on behalf of users, streamlining the support process. Furthermore, you have complete control over the plugin&#8217;s support form customization, allowing you to display any relevant information to customers. Lastly, customers can attach files to their support tickets, ensuring that all necessary information is available to address their concerns.<\/p>\n<ul>\n<li><a href=\"https:\/\/majesticsupport.com\/\" rel=\"nofollow ugc\">Plugin Website<\/a>  <\/li>\n<\/ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/8zdTsKbgeYE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<p><strong>Key Features Of Majestic Support<\/strong>:<br \/>\nKey features that make Majestic Support stand out from the rest include:<\/p>\n<ul>\n<li>Users on the front end can create tickets<\/li>\n<li>Ticket-specific smart reply answers that can be modified<\/li>\n<li>Allows you to place support icons in a variety of places on your website.<\/li>\n<li>Tickets can be made by administrators and agents on behalf of users<\/li>\n<li>You can manage an unlimited number of agents in the base version<\/li>\n<li>Users may request to have their data removed, and administrators may delete or anonymize it<\/li>\n<li>The base version does not impose ticket limitations<\/li>\n<li>Several attachments can be uploaded by a user, agent, or administrator while creating a ticket or replying to a ticket<\/li>\n<li>Manage an unlimited number of tickets and create an unlimited number of agent profiles<\/li>\n<li>Agent performance reports will provide you with valuable insights into the performance of your support system<\/li>\n<li><\/li>\n<\/ul>\n<h3>THE PLUGIN&#8217;S KEY FREE VERSION FEATURES THAT MAKE IT MAJESTIC:<\/h3>\n<p>There are many top-notch help desk plugins for WordPress, but Majestic Support stands out as the most practical one. This is because its basic free version provides several following enhancements over competing solutions.<\/p>\n<ul>\n<li>\n<p><strong>Smart Replies To New Tickets<\/strong><br \/>\nIn response to new tickets, the Smart Reply functionality allows you to automatically search for and provide relevant responses back to the user. When a new ticket is received, Majestic Support will perform a search and suggest quick and relevant responses to a customer query.<\/p>\n<\/li>\n<li>\n<p><strong>Fields Manager<\/strong><br \/>\nThis plugin allows you to create customized support forms by adding custom fields. An admin can add, edit, rename, publish, unpublish, and require or unrequire fields for users and visitors. Additionally, you can also change the display order of the fields, like where you want to show the fields on the support form.<\/p>\n<\/li>\n<li>\n<p><strong>Custom Fields<\/strong><br \/>\nExtra fields are sometimes required; this is no problem. Majestic Support offers 12+ custom fields (text field, dropdown, checkbox, radio button, text area, dependent fields, admin only, date, email, upload file, multi-select, and T&amp;C ).<\/p>\n<\/li>\n<li>\n<p><strong>Themes<\/strong><br \/>\nThemes make our site more beautiful and eye-catching. The plugin is flexible and easy to use, it can integrate seamlessly with any WordPress theme, so it can be used right away. With this feature, you can also change the plugin&#8217;s colors from seven preset color themes with different color palettes.<\/p>\n<\/li>\n<li>\n<p><strong>Support To Everyone<\/strong><br \/>\nBoth free and paid users can access Majestic Support; user-friendly support is also available in the form of video support. The plugin explains nearly all of its Majestic features through video tutorials.<\/p>\n<\/li>\n<li>\n<p><strong>System Log<\/strong><br \/>\nAs an admin, you&#8217;d like to know everything that happened on the system. With the system log, you will know everything about tickets, from when they arrived at your help desk to how an agent reacted to them and what happened next.<\/p>\n<\/li>\n<li>\n<p><strong>Slugs<\/strong><br \/>\nMake the web address unique according to your needs for identifying a particular page on a website in an easy-to-read form.<\/p>\n<\/li>\n<\/ul>\n<h3>MORE FEATURES WITH THE FREE VERSION<\/h3>\n<ul>\n<li>\n<p><strong>Front-end Tickets<\/strong>: Users can create tickets from the front end.<\/p>\n<\/li>\n<li>\n<p><strong>Visitor\/Guest Tickets<\/strong>: Often users do not want to create an account to open a support ticket. Guest tickets are a very important feature and it is free.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Tickets<\/strong>: There are not any limits on tickets in the base version.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Agents<\/strong>: The system support unlimited agents in the admin area in the base version.<\/p>\n<\/li>\n<li>\n<p><strong>Support Icon<\/strong>: This is very important to show the support icon on your site, Majestic Support offers a support icon for the front end with various position options.<\/p>\n<\/li>\n<li>\n<p><strong>Create Ticket for Users<\/strong>: Admin\/agent can create a ticket on behalf of any user.<\/p>\n<\/li>\n<li>\n<p><strong>GDPR<\/strong>: Majestic Support is fully compatible with GDPR law and can be easily configured to show GDPR-related information.<\/p>\n<\/li>\n<li>\n<p><strong>Erase Data Requests<\/strong>: Users can ask to erase their data and the admin has the option to delete or anonymize their data.<\/p>\n<\/li>\n<li>\n<p><strong>Multiple Attachments<\/strong>: User\/agent\/admin can upload multiple attachments in ticket creation and ticket replies<\/p>\n<\/li>\n<li>\n<p><strong>Attachment Size and Type<\/strong>: Admin can control ticket attachments by their size and extension type.<\/p>\n<\/li>\n<li>\n<p><strong>Powerful Filters and Sorting<\/strong>: The system offers powerful filters for both user and admin to search tickets with sorting options.<\/p>\n<\/li>\n<li>\n<p><strong>Priorities<\/strong>: Priority associated with the ticket defines the importance, and the system highlights the priorities with an admin-defined different color on the ticket listing and ticket detail page.<\/p>\n<\/li>\n<li>\n<p><strong>Unlimited Departments<\/strong>: Create departments that relate to the various business units in your organization. It will be sales, support, and billing, you can create any department in the admin panel. The user will select a department when he creates the ticket.<\/p>\n<\/li>\n<li>\n<p><strong>Ticket Status<\/strong>: Show the ticket status message and different colors to highlight it.<\/p>\n<\/li>\n<li>\n<p><strong>Email Notification<\/strong>: The system sends an email notification to the user, agents, and admin in different actions i.e new ticket, reply, close ticket, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Edit Ticket<\/strong>: Admin\/agent can edit any ticket at any time.<\/p>\n<\/li>\n<li>\n<p><strong>Registration<\/strong>: The system offers a beautiful registration form to register a new user.<\/p>\n<\/li>\n<li>\n<p><strong>Login Form<\/strong>: The system has its login form to log in to the user.<\/p>\n<\/li>\n<li>\n<p><strong>Captcha\/ReCaptcha<\/strong>: Another exciting feature. The system offers its captcha and googles Recaptcha to stop spamming.<\/p>\n<\/li>\n<li>\n<p><strong>Thank you Message for Visitor<\/strong>: Admin can add a special message for the visitor, a message will show after the successful ticket submission.<\/p>\n<\/li>\n<li>\n<p><strong>HTML Editor<\/strong>: HTML editor for ticket summary, ticket reply, notes, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Term &amp; Conditions<\/strong>: Admin can add Terms &amp; Conditions on the ticket submission page.<\/p>\n<\/li>\n<li>\n<p><strong>Themes<\/strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color themes with different color palettes.<\/p>\n<\/li>\n<li>\n<p><strong>Email Templates<\/strong>: Majestic Support offers full power to the admin, the admin can edit any email template in the HTML editor. The system includes beautiful predefined email templates.<\/p>\n<\/li>\n<li>\n<p><strong>Custom Message for new ticket<\/strong>: This is an important feature in that the admin shows a message\/instruction (any message in Text Editor) on the ticket submission form.<\/p>\n<\/li>\n<li>\n<p><strong>Admin\/Agent Only<\/strong>: This field is visible to the admin and agent only.<\/p>\n<\/li>\n<li>\n<p><strong>Hide Agent\/Admin Info<\/strong>: Admin can hide agent information like email, and name from the user.<\/p>\n<\/li>\n<li>\n<p><strong>Email Configuration<\/strong>: Another admin power is the system offering enable\/disable action base email notifications like ticket reply, close ticket, change priority, etc.<\/p>\n<\/li>\n<li>\n<p><strong>Strength &amp; Flexibility<\/strong>: Majestic Support is built using WordPress best practices both on the front end and the back end. This results in an efficient, robust, and intuitive plugin.<\/p>\n<\/li>\n<li>\n<p><strong>Easy to Use:<\/strong> The ticket system builds based on the latest style. You will find it very easy to use.<\/p>\n<\/li>\n<li>\n<p><strong>RTL ready<\/strong>: Majestic Support also supports RTL languages.<\/p>\n<\/li>\n<li>\n<p><strong>Fully Responsive<\/strong>: Majestic Support work on all type of devices including smartphones, tablets, laptops, and desktops. Layouts auto-adjust according to devices.<\/p>\n<\/li>\n<li>\n<p><strong>System Errors<\/strong>: The system record every error and shows it in the admin area.<\/p>\n<\/li>\n<li>\n<p><strong>Hide\/Show Menu<\/strong>: In configurations, administrators can hide or show Majestic Support for any menu item.<\/p>\n<\/li>\n<li>\n<p><strong>Translation<\/strong>: Majestic Support is multi-language and has over 35 translations available.<\/p>\n<\/li>\n<li>\n<p><strong>Pagination<\/strong>: On the configurations page, the administrator can specify one record per page.<\/p>\n<\/li>\n<li>\n<p><strong>Majestic Support has reported on<\/strong><\/p>\n<\/li>\n<li>Get a summary of tickets handled by every staff member<\/li>\n<li>Get a detailed report of tickets handled by every staff member<\/li>\n<li>Get a detailed report of tickets created by every user<\/li>\n<li>Get a summary of tickets by status<\/li>\n<li>Get a summary of tickets by priorities<\/li>\n<li>Get a summary of tickets by departments<\/li>\n<li>Get a summary of tickets created by the channel<\/li>\n<\/ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/YDYnagRWyEU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>PREMIUM EXTENTIONS<\/h3>\n<p>In addition to providing a thorough overview of your support tickets, the plugin offers several handy premium features that make them easier to manage.<\/p>\n<ul>\n<li>\n<p>Agents &#8211; Agents assist users connected to the support system and play a crucial role in the help desk. By adding this add-on, you may add more agents and give them different permissions to make it easier for users to take action on their tickets. Additionally, agents can create, delete, close, and perform any other action given to them by the admin.<\/p>\n<\/li>\n<li>\n<p>Agent Auto Assign &#8211; Ticket auto-assignment is a simple but critical process in the handling and closing of help desk tickets. When auto-assign is enabled, the ticket is assigned to an appropriate agent based on the rules.<\/p>\n<\/li>\n<li>\n<p>Multi Forms &#8211; By using this multi-form functionality, admins, agents, and users, as well as visitors with the necessary permissions, can create different ticket forms to accommodate various request types based on user roles.<\/p>\n<\/li>\n<li>\n<p>Paid Support &#8211; For using your support services, charge users. Create subscriptions based on duration, such as a monthly membership, or the number of tickets, like 10 tickets per month, or charge for each ticket.<\/p>\n<\/li>\n<li>\n<p>Time Tracking &#8211; Track the time spent on tickets in the most precise manner while also providing client and agent-level reporting. Keep a manual record of the time invested in each ticket response.  When the ticket is open in the agent&#8217;s browser track the time with a single click, and stop the time tracking with one click once the agent has finished with the ticket.<\/p>\n<\/li>\n<li>\n<p>WooCommerce &#8211; If you have a WooCommerce store, then integrate Majestic Support with it to offer a smooth support solution. This is a must-have bridge between your WooCommerce store and Majestic Support. This means that consumers can submit tickets to report a specific order or to express any issues they may be having with the website.<\/p>\n<\/li>\n<li>\n<p>Email Piping &#8211; From the comfort of an email account, create tickets or reply to them. For example, you could offer your clients a special email address like support@yourdomain.com. The emails received in this email will be converted to tickets. The add-on also contains built-in options to control how to manage responses to tickets that have been closed, unrecognized email addresses, and much more.<\/p>\n<\/li>\n<li>\n<p>Merge Tickets &#8211; Hundreds of tickets have been submitted for assistance, some of which may be on the same topic and have similar questions. To provide support for each ticket with the same topic would be a waste of time. With this add-on, you can merge any of the two tickets or more with the same topic and query and provide support.<\/p>\n<\/li>\n<li>\n<p>Ticket Overdue &#8211; An &#8220;overdue ticket&#8221; is one that has not been resolved or has not been responded to in a timely manner. By adding this add-on, you can set auto-overdue tickets, overdue by priority, and cron job overdue.<\/p>\n<\/li>\n<li>\n<p>SMTP &#8211; Emails are sent and received using the TCP\/IP protocol known as SMTP (Simple Mail Transfer Protocol). The administrator can define a certain email protocol for sending and receiving emails in support tickets by adding this add-on.<\/p>\n<\/li>\n<li>\n<p>Ban Email &#8211; The ban email function is used to prevent the user from creating new tickets. You can ban any of the user&#8217;s emails with this add-on; however, he will be unable to create new tickets.<\/p>\n<\/li>\n<li>\n<p>Private Credentials &#8211; This feature gives your tickets an additional layer of security so that users can safely enter passwords and other sensitive credentials onto the tickets.<\/p>\n<\/li>\n<li>\n<p>Email CC &#8211; Would you like to email another email address? It&#8217;s simple with the email&#8217;s CC addon. Simply choose the action, and then add the email, to perform it. A system email will also be sent to the specified email address. An exact copy of the email will be sent to the CC recipient.<\/p>\n<\/li>\n<li>\n<p>Export &#8211; Exports are used to keep data on the local system. By adding this add-on, you can export any of the ticket data, like ticket detail, ticket history, etc.<\/p>\n<\/li>\n<li>\n<p>Multi-Language Email Templates &#8211; It allows you to create a language-based email template for all default email templates in the Majestic Support.<\/p>\n<\/li>\n<li>\n<p>Easy Digital Download &#8211; The Easy Digital Download (EDD) add-on offers support for both EDD, the Software Licensing add-on, and the Frontend Submission add-on. By using this add-on, your EDD clients will automatically be granted permission to submit support tickets.<\/p>\n<\/li>\n<li>\n<p>Social Login &#8211; There is no need to register in WordPress when using the Social Login addon, and guests can use their social information as login information in Majestic Support.<\/p>\n<\/li>\n<li>\n<p>Front-End Widgets &#8211; Widgets in WordPress allow you to add content and features to the widgetized areas of your theme, which are mostly the sidebar. However, these widget-ready areas can be in the header, footer, sidebar, below the content, and any other area in your theme. By adding this add-on, a widget is offering two default widgets: the &#8220;Latest Ticket&#8221; and &#8220;Email Notification&#8221; widgets.<\/p>\n<\/li>\n<li>\n<p>Envato Validation &#8211; You can only allow your legitimate clients to submit tickets using the Envato Validation addon. The addon will verify Envato licenses by requesting their Envato purchase code before enabling a user to open an issue. It provides support for one product, multiple products, and pre-products.<\/p>\n<\/li>\n<li>\n<p>Desktop Notification &#8211; The desktop notifications add-on will always keep you informed of the status of your support activities. You receive immediate notification each time something occurs on your support.<\/p>\n<\/li>\n<li>\n<p>Ticket History &#8211; As an admin, you&#8217;d like to know everything that happened on a ticket, from when it arrived at your help desk to how an agent reacted to it and what happened next. So, with the ticket history extension, you can see a summary of all the activities that have taken place on a ticket.<\/p>\n<\/li>\n<li>\n<p>Ticket Auto Close &#8211; Automatic ticket closure reduces your effort to close the ticket manually. By enabling the add-on, tickets will be automatically closed after a set period or pre-defined rules, as determined by the administrator. While a ticket is open, it can also be closed based on the agent&#8217;s response.<\/p>\n<\/li>\n<li>\n<p>Feedback &#8211; By adding this add-on, you can get feedback from your users to enhance the quality of your services. This add-on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add-on sends a feedback link after a ticket is closed. The user will click on a survey link and fill out the survey  &hellip;<\/p>\n<\/li>\n<\/ul>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/majestic-support.1.0.1.zip",
    "upgrade_notice": [],
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-1.png?rev=3001137",
            "caption": ""
        },
        "2": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-2.png?rev=3001137",
            "caption": ""
        },
        "3": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-3.png?rev=3001137",
            "caption": ""
        },
        "4": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-4.png?rev=3001137",
            "caption": ""
        },
        "5": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-5.png?rev=3001137",
            "caption": ""
        },
        "6": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-6.png?rev=3001137",
            "caption": ""
        },
        "7": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-7.png?rev=3001137",
            "caption": ""
        },
        "8": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-8.png?rev=3001137",
            "caption": ""
        },
        "9": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-9.png?rev=3001137",
            "caption": ""
        },
        "10": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-10.png?rev=3001137",
            "caption": ""
        },
        "11": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-11.png?rev=3001137",
            "caption": ""
        },
        "12": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-12.png?rev=3001137",
            "caption": ""
        },
        "13": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-13.png?rev=3001137",
            "caption": ""
        },
        "14": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-14.png?rev=3001137",
            "caption": ""
        },
        "15": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-15.png?rev=3001137",
            "caption": ""
        },
        "16": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-16.png?rev=3001137",
            "caption": ""
        },
        "17": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-17.png?rev=3001137",
            "caption": ""
        },
        "18": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-18.png?rev=3001137",
            "caption": ""
        },
        "19": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-19.png?rev=3001137",
            "caption": ""
        },
        "20": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-20.png?rev=3001137",
            "caption": ""
        },
        "21": {
            "src": "https:\/\/ps.w.org\/majestic-support\/assets\/screenshot-21.png?rev=3001137",
            "caption": ""
        }
    },
    "tags": {
        "helpdesk": "helpdesk",
        "support": "support",
        "support-ticket": "Support Ticket",
        "ticket-system": "ticket system",
        "tickets": "tickets"
    },
    "stable_tag": "1.0.1",
    "versions": {
        "1.0.0": "https:\/\/downloads.wordpress.org\/plugin\/majestic-support.1.0.0.zip",
        "1.0.1": "https:\/\/downloads.wordpress.org\/plugin\/majestic-support.1.0.1.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/majestic-support.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/majesticsupport.com",
    "banners": {
        "low": "https:\/\/ps.w.org\/majestic-support\/assets\/banner-772x250.png?rev=3001137",
        "high": false
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/majestic-support\/assets\/icon-128x128.gif?rev=3001224"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}