{
    "name": "Offermative – Automated WooCommerce upsells, BOGO, cross-sells, related products, order bumps, dynamic pricing and discounts",
    "slug": "offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce",
    "version": "5.0.0",
    "author": "<a href=\"https:\/\/www.offermative.com\/\">Offermative<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/storeapps\/",
    "contributors": {
        "storeapps": {
            "profile": "https:\/\/profiles.wordpress.org\/storeapps\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/f0657b851ed298c72fbd303fa3cef049?s=96&d=monsterid&r=g",
            "display_name": "storeapps"
        },
        "niravmehta": {
            "profile": "https:\/\/profiles.wordpress.org\/niravmehta\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/ef932a7c8ba7423182d77345e64a6e53?s=96&d=monsterid&r=g",
            "display_name": "Nirav Mehta"
        },
        "tarunparswani": {
            "profile": "https:\/\/profiles.wordpress.org\/tarunparswani\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/5d3a55d8c762ab2190430414978897e3?s=96&d=monsterid&r=g",
            "display_name": "Tarun.Parswani"
        },
        "mansi-shah": {
            "profile": "https:\/\/profiles.wordpress.org\/mansi-shah\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/8cc302bd28fa2a6336f4f4a8dea8b067?s=96&d=monsterid&r=g",
            "display_name": "Mansi"
        },
        "ratnakardubey": {
            "profile": "https:\/\/profiles.wordpress.org\/ratnakardubey\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/a5361ac8c4df799d453dbc7bc3dc7f61?s=96&d=monsterid&r=g",
            "display_name": "Ratnakar"
        }
    },
    "requires": "5.0.0",
    "tested": "6.4.4",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 8,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 4256,
    "last_updated": "2024-01-19 8:21am GMT",
    "added": "2020-11-25",
    "homepage": "",
    "sections": {
        "description": "<p>The easiest and most powerful AI-driven WooCommerce upsell plugin to boost sales and maximize your average order value.<\/p>\n<p><a href=\"https:\/\/www.offermative.com\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Offermative<\/a> intelligently generates hundreds of conversion-focused upsells, related product recommendations, cross-sells, dynamic pricing deals, order bumps, BOGO deals and other compelling offer campaigns within your sales funnel, within minutes.<\/p>\n<p>Navigate through various offer campaigns, select the ones that resonate with your strategies, and activate them. Then, sit back and watch as sales pour in. The ultimate WooCommerce booster you&#8217;ll ever need.<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/8MGrFmXK9FY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h4>CUT YOUR MARKETING &amp; DEVELOPMENT COSTS DRASTICALLY (SAVE $1000+)<\/h4>\n<p>Crafting a single offer is costly and time-consuming, with no assurance of success. Reviews, coding, expert assistance, designing, testing and constant refinements add up to expenses and frustration.<\/p>\n<p>Now, picture dealing this with hundreds and thousands of offers – a significant time and cost investment, costing you more than $1000 and your precious time.<\/p>\n<p><strong>Offermative automates this complete process – design templates, conditional logic, copywriting, targeting rules, discount setup, coupon creation and application.<\/strong><\/p>\n<p>Also say goodbye to the expense and hassle of managing multiple WooCommerce upsell plugins. More plugins mean more conflicts. Avoid this by choosing Offermative.<\/p>\n<p>Rest assured, Offermative will work smoothly, without slowing down your website.<\/p>\n<blockquote>\n<p>“The biggest pain Offermative solved for me is the entire offer creation process! I don’t have to deal with any coding, designing or coupons.”<br \/>\n  &#8211; Kunbi Osinoiki, Kunbi Music Company<\/p>\n<\/blockquote>\n<h4>WILL OFFERMATIVE WORK FOR YOU?<\/h4>\n<p>Yes, Offermative is a perfect fit for every WooCommerce store, regardless of its size or reach. Whether you&#8217;re in electronics, digital goods, FMCGs, fashion, travel, books, furniture, fitness, music, food and drinks, cbd oils or any other industry, Offermative is for you.<\/p>\n<p>For those who want to grow sales, move inventory faster, convert cold leads and existing customers without efforts and costs, Offermative is for you. Even if you don’t want to offer discounts!<\/p>\n<blockquote>\n<p><strong>Note:<\/strong> You need to have an Offermative account to use the plugin. Signup for a <a href=\"https:\/\/www.offermative.com\/pricing\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">plan<\/a> and start getting sales right away.<\/p>\n<\/blockquote>\n<h4>DOZENS OF TARGETED WOOCOMMERCE UPSELL OFFERS WITHIN MINUTES<\/h4>\n<p>All your <a href=\"https:\/\/www.offermative.com\/woocommerce-upsell\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">upsell<\/a> offers in one-click of the button. Run them on different products, pages, categories, and based on targeting rules &#8211; cart total, new or existing users, products in cart, etc. Offermative is the answer to ‘how to upsell a product’.<\/p>\n<ul>\n<li><strong>Product upsell<\/strong> – Encourage customers to purchase a higher-end or more expensive version of the product they are currently interested in. A laptop with higher specifications compared to the base model is a solid upsell example. Run upsell on multiple products to sell better. <\/li>\n<li><strong>Cart upsell<\/strong> – Show upsell offers on the cart page with or without a discount.<\/li>\n<li><strong>Checkout upsell<\/strong> – Display upsell offers on the checkout page, without the intrusive pop ups.<\/li>\n<li><strong>Product category upsell<\/strong> &#8211; Upsell products from the same or different categories, giving more visibility to your product portfolio.<\/li>\n<li><strong>Page upsell<\/strong> – Run upsell offers on multiple product pages and identify which converts better.<\/li>\n<li><strong>Pre-purchase upsells<\/strong> &#8211; Go beyond WooCommerce cart upsell and WooCommerce checkout upsells. Run upsells on your shop page, blog posts, other landing pages, before users make a transaction.<\/li>\n<li><strong>Post purchase upsells<\/strong> – Implement upsell offers on the WooCommerce thank you page \/ order complete page \/ My Account page after customers have made an initial purchase.<\/li>\n<li><strong>Multiple upsells in the sales funnel<\/strong> – Show upsells on product pages, downsell offer on the cart page, order bump on checkout, giveaway on the home page, discounts on blog posts&#8230;convince users to buy more in your woo funnels without sounding pushy.<\/li>\n<\/ul>\n<blockquote>\n<p>“Offermative gives me a way to make my online store more attractive. By pairing offers with what my customers have in their cart, I can target specific interests. I have noticed an increase in per-sale revenue. That has been the main benefit of using Offermative.”<br \/>\n  &#8211; Jeff Arrowood, From the Abbey<\/p>\n<\/blockquote>\n<h4>SMART WOOCOMMERCE CROSS SELLS &amp; ORDER BUMPS<\/h4>\n<ul>\n<li><strong>Cross-sells<\/strong> – Offer related or complementary products and nudge visitors to buy more. <a href=\"https:\/\/www.offermative.com\/woocommerce-cross-sell\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn more<\/a><\/li>\n<li><strong>Order bumps<\/strong> – Shown below or above the Payment call-to-action button on the checkout page, without disrupting user flow. Offer a discounted subscription service or extended warranty.<\/li>\n<li><strong>Cart bumps<\/strong> &#8211; It’s the <a href=\"https:\/\/www.offermative.com\/order-bump\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce order bump<\/a> offer but shown on the cart page.<\/li>\n<\/ul>\n<h4>WOOCOMMERCE RELATED PRODUCTS RECOMMENDATIONS<\/h4>\n<p>Amazon’s ‘Customers who bought this item also bought’ or ‘Frequently bought together’ section. Offermative auto recommends what’s likely to sell.<br \/>\nIt’s a smart way to upsell cross-sell relevant product add-ons or <a href=\"https:\/\/www.offermative.com\/woocommerce-related-products\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">related products<\/a> together, offering value-driven product bundles.<\/p>\n<h4>DIVERSE WOOCOMMERCE BOGO DEALS<\/h4>\n<p>Run buy one get one, buy 2 get 1, and buy more get one deals. Offermative allows you to offer another product (not the same) in BOGO deals. WooCommerce Buy one get one deals were never so simple to set up.<\/p>\n<ul>\n<li><strong>2 for 1 deal<\/strong> &#8211; Offer a red T-shirt on purchase of a blue T-shirt for free.<\/li>\n<li><strong>50% off<\/strong> &#8211; Offer a red T-shirt on purchase of a blue T-shirt at 50% off.<\/li>\n<li><strong>Same category deal<\/strong> &#8211; Buy one book and get a pen for free.<\/li>\n<li><strong>Different category deal<\/strong> &#8211; Buy a lunch box and get a chocolate for free.<\/li>\n<li><strong>Quantity discounts<\/strong> &#8211; Buy five t-shirts and get a cap for free.<\/li>\n<li><strong>Bulk discounts<\/strong> &#8211; 10% off on 10 items, 15% off above 10 items, 20% off above 20 items (need to run three different campaigns).<\/li>\n<\/ul>\n<p>and hundreds of BOGO combinations&#8230;<\/p>\n<h4>WOOCOMMERCE DYNAMIC PRICING &amp; DISCOUNTS<\/h4>\n<p>Intuitive offer campaign rules for different dynamic pricing use cases:<\/p>\n<ul>\n<li><strong>Free gifts \/ Giveaways<\/strong> – Set the discount to 100% to give away add-ons, gifts, e-books and other products.<\/li>\n<li>Provide a flat $5 discount on all shoes only for the first order of the user on your website.<\/li>\n<li>Purchase three Zara shirts and get 10% off on the total cart value.<\/li>\n<li>Offer 20% discount to users whose lifetime value has crossed $1000.<\/li>\n<li>Flat 25% discount on all orders over $500.<\/li>\n<\/ul>\n<p>and many more pricing deals you can offer.<\/p>\n<h4>WOOCOMMERCE SITEWIDE SALE &amp; DISCOUNT RULES<\/h4>\n<p>Run fixed, percentage, sitewide, cart, checkout, conditional, exclusive discount offer campaigns. <a href=\"https:\/\/www.offermative.com\/woocommerce-discount-plugin\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn more<\/a>. For example, a sitewide sale during Black Cyber, Christmas or other special occasions.<\/p>\n<blockquote>\n<p>“I instantly got attracted to the readymade offer designs. Everything is so quick and automatic that I can run discount offers on lots of different products and grow sales easily.”<br \/>\n  &#8211; Dror Beckerman, Sous Vide<\/p>\n<\/blockquote>\n<p><a href=\"https:\/\/demo.offermative.com\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">View Demo<\/a> | <a href=\"https:\/\/www.offermative.com\/documentation\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Documentation<\/a><\/p>\n<h4>ALL THE POWERFUL FEATURES TO OPTIMIZE YOUR WOOCOMMERCE SALES FUNNEL<\/h4>\n<ul>\n<li><strong>Auto-apply coupons<\/strong> – No manual coupon creation, no dealing with promo coupon code ideas. Offermative will automatically create coupons and apply them for the users. Smart coupons, isn’t it?<\/li>\n<li><strong>Product selection<\/strong> – Offermative studies your store catalog and order history to pick up what products should be promoted, whether they should be discounted or not. But you can change this easily. It can use your existing product images or show images on its own.<\/li>\n<li><strong>Dynamic targeting rules<\/strong> – Who should see the promotion campaign? What should be the minimum cart total to show the offer? Offermative sets up multiple targeting rules to the offers to a limited set of qualified customers. You can tweak this if you need it. Full control in your hands.<\/li>\n<li><strong>Mobile-responsive upsell templates<\/strong> – High converting, beautifully designed offer messages. WooCommerce upsell popups, inline, messengers (slide-ins) with person photos, header \/ footer bars, notification boxes. All the lead generation-style message types to show your offers.<\/li>\n<li><strong>A\/B split testing<\/strong> – Would a popup work better or a header bar? Or an inline message? Each Offermative campaign can contain multiple messages and they are all split tested automatically.<\/li>\n<li><strong>Micro-offers<\/strong> – Run offers on thousands of product variations without any effort. And identity which converts well. So you don’t have to worry about hitting visitors with too many promotions. As a matter of fact, larger stores may run dozens of campaigns at the same time.<\/li>\n<li><strong>Expert copywriting &amp; CTAs<\/strong> – If you are looking for how to write a discount offer, Offermative will take some of your burden by writing all the promotion copy for you! What headlines and CTAs will close the sale? How to tap into the pain and desires of the audience? <\/li>\n<li><strong>Customizable designs<\/strong> &#8211; You have full flexibility to customize the copy and CTAs. From Add to Cart to Buy Now, name the CTA’s as you wish.<\/li>\n<li><strong>Translations \/ Multilingual<\/strong> – Website not in English? Our AI copywriting generator also supports translations for a whole range of popular languages like French, German, Spanish, Hebrew, Italian, Brazilian, Japanese and others.<\/li>\n<li><strong>Schedule and manage campaigns<\/strong> – Select the date and time when you want to make the offer campaigns live – now, a few hours later today, tomorrow or any other day. You can extend campaigns that are working well or stop the ones that are not performing. <\/li>\n<li><strong>Tracking &amp; Analytics<\/strong> – Offermative tracks everything it does and learns how to run better campaigns for you. Monitor campaigns, improve, repeat. The more you use it, the better results you can experience.<\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.offermative.com\/features\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn about all the features<\/a><\/p>\n<blockquote>\n<p>“I aim to convert all the new visitors \/ cold traffic using offers. And the best thing is Offermative does it all without me putting in any effort.&#8221;<br \/>\n  &#8211; Sophia Wright, Room For Roots<\/p>\n<\/blockquote>\n<h4>WORKS WITH POPULAR PLUGINS, THEMES AND DIFFERENT PRODUCT TYPES IN WOOCOMMERCE<\/h4>\n<ul>\n<li><strong>Plugins<\/strong> – Offermative adheres to WooCommerce standards and works with other plugins. It would work even with other WooCommerce sales funnel plugins.<\/li>\n<li><strong>Themes<\/strong> – Offermative won’t mess up your WordPress theme, nor can your theme distort Offermative designs. We’ve tested it with popular themes as well.<\/li>\n<li><strong>Physical products<\/strong> – Clear inventory, control discounts, exclude certain products from promotions&#8230; Offermative is magical for e-commerce.<\/li>\n<li><strong>Digital downloads &amp; virtual<\/strong> – Clever discounting and bundling can immediately improve results for everyone selling downloadable or virtual products.<\/li>\n<li><strong>Subscriptions<\/strong> – Offermative supports WooCommerce Subscriptions plugin and can run offers for recurring products easily.<\/li>\n<li><strong>Product variations<\/strong> – Offermative is compatible with variable products and can allow people to select an appropriate variation when they claim an offer.<\/li>\n<li><strong>Payment gateways<\/strong> – Offermative is compatible with all payment gateways that WooCommerce supports.<\/li>\n<li><strong>High volume merchants<\/strong> – Offermative won’t slow down your site. All campaigns have targeting rules so they will show only to an appropriate audience.<\/li>\n<\/ul>\n<blockquote>\n<p>As I don’t run discounts, the plugin provides the flexibility to show related products without a discount. The automated rules are a great addition for specific targeting. Felt really happy to come across such a plugin.<br \/>\n  &#8211; Nicolai Grut, GrutBrushes<\/p>\n<\/blockquote>\n<p>Since Offermative can take care of the entire sales \/ promotion process and is tightly integrated with WooCommerce, it will become your “automatic sales machine”, closing orders and making sales on its own.<br \/>\nEach additional order you get through Offermative helps you get closer to your goals. Offermative is a ground-breaking solution and we’re here for your success.<\/p>\n<p><strong>Simply reading about Offermative won&#8217;t boost your sales; you need to experience it. Run campaigns, witness the results, and realize the plugin&#8217;s true worth!<\/strong><\/p>\n<p>And if you consider the RoI, Offermative essentially becomes a free WordPress upsell plugin, adding significant value to your business.<\/p>\n<p>Questions?<br \/>\n<a href=\"https:\/\/www.offermative.com\/contact\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Contact us<\/a><\/p>\n<h4>RECOMMENDED PLUGINS<\/h4>\n<p>Offermative is developed by <a href=\"https:\/\/www.storeapps.org\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">StoreApps<\/a>, an official WooCommerce extensions developer.  More than a decade of track record, 320k+ customers, 400+ five-star reviews and renowned support. Our best-selling and popular plugins &#8211;<\/p>\n<ul>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-manager\/?utm_source=wprepo&amp;utm_medium=web_sm&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Smart Manager for WooCommerce &amp; WordPress<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/bulk-variations-manager\/?utm_source=wprepo&amp;utm_medium=web_bvm&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Bulk Variations Manager<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/how-to-create-1-click-upsells-in-woocommerce\/?utm_source=wprepo&amp;utm_medium=web_so&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce One Click Upsell<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-coupons\/?utm_source=wprepo&amp;utm_medium=web_sc&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce Smart Coupons<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-emails\/?utm_source=wprepo&amp;utm_medium=web_se&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Email Customizer for WooCommerce<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/offer-your-price\/?utm_source=wprepo&amp;utm_medium=web_oyp&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce Name Your Price Plugin<\/a><\/li>\n<li><a href=\"https:\/\/woo.com\/products\/affiliate-for-woocommerce\/?utm_source=wprepo&amp;utm_medium=web_oyp&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Affiliate for WooCommerce<\/a><\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.storeapps.org\/woocommerce-plugins\/?utm_source=wprepo&amp;utm_medium=web_others&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Check out all our WooCommerce plugins<\/a><\/p>\n",
        "installation": "<ol>\n<li>Ensure you have latest version of <a href=\"https:\/\/wordpress.org\/plugins\/woocommerce\/\" rel=\"ugc\">WooCommerce<\/a> plugin installed<\/li>\n<li>Unzip and upload the folder &#8216;offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce&#8217; to your <code>\/wp-content\/plugins\/<\/code> directory<\/li>\n<li>Activate &#8216;Offermative: discount pricing, related products, upsell funnels for WooCommerce&#8217; through the &#8216;Plugins&#8217; menu in WordPress<\/li>\n<\/ol>\n",
        "faq": "\n<dt id='does%20this%20really%20work%3F'>\nDoes this really work?\n<\/h4>\n<p>\n<p>Yes. People have reported thousands of dollars of extra sales within weeks of using Offermative.<\/p>\n<\/p>\n<dt id='what%20if%20my%20campaign%20does%20not%20generate%20sales%3F'>\nWhat if my campaign does not generate sales?\n<\/h4>\n<p>\n<p>That can happen. Check if the campaign registered enough views &#8211; if a campaign has too restrictive targeting rules, it may not show enough times to create any result. If your campaign has sufficient views but has not generated sales, you may want to see what the offer was. Tweak that offer in a new campaign and see how results improve. Offermative is not the silver bullet, but it certainly helps you experiment and succeed quickly.<\/p>\n<\/p>\n<dt id='how%20can%20i%20sign%20up%20for%20paid%20plans%3F'>\nHow can I sign up for paid plans?\n<\/h4>\n<p>\n<p>Visit <a href=\"https:\/\/www.offermative.com\/pricing\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">this page<\/a> to sign up for a paid plan.<\/p>\n<\/p>\n<dt id='will%20it%20slow%20my%20site%20down%3F'>\nWill it slow my site down?\n<\/h4>\n<p>\n<p>No. Our code is high quality and designed to work with minimal impact even on high traffic websites. Offermative will actually work much faster than many other funnel plugins.<\/p>\n<\/p>\n<dt id='how%20many%20campaigns%20can%20i%20run%3F'>\nHow many campaigns can I run?\n<\/h4>\n<p>\n<p>As many as you like. We recommend running a handful of highly targeted campaigns all the time. That means all offers show only to a limited number of visitors and you can test what works best.<\/p>\n<\/p>\n<dt id='how%20can%20i%20delete%20a%20campaign%3F'>\nHow can I delete a campaign?\n<\/h4>\n<p>\n<p>Simply click on the campaign in the Offermative dashboard that you would like to delete. It would open up the campaign details pane and then click on the delete icon in the header bar of the campaigns details pane.<\/p>\n<\/p>\n<dt id='can%20i%20edit%20%2F%20customize%20the%20offers%3F'>\nCan I edit \/ customize the offers?\n<\/h4>\n<p>\n<p>Yes, you can customize the offer text, change discount value, products and pages, edit the offer rules, customize colors, schedule offer campaigns.<\/p>\n<\/p>\n<dt id='is%20offermative%20a%20cartflows%20alternative%3F'>\nIs Offermative a Cartflows alternative?\n<\/h4>\n<p>\n<p>Not exactly. Cartflows is for list building and checkout optimization, while Offermative is for converting leads and customers via offers. You can use both the plugins on your website to reduce abandonment.<\/p>\n<\/p>\n<dt id='is%20offermative%20similar%20to%20funnelkit%20or%20wpfunnels%3F'>\nIs Offermative similar to Funnelkit or WPFunnels?\n<\/h4>\n<p>\n<p>No, Offermative is different from these two plugins.<\/p>\n<\/p>\n<dt id='is%20offermative%20a%20drag%20and%20drop%20sales%20funnel%20builder%3F'>\nIs Offermative a drag and drop sales funnel builder?\n<\/h4>\n<p>\n<p>No. Offermative provides readymade offer designs for your sales funnel which you can simply select and publish to make them live.<\/p>\n<\/p>\n\n",
        "changelog": "<h4>5.0.0 (11.11.2022)<\/h4>\n<ul>\n<li>New: WooCommerce 7.0.1 compatible<\/li>\n<li>New: WordPress 6.1.0 compatible<\/li>\n<li>Fix: PHP Warning: magic method SA_Offermative::__wakeup() must have public visibility<\/li>\n<li>Update: POT file<\/li>\n<\/ul>\n<h4>4.0.0 (15.06.2022)<\/h4>\n<ul>\n<li>New: Support for editing offer campaign message templates<\/li>\n<li>New: WordPress v6.0.0 compatible &amp; WooCommerce v6.6.0 compatible<\/li>\n<li>Update: Additional comparison operators for &#8216;Product quantity&#8217;, &#8216;LTV&#8217;, &#8216;Cart total&#8217; and &#8216;Category total in cart&#8217; offer campaigns rules<\/li>\n<li>Update: POT file <\/li>\n<\/ul>\n<h4>3.0.0 (29.04.2022)<\/h4>\n<ul>\n<li>New: Support for JavaScript string translations<\/li>\n<li>New: WordPress v5.9.3 compatible &amp; WooCommerce v6.3.1 compatible<\/li>\n<li>Fix: &#8216;you can have max 0 campaigns&#8217; error message when trying to publish generated campaigns<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>2.0.0 (07.10.2021)<\/h4>\n<ul>\n<li>New: Support for updating campaign start &amp; end dates<\/li>\n<li>Fix: End date not updating when trying to &#8216;extend&#8217; expired campaigns<\/li>\n<li>Update: Compatibility with latest versions of WordPress (v5.8.1) &amp; WooCommerce (v5.7.1)<\/li>\n<li>Update: Show campaign start &amp; end dates as per site timezone on campaign dashboard<\/li>\n<li>Update: UI\/UX Improvements<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.7.0 (22.06.2021)<\/h4>\n<ul>\n<li>New: Support for generation of specific campaign offer types &amp; user based restrictions<\/li>\n<li>Update: Compatibility with latest version of WooCommerce (v5.4.1)<\/li>\n<li>Fix: Display Offer Campaigns start &amp; end date as per site timezone<\/li>\n<li>Fix: &#8216;Product&#8217; selection appearing as blank in Campaign Details in some cases<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.6.0 (08.06.2021)<\/h4>\n<ul>\n<li>New: Support for editing &amp; adding campaign rules<\/li>\n<li>Update: Compatibility with latest versions of WordPress (v5.7.2) &amp; WooCommerce (v5.3.0)<\/li>\n<li>Fix: Plugin not deactivating in some cases<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.5.0 (24.02.2021)<\/h4>\n<ul>\n<li>New: WordPress 5.6.2 compatible<\/li>\n<li>New: Support for generation of message copy texts in different languages in addition to English language<\/li>\n<li>Update: Admin UI\/UX improvements<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.4.0 (10.02.2021)<\/h4>\n<ul>\n<li>New: WooCommerce 5.0.0 compatible<\/li>\n<li>Update: Improvements in the campaign generation code<\/li>\n<li>Fix: Campaigns having variable product as the offered product not showing up properly<\/li>\n<li>Fix: Campaigns not showing up in some cases if the user is already on the site<\/li>\n<li>Fix: Campaigns not showing in some cases as page not getting detected properly due to permalink Settings<\/li>\n<li>Fix: Campaigns not showing in some cases as ProductQuantity rule not getting validated properly<\/li>\n<li>Fix: Message id list not getting updated on deletion of message in Campaign Detail panel<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.3.0 (04.02.2021)<\/h4>\n<ul>\n<li>New: WordPress 5.6.1 &amp; WooCommerce 4.9.2 compatible<\/li>\n<li>Update: Improvements in the campaign generation code<\/li>\n<li>Update: Added placeholder to determine whether to search for product or product category when editing the offered product<\/li>\n<li>Fix: Campaign Detail dialog randomly opening in some cases<\/li>\n<li>Fix: Message preview not updating on change of offer discount or offer product<\/li>\n<li>Fix: Redirection failing when trying to accept a product or product category offer in some cases<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.2.0 (25.01.2021)<\/h4>\n<ul>\n<li>New: WooCommerce 4.9.1 compatible<\/li>\n<li>Update: Contact us page link from the plugin<\/li>\n<li>Update: Filters to control the offer types while generating campaigns<\/li>\n<li>Update: Storing modified date when the campaign is updated<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.1.0 (20.01.2021)<\/h4>\n<ul>\n<li>New: Support for updating the campaign title<\/li>\n<li>New: WordPress 5.6 &amp; WooCommerce 4.9.0 compatible<\/li>\n<li>Update: Display the base rule for offered product negation condition<\/li>\n<li>Update: Show start &amp; end time in addition to date for campaigns on admin dashboard<\/li>\n<li>Fix: Campaign analytics showing dual counts on Offermative admin dashboard<\/li>\n<li>Fix: Message_id not getting reset for campaigns when generating campaigns<\/li>\n<li>Fix: Offered product &amp; product &amp; categories in rules not displaying the name in some cases on admin side<\/li>\n<li>Fix: Category placeholders not getting replaced in messages for category offer type<\/li>\n<li>Fix: Icon for action bar not showing after the campaign was edited.<\/li>\n<li>Fix: JPG vs SVG handling for images in popup message templates<\/li>\n<li>Update: POT file<\/li>\n<li>Fix: Some minor fixes<\/li>\n<\/ul>\n<h4>1.0.0 (25.11.2020)<\/h4>\n<ul>\n<li>Initial release<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-1.png?rev=2425571\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-1.png?rev=2425571\" alt=\"&lt;p&gt;Offermative Dashboard&lt;\/p&gt;\"><\/a><p><p>Offermative Dashboard<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-2.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-2.png?rev=3023898\" alt=\"&lt;p&gt;Settings page&lt;\/p&gt;\"><\/a><p><p>Settings page<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-3.png?rev=2425571\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-3.png?rev=2425571\" alt=\"&lt;p&gt;Campaign generation dialog&lt;\/p&gt;\"><\/a><p><p>Campaign generation dialog<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-4.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-4.png?rev=3023898\" alt=\"&lt;p&gt;Login page&lt;\/p&gt;\"><\/a><p><p>Login page<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-5.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-5.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Message Type - Popup&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Message Type - Popup<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-6.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-6.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Message Type - Messenger&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Message Type - Messenger<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-7.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-7.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Type - Product Recommendations&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Type - Product Recommendations<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-8.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-8.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Type - Upsell&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Type - Upsell<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-9.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-9.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Type - Order Bump&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Type - Order Bump<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-10.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-10.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Type - Cross Sell&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Type - Cross Sell<\/p><\/p><\/li><li><a href=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-11.png?rev=3023898\"><img src=\"https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-11.png?rev=3023898\" alt=\"&lt;p&gt;Offer Campaign Type - Sitewide&lt;\/p&gt;\"><\/a><p><p>Offer Campaign Type - Sitewide<\/p><\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Super efficient and very rewarding<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/alexynior\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/d3f698b34858579da126b12e5eaacec2?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/d3f698b34858579da126b12e5eaacec2?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/alexynior\/\" class=\"reviewer-name\">alexynior<\/a> on <span class=\"review-date\">November 30, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This plugin has simply boosted my sales. It works very well and automatically. I would only add a little more customization in the colors from the same text editing panel.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Awesome plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/alequija\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/ca42c28ebdd61985837d82ec543514ae?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/ca42c28ebdd61985837d82ec543514ae?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/alequija\/\" class=\"reviewer-name\">alequija<\/a> on <span class=\"review-date\">February 24, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>It do a wonderful job increasing conversion. I had some issues at first but they helped me fast enough to keep using it. Now I´m implementing it in a few of my sites. I recommend it and the service from Tarun.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Broken plugin. Don&#039;t bother!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/grafx77\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/54423c5ff9c9fb1024c7819a2e4649b6?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/54423c5ff9c9fb1024c7819a2e4649b6?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/grafx77\/\" class=\"reviewer-name\">grafx77<\/a> on <span class=\"review-date\">October 10, 2022<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Plugin doesn't work with most WP themes. I couldn't get it to work with 90% of the offers it uses on my Flatsome theme. I requested support, but after 5 days, I just couldn't get any. Their support although barely responsive, will take a week+ just to start their troubleshooting. \n\nI give support alone a 0 rating. \n\nSave yourself the trouble and find other alternatives. There are plenty out there.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">No free version<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/perties\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/f05e93f389ca7458fe8d0a5e3a3cab40?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/f05e93f389ca7458fe8d0a5e3a3cab40?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/perties\/\" class=\"reviewer-name\">Perties <small>(perties)<\/small><\/a> on <span class=\"review-date\">August 30, 2022<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">You can install this plugin buy you have to buy right way a license. It does not offer any free functionality<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Thanks you<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/odedbutbul\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/086ee5832b0d42c2a2c85548b8bfbca9?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/086ee5832b0d42c2a2c85548b8bfbca9?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/odedbutbul\/\" class=\"reviewer-name\">odedbutbul<\/a> on <span class=\"review-date\">November 26, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Great customer service \nI love offermative<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">A must-have plugin for store owners who are interested in increasing profits<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/alexser\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/c5f7bc1b1e896462f63692d391f7895b?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/c5f7bc1b1e896462f63692d391f7895b?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/alexser\/\" class=\"reviewer-name\">alexser<\/a> on <span class=\"review-date\">November 16, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">The specifics of my business are such that it is extremely important for me not only to attract a customer, but also to increase his average check. Otherwise, profitability  goes down a lot. \nThat's why correctly working Upsells &amp; Cross Sells options with wide settings are very important to me. Also, dynamic pricing options (including the ability to use coupons and free gifts), AB testing and localization (my website is not in English) are very important to me too. \nYou can say that there are many similar plugins. Yes, you will be right (before I used to install several plugins too , which mostly covered my needs). But everyone who creates their own sites strives to install as few plugins as possible, because \"the more different plugins - the more likely they will conflict with each other\".\nUsing the Offermative plugin - you get an great  All-in-one solution with guaranteed compatibility and no problems and errors due to inconsistent code. A special word of thanks to the support team - they are always ready to help with solving problems and are very constructive with suggestions for new functionality :)\nPS And I'm really looking forward to the new feature - showing Upsells &amp; Cross Sells products not only based on the products in the cart, but also based on the previous customer reactions (acceptance or rejection of the previously shown offer).\nSorry for my English - it's not my native language :)<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">The only discount plugin you will ever need.<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/pragyan1999\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/89026aaf63b67b4ffa4f955a58bc4134?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/89026aaf63b67b4ffa4f955a58bc4134?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/pragyan1999\/\" class=\"reviewer-name\">pragyan1999<\/a> on <span class=\"review-date\">October 14, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">To be honest, I have not yet opened my store but I have been looking for a good discount plugin for months now. I have tested a lot of them but was not happy with any of then. Even if some worked they didn't have all the features so I had to install multiple plugins that slowed my website. It was then when I stumbled upon Offermative. Since then I have been testing a lot of its features and I absolutely love them.\nAs the title implies it's an all-in-one plugin; Upsells, Crosells, Coupons, Order Bumps, Dynamic Pricing you name it they have it. The features that I like the most are the AI-automation and the A\/B testing features with great analytics. Once you start using it you will immediately that this plugin is made by some really intelligent peeps with the only objective of converting your website into a money-making machine.\nThere is this thing I wish they should add is customizable checkout and thank you pages with templates like CartFlows. It will also ensure great integration along also help owners with low design skills. \nAnyways great plugin keep up the great work. It feels really good and proud to see such wonderful products coming out of your motherland. All the Best.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Increasing Per-Sale Revenue and Customer Loyalty<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/fromtheabbey\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/3d455c91afdcbc9f51366ef96c3ea7f9?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/3d455c91afdcbc9f51366ef96c3ea7f9?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/fromtheabbey\/\" class=\"reviewer-name\"> <small>(fromtheabbey)<\/small><\/a> on <span class=\"review-date\">October 8, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">I run an online bookstore. This is a market where people tend to search either Amazon or Google for the title they're looking for, make a purchase, and not really care why they bought from. So getting repeat buyers has been a challenge, and that means lower revenue as well.\n\nOffermative gives me a way to make my online store more attractive. By pairing offers with what my customers have in their cart, I can target specific interests. I have noticed an increase in per-sale revenue. That has been the main benefit of using Offermative. I also hope that paired with a loyalty program and email campaigns that I will be able to increase the number of repeat buyers and loyal customers. However, I haven't used Offermative enough yet to know that's true.\n\nOne of the best things about Offermative has been its customer service. I made suggestions for improvement and the developers responded quickly and implemented my suggestions. \n\nOne suggestion I made was the ability to override conditions for an offer that the plugin's AI sets automatically. They recently made that option available.  They are still developing the plugin, so even more improvements are coming. I love the idea of the plugin tracking sales and creating offers based on sales patterns. However, I would still like to see more flexibility in the way of manual overrides. As a seller, I know what my customers may purchase together better than the AI. Let me have the option to create recipes completely manually or to allow the AI to more quickly create them for me.<\/div>\n<\/div>\n"
    },
    "short_description": "Grow revenue and AOV with targeted upsells, cross-sells, order bumps, dynamic pricing deals and offers. A powerful and must-have WooCommerce booster.",
    "description": "<p>The easiest and most powerful AI-driven WooCommerce upsell plugin to boost sales and maximize your average order value.<\/p>\n<p><a href=\"https:\/\/www.offermative.com\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Offermative<\/a> intelligently generates hundreds of conversion-focused upsells, related product recommendations, cross-sells, dynamic pricing deals, order bumps, BOGO deals and other compelling offer campaigns within your sales funnel, within minutes.<\/p>\n<p>Navigate through various offer campaigns, select the ones that resonate with your strategies, and activate them. Then, sit back and watch as sales pour in. The ultimate WooCommerce booster you&#8217;ll ever need.<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/8MGrFmXK9FY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h4>CUT YOUR MARKETING &amp; DEVELOPMENT COSTS DRASTICALLY (SAVE $1000+)<\/h4>\n<p>Crafting a single offer is costly and time-consuming, with no assurance of success. Reviews, coding, expert assistance, designing, testing and constant refinements add up to expenses and frustration.<\/p>\n<p>Now, picture dealing this with hundreds and thousands of offers – a significant time and cost investment, costing you more than $1000 and your precious time.<\/p>\n<p><strong>Offermative automates this complete process – design templates, conditional logic, copywriting, targeting rules, discount setup, coupon creation and application.<\/strong><\/p>\n<p>Also say goodbye to the expense and hassle of managing multiple WooCommerce upsell plugins. More plugins mean more conflicts. Avoid this by choosing Offermative.<\/p>\n<p>Rest assured, Offermative will work smoothly, without slowing down your website.<\/p>\n<blockquote>\n<p>“The biggest pain Offermative solved for me is the entire offer creation process! I don’t have to deal with any coding, designing or coupons.”<br \/>\n  &#8211; Kunbi Osinoiki, Kunbi Music Company<\/p>\n<\/blockquote>\n<h4>WILL OFFERMATIVE WORK FOR YOU?<\/h4>\n<p>Yes, Offermative is a perfect fit for every WooCommerce store, regardless of its size or reach. Whether you&#8217;re in electronics, digital goods, FMCGs, fashion, travel, books, furniture, fitness, music, food and drinks, cbd oils or any other industry, Offermative is for you.<\/p>\n<p>For those who want to grow sales, move inventory faster, convert cold leads and existing customers without efforts and costs, Offermative is for you. Even if you don’t want to offer discounts!<\/p>\n<blockquote>\n<p><strong>Note:<\/strong> You need to have an Offermative account to use the plugin. Signup for a <a href=\"https:\/\/www.offermative.com\/pricing\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">plan<\/a> and start getting sales right away.<\/p>\n<\/blockquote>\n<h4>DOZENS OF TARGETED WOOCOMMERCE UPSELL OFFERS WITHIN MINUTES<\/h4>\n<p>All your <a href=\"https:\/\/www.offermative.com\/woocommerce-upsell\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">upsell<\/a> offers in one-click of the button. Run them on different products, pages, categories, and based on targeting rules &#8211; cart total, new or existing users, products in cart, etc. Offermative is the answer to ‘how to upsell a product’.<\/p>\n<ul>\n<li><strong>Product upsell<\/strong> – Encourage customers to purchase a higher-end or more expensive version of the product they are currently interested in. A laptop with higher specifications compared to the base model is a solid upsell example. Run upsell on multiple products to sell better. <\/li>\n<li><strong>Cart upsell<\/strong> – Show upsell offers on the cart page with or without a discount.<\/li>\n<li><strong>Checkout upsell<\/strong> – Display upsell offers on the checkout page, without the intrusive pop ups.<\/li>\n<li><strong>Product category upsell<\/strong> &#8211; Upsell products from the same or different categories, giving more visibility to your product portfolio.<\/li>\n<li><strong>Page upsell<\/strong> – Run upsell offers on multiple product pages and identify which converts better.<\/li>\n<li><strong>Pre-purchase upsells<\/strong> &#8211; Go beyond WooCommerce cart upsell and WooCommerce checkout upsells. Run upsells on your shop page, blog posts, other landing pages, before users make a transaction.<\/li>\n<li><strong>Post purchase upsells<\/strong> – Implement upsell offers on the WooCommerce thank you page \/ order complete page \/ My Account page after customers have made an initial purchase.<\/li>\n<li><strong>Multiple upsells in the sales funnel<\/strong> – Show upsells on product pages, downsell offer on the cart page, order bump on checkout, giveaway on the home page, discounts on blog posts&#8230;convince users to buy more in your woo funnels without sounding pushy.<\/li>\n<\/ul>\n<blockquote>\n<p>“Offermative gives me a way to make my online store more attractive. By pairing offers with what my customers have in their cart, I can target specific interests. I have noticed an increase in per-sale revenue. That has been the main benefit of using Offermative.”<br \/>\n  &#8211; Jeff Arrowood, From the Abbey<\/p>\n<\/blockquote>\n<h4>SMART WOOCOMMERCE CROSS SELLS &amp; ORDER BUMPS<\/h4>\n<ul>\n<li><strong>Cross-sells<\/strong> – Offer related or complementary products and nudge visitors to buy more. <a href=\"https:\/\/www.offermative.com\/woocommerce-cross-sell\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn more<\/a><\/li>\n<li><strong>Order bumps<\/strong> – Shown below or above the Payment call-to-action button on the checkout page, without disrupting user flow. Offer a discounted subscription service or extended warranty.<\/li>\n<li><strong>Cart bumps<\/strong> &#8211; It’s the <a href=\"https:\/\/www.offermative.com\/order-bump\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce order bump<\/a> offer but shown on the cart page.<\/li>\n<\/ul>\n<h4>WOOCOMMERCE RELATED PRODUCTS RECOMMENDATIONS<\/h4>\n<p>Amazon’s ‘Customers who bought this item also bought’ or ‘Frequently bought together’ section. Offermative auto recommends what’s likely to sell.<br \/>\nIt’s a smart way to upsell cross-sell relevant product add-ons or <a href=\"https:\/\/www.offermative.com\/woocommerce-related-products\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">related products<\/a> together, offering value-driven product bundles.<\/p>\n<h4>DIVERSE WOOCOMMERCE BOGO DEALS<\/h4>\n<p>Run buy one get one, buy 2 get 1, and buy more get one deals. Offermative allows you to offer another product (not the same) in BOGO deals. WooCommerce Buy one get one deals were never so simple to set up.<\/p>\n<ul>\n<li><strong>2 for 1 deal<\/strong> &#8211; Offer a red T-shirt on purchase of a blue T-shirt for free.<\/li>\n<li><strong>50% off<\/strong> &#8211; Offer a red T-shirt on purchase of a blue T-shirt at 50% off.<\/li>\n<li><strong>Same category deal<\/strong> &#8211; Buy one book and get a pen for free.<\/li>\n<li><strong>Different category deal<\/strong> &#8211; Buy a lunch box and get a chocolate for free.<\/li>\n<li><strong>Quantity discounts<\/strong> &#8211; Buy five t-shirts and get a cap for free.<\/li>\n<li><strong>Bulk discounts<\/strong> &#8211; 10% off on 10 items, 15% off above 10 items, 20% off above 20 items (need to run three different campaigns).<\/li>\n<\/ul>\n<p>and hundreds of BOGO combinations&#8230;<\/p>\n<h4>WOOCOMMERCE DYNAMIC PRICING &amp; DISCOUNTS<\/h4>\n<p>Intuitive offer campaign rules for different dynamic pricing use cases:<\/p>\n<ul>\n<li><strong>Free gifts \/ Giveaways<\/strong> – Set the discount to 100% to give away add-ons, gifts, e-books and other products.<\/li>\n<li>Provide a flat $5 discount on all shoes only for the first order of the user on your website.<\/li>\n<li>Purchase three Zara shirts and get 10% off on the total cart value.<\/li>\n<li>Offer 20% discount to users whose lifetime value has crossed $1000.<\/li>\n<li>Flat 25% discount on all orders over $500.<\/li>\n<\/ul>\n<p>and many more pricing deals you can offer.<\/p>\n<h4>WOOCOMMERCE SITEWIDE SALE &amp; DISCOUNT RULES<\/h4>\n<p>Run fixed, percentage, sitewide, cart, checkout, conditional, exclusive discount offer campaigns. <a href=\"https:\/\/www.offermative.com\/woocommerce-discount-plugin\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn more<\/a>. For example, a sitewide sale during Black Cyber, Christmas or other special occasions.<\/p>\n<blockquote>\n<p>“I instantly got attracted to the readymade offer designs. Everything is so quick and automatic that I can run discount offers on lots of different products and grow sales easily.”<br \/>\n  &#8211; Dror Beckerman, Sous Vide<\/p>\n<\/blockquote>\n<p><a href=\"https:\/\/demo.offermative.com\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">View Demo<\/a> | <a href=\"https:\/\/www.offermative.com\/documentation\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Documentation<\/a><\/p>\n<h4>ALL THE POWERFUL FEATURES TO OPTIMIZE YOUR WOOCOMMERCE SALES FUNNEL<\/h4>\n<ul>\n<li><strong>Auto-apply coupons<\/strong> – No manual coupon creation, no dealing with promo coupon code ideas. Offermative will automatically create coupons and apply them for the users. Smart coupons, isn’t it?<\/li>\n<li><strong>Product selection<\/strong> – Offermative studies your store catalog and order history to pick up what products should be promoted, whether they should be discounted or not. But you can change this easily. It can use your existing product images or show images on its own.<\/li>\n<li><strong>Dynamic targeting rules<\/strong> – Who should see the promotion campaign? What should be the minimum cart total to show the offer? Offermative sets up multiple targeting rules to the offers to a limited set of qualified customers. You can tweak this if you need it. Full control in your hands.<\/li>\n<li><strong>Mobile-responsive upsell templates<\/strong> – High converting, beautifully designed offer messages. WooCommerce upsell popups, inline, messengers (slide-ins) with person photos, header \/ footer bars, notification boxes. All the lead generation-style message types to show your offers.<\/li>\n<li><strong>A\/B split testing<\/strong> – Would a popup work better or a header bar? Or an inline message? Each Offermative campaign can contain multiple messages and they are all split tested automatically.<\/li>\n<li><strong>Micro-offers<\/strong> – Run offers on thousands of product variations without any effort. And identity which converts well. So you don’t have to worry about hitting visitors with too many promotions. As a matter of fact, larger stores may run dozens of campaigns at the same time.<\/li>\n<li><strong>Expert copywriting &amp; CTAs<\/strong> – If you are looking for how to write a discount offer, Offermative will take some of your burden by writing all the promotion copy for you! What headlines and CTAs will close the sale? How to tap into the pain and desires of the audience? <\/li>\n<li><strong>Customizable designs<\/strong> &#8211; You have full flexibility to customize the copy and CTAs. From Add to Cart to Buy Now, name the CTA’s as you wish.<\/li>\n<li><strong>Translations \/ Multilingual<\/strong> – Website not in English? Our AI copywriting generator also supports translations for a whole range of popular languages like French, German, Spanish, Hebrew, Italian, Brazilian, Japanese and others.<\/li>\n<li><strong>Schedule and manage campaigns<\/strong> – Select the date and time when you want to make the offer campaigns live – now, a few hours later today, tomorrow or any other day. You can extend campaigns that are working well or stop the ones that are not performing. <\/li>\n<li><strong>Tracking &amp; Analytics<\/strong> – Offermative tracks everything it does and learns how to run better campaigns for you. Monitor campaigns, improve, repeat. The more you use it, the better results you can experience.<\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.offermative.com\/features\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Learn about all the features<\/a><\/p>\n<blockquote>\n<p>“I aim to convert all the new visitors \/ cold traffic using offers. And the best thing is Offermative does it all without me putting in any effort.&#8221;<br \/>\n  &#8211; Sophia Wright, Room For Roots<\/p>\n<\/blockquote>\n<h4>WORKS WITH POPULAR PLUGINS, THEMES AND DIFFERENT PRODUCT TYPES IN WOOCOMMERCE<\/h4>\n<ul>\n<li><strong>Plugins<\/strong> – Offermative adheres to WooCommerce standards and works with other plugins. It would work even with other WooCommerce sales funnel plugins.<\/li>\n<li><strong>Themes<\/strong> – Offermative won’t mess up your WordPress theme, nor can your theme distort Offermative designs. We’ve tested it with popular themes as well.<\/li>\n<li><strong>Physical products<\/strong> – Clear inventory, control discounts, exclude certain products from promotions&#8230; Offermative is magical for e-commerce.<\/li>\n<li><strong>Digital downloads &amp; virtual<\/strong> – Clever discounting and bundling can immediately improve results for everyone selling downloadable or virtual products.<\/li>\n<li><strong>Subscriptions<\/strong> – Offermative supports WooCommerce Subscriptions plugin and can run offers for recurring products easily.<\/li>\n<li><strong>Product variations<\/strong> – Offermative is compatible with variable products and can allow people to select an appropriate variation when they claim an offer.<\/li>\n<li><strong>Payment gateways<\/strong> – Offermative is compatible with all payment gateways that WooCommerce supports.<\/li>\n<li><strong>High volume merchants<\/strong> – Offermative won’t slow down your site. All campaigns have targeting rules so they will show only to an appropriate audience.<\/li>\n<\/ul>\n<blockquote>\n<p>As I don’t run discounts, the plugin provides the flexibility to show related products without a discount. The automated rules are a great addition for specific targeting. Felt really happy to come across such a plugin.<br \/>\n  &#8211; Nicolai Grut, GrutBrushes<\/p>\n<\/blockquote>\n<p>Since Offermative can take care of the entire sales \/ promotion process and is tightly integrated with WooCommerce, it will become your “automatic sales machine”, closing orders and making sales on its own.<br \/>\nEach additional order you get through Offermative helps you get closer to your goals. Offermative is a ground-breaking solution and we’re here for your success.<\/p>\n<p><strong>Simply reading about Offermative won&#8217;t boost your sales; you need to experience it. Run campaigns, witness the results, and realize the plugin&#8217;s true worth!<\/strong><\/p>\n<p>And if you consider the RoI, Offermative essentially becomes a free WordPress upsell plugin, adding significant value to your business.<\/p>\n<p>Questions?<br \/>\n<a href=\"https:\/\/www.offermative.com\/contact\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Contact us<\/a><\/p>\n<h4>RECOMMENDED PLUGINS<\/h4>\n<p>Offermative is developed by <a href=\"https:\/\/www.storeapps.org\/?utm_source=wprepo&amp;utm_medium=web&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">StoreApps<\/a>, an official WooCommerce extensions developer.  More than a decade of track record, 320k+ customers, 400+ five-star reviews and renowned support. Our best-selling and popular plugins &#8211;<\/p>\n<ul>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-manager\/?utm_source=wprepo&amp;utm_medium=web_sm&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Smart Manager for WooCommerce &amp; WordPress<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/bulk-variations-manager\/?utm_source=wprepo&amp;utm_medium=web_bvm&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Bulk Variations Manager<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/how-to-create-1-click-upsells-in-woocommerce\/?utm_source=wprepo&amp;utm_medium=web_so&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce One Click Upsell<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-coupons\/?utm_source=wprepo&amp;utm_medium=web_sc&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce Smart Coupons<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/smart-emails\/?utm_source=wprepo&amp;utm_medium=web_se&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Email Customizer for WooCommerce<\/a><\/li>\n<li><a href=\"https:\/\/www.storeapps.org\/product\/offer-your-price\/?utm_source=wprepo&amp;utm_medium=web_oyp&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">WooCommerce Name Your Price Plugin<\/a><\/li>\n<li><a href=\"https:\/\/woo.com\/products\/affiliate-for-woocommerce\/?utm_source=wprepo&amp;utm_medium=web_oyp&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Affiliate for WooCommerce<\/a><\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.storeapps.org\/woocommerce-plugins\/?utm_source=wprepo&amp;utm_medium=web_others&amp;utm_campaign=omwp_readme\" rel=\"nofollow ugc\">Check out all our WooCommerce plugins<\/a><\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.5.0.0.zip",
    "upgrade_notice": {
        "5.0.0": "<p>WooCommerce 7.0.1 compatible, WordPress 6.1.0 compatible, Fixes related to PHP Warning: magic method SA_Offermative::__wakeup() must have public visibility along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "4.0.0": "<p>Added support for editing offer campaign message templates, WordPress v6.0.0 compatible &amp; WooCommerce v6.6.0 compatible, Updates related to Additional comparison operators for &#039;Product quantity&#039;, &#039;LTV&#039;, &#039;Cart total&#039; and &#039;Category total in cart&#039; offer campaigns rules along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "3.0.0": "<p>Added Support for JavaScript string translations, WordPress v5.9.3 compatible &amp; WooCommerce v6.3.1 compatible, Fixes related to &#039;you can have max 0 campaigns&#039; error message when trying to publish generated campaigns along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "2.0.0": "<p>Added Support for updating campaign start &amp; end dates, Updates related to Compatibility with latest versions of WordPress (v5.8.1) &amp; WooCommerce (v5.7.1), Show campaign start &amp; end dates as per site timezone on campaign dashboard, UI\/UX Improvements along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.7.0": "<p>Added Support for generation of specific campaign offer types &amp; user based restrictions, Compatibility with latest version of WooCommerce (v5.4.1), Fixes related to Display Offer Campaigns start &amp; end date as per site timezone, &#039;Product&#039; selection appearing as blank in Campaign Details in some cases along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.6.0": "<p>Added Support for editing &amp; adding campaign rules, Compatibility with latest versions of WordPress (v5.7.2) &amp; WooCommerce (v5.3.0), Fixes related to plugin not deactivating in some cases along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.5.0": "<p>Compatibility with WordPress 5.6.2 compatible, Added support for generation of message copy texts in different languages in addition to English language, Updates related to Admin UI\/UX improvements along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.4.0": "<p>Compatibility with WooCommerce 5.0.0, Improvements in the campaign generation code, Fixes related to Campaigns having variable product as the offered product not showing up properly, Campaigns not showing up in some cases if the user is already on the site, Campaigns not showing in some cases as page not getting detected properly due to permalink Settings along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.3.0": "<p>Compatibility with WordPress 5.6.1 &amp; WooCommerce 4.9.2, Updates related to Improvements in the campaign generation code, Fixes related to Campaign Detail dialog randomly opening in some cases, Message preview not updating on change of offer discount or offer product along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.2.0": "<p>Compatibility with WooCommerce 4.9.1, Updates related to Contact us page link from the plugin, Filters to control the offer types while generating campaigns along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.1.0": "<p>Added support for updating the campaign title, Compatibility with WordPress 5.6 &amp; WooCommerce 4.9.0, Updates related to display rules, start &amp; end time for campaigns along with other important updates &amp; fixes. Recommended upgrade.<\/p>",
        "1.0.0": "<p>Initial release<\/p>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-1.png?rev=2425571",
            "caption": "<p>Offermative Dashboard<\/p>"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-2.png?rev=3023898",
            "caption": "<p>Settings page<\/p>"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-3.png?rev=2425571",
            "caption": "<p>Campaign generation dialog<\/p>"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-4.png?rev=3023898",
            "caption": "<p>Login page<\/p>"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-5.png?rev=3023898",
            "caption": "<p>Offer Campaign Message Type - Popup<\/p>"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-6.png?rev=3023898",
            "caption": "<p>Offer Campaign Message Type - Messenger<\/p>"
        },
        "7": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-7.png?rev=3023898",
            "caption": "<p>Offer Campaign Type - Product Recommendations<\/p>"
        },
        "8": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-8.png?rev=3023898",
            "caption": "<p>Offer Campaign Type - Upsell<\/p>"
        },
        "9": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-9.png?rev=3023898",
            "caption": "<p>Offer Campaign Type - Order Bump<\/p>"
        },
        "10": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-10.png?rev=3023898",
            "caption": "<p>Offer Campaign Type - Cross Sell<\/p>"
        },
        "11": {
            "src": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/screenshot-11.png?rev=3023898",
            "caption": "<p>Offer Campaign Type - Sitewide<\/p>"
        }
    },
    "tags": {
        "cart-upsell": "cart upsell",
        "discounts": "discounts",
        "woocommerce": "woocommerce",
        "woocommerce-bogo": "woocommerce bogo",
        "woocommerce-upsell": "woocommerce upsell"
    },
    "stable_tag": "5.0.0",
    "versions": {
        "1.0.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.0.0.zip",
        "1.1.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.1.0.zip",
        "1.2.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.2.0.zip",
        "1.3.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.3.0.zip",
        "1.4.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.4.0.zip",
        "1.5.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.5.0.zip",
        "1.6.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.6.0.zip",
        "1.7.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.1.7.0.zip",
        "2.0.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.2.0.0.zip",
        "3.0.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.3.0.0.zip",
        "4.0.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.4.0.0.zip",
        "5.0.0": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.5.0.0.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=CPTHCDC382KVA",
    "banners": {
        "low": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/banner-772x250.png?rev=2425571",
        "high": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/banner-1544x500.png?rev=2425571"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/icon-128x128.png?rev=2426472",
        "2x": "https:\/\/ps.w.org\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/assets\/icon-256x256.png?rev=2425682"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce",
            "language": "ru_RU",
            "version": "5.0.0",
            "updated": "2022-05-25 09:24:23",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/offermative-discount-pricing-related-products-upsell-funnels-for-woocommerce\/5.0.0\/ru_RU.zip"
        }
    ]
}