{
    "name": "payever &#8211; WooCommerce Gateway",
    "slug": "payever-woocommerce-gateway",
    "version": "2.4.3",
    "author": "<a href=\"https:\/\/getpayever.com\/\">payever<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/payever\/",
    "contributors": {
        "payever": {
            "profile": "https:\/\/profiles.wordpress.org\/payever\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/063f58906ab6d471ff4f13d731915a03?s=96&d=monsterid&r=g",
            "display_name": "payever"
        }
    },
    "requires": "4.4",
    "tested": "6.4.4",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/payever-woocommerce-gateway\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 12574,
    "last_updated": "2024-03-22 7:17pm GMT",
    "added": "2016-10-14",
    "homepage": "https:\/\/getpayever.com\/",
    "sections": {
        "description": "<p>(Für den deutschen Beschreibungstext bitte nach unten scrollen)<br \/>\npayever Checkout &#8211; Composable Payment Gateway. For Free.<\/p>\n<p>With payever Checkout you can offer your customers a variety of payment methods &#8211; from B2C\/B2B Buy Now Pay Later, Installments &amp; Financing to Credit Card payments, PayPal, local payment methods and real time bank transfers based on Open banking technologies &#8211; with just one plugin.<br \/>\nYou can also benefit from an exclusive selection of payment options from our close partners Santander, Openbank and Ivy.<br \/>\nMore than 5,000 merchants in 9 countries trust in us already &#8211; with a simple integration and just a few clicks you can be part of it too!<br \/>\nVisit us at <a href=\"https:\/\/www.getpayever.com\/checkout\" rel=\"nofollow ugc\">www.getpayever.com\/checkout<\/a> to learn more!<\/p>\n<p><strong>Highlights<\/strong><br \/>\n* B2C &amp; B2B Buy Now Pay Later: Pay in 14 or 30 days, split in up to 36 monthly installments as well as traditional financing with best terms and conditions for both costumers and merchants, we offer different types of buy now pay later products &#8211; in cooperation with our partners Santander, Openbank and Allianz Trade.<br \/>\n* Sustainability: Together with our exclusive partner Ivy, you and your customers can support certified climate protection projects with every payment &#8211; without any additional costs.<br \/>\n* All Payment Options: With payever Checkout you can offer your customers all common payment options via just one partner &#8211; without having to install and maintain multiple plugins.<br \/>\n* Free of Charge: payever is not charging any setup or transaction fees &#8211; you only bear the costs of the respective payment provider or bank. You can even benefit from lower partner conditions for specific payment options.<br \/>\n* Checkout Branding: You can completely customize your payever Checkout &#8211; upload your logo and adjust colors, fields as well as buttons so that the checkout fits your online shop perfectly.<\/p>\n<p><strong>Our Payment Options<\/strong><br \/>\nSantander BNPL &#8211; You get paid right away, your customers pay in 30 days by bank transfer to our partner Santander.<br \/>\n* Payment period: 30 days<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Availability: Germany, Norway<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Splitpay &#8211; You get paid in full right away, your customers pay in affordable installments to our partner Santander.<br \/>\n* Payment period: 3 &#8211; 36 Month (customer interest rate between 0% &#8211; 7,9%)<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Availability: Germany<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Financing \/ Installments &#8211; You get paid in full right away with zero risk of default, while your customers pay back at their own pace in up to 72 affordable installments to our partner Santander.<br \/>\n* Payment period: 6 &#8211; 72 Month (0% financing possible)<br \/>\n* Special Feature: The process is completely digital with video legitimation and electronic signing.<br \/>\n* Availability: Germany, Austria, Netherlands, Belgium, Sweden, Denmark, Norway, Finland, UK<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Zinia Buy Now Pay Later &#8211; You get paid right away, your customers pay after receiving their order by bank transfer to our partner Zinia.<br \/>\n* Availability: Germany, Netherlands<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>B2B Buy Now Pay Later by Allianz Trade &#8211; Allows merchants to offer flexible paymet terms to all their business customers.<br \/>\n* Availability: Europe, USA<br \/>\n* Special Feature: Decision in real time. No document check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Swedbank Pay Invoice &#8211; You get paid right away, your customers pay after receiving their order by bank transfer to our partner Swedbank.<br \/>\n* Availability: Sweden, Finland, Norway<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Ivy &#8211; Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process. As a green payment method, Ivy combines the topics payment with sustainability and structurally reduces transaction fees through open banking. Ivy uses these cost savings to offer merchants the lowest transactions fees on the market and to support climate protection projects with every transaction.<br \/>\n* Availability: Germany, Finland, France, Italy, Estonia, Lithuania, Netherlands, Portugal, Austria, Spain, Great Britain, Belgium, Hungary, Ireland, Latvia, Poland, Australia<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Instant Payments &#8211; Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process.<br \/>\n* Special Feature: Beneficial terms and conditions in combination with other Santander payment methods.<br \/>\n* Availability: Germany, Austria, Switzerland<br \/>\n* Transactions fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Sofort (Klarna) &#8211; The modern version of prepayment. The customer transfers the purchase amount via online banking, you immediately receive a transactions confirmation and can start the shipping process.<br \/>\n* Availability: Germany, Austria, Netherlands, Belgium, Spain, Italy, Switzerland, Poland, Great Britain<br \/>\n* Special Feature: Partner Conditions of 0,8% + 0,25€ fix<\/p>\n<p>Stripe Credit Card &#8211; Via Stripe or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Stripe.<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>Swedbank Pay Credit Card &#8211; Via Swedbank Pay or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Swedbank Pay.<br \/>\n* Transaction Fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Apple Pay &#8211; Apple Pay replaces debit cards and cash with a simpler, safer, and more private payment method, wether in store on a website or in an app.<br \/>\n* Availability: Worldwide<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>Google Pay &#8211; The simple way to pay in store, in apps or in online shops. Your customers can also collect bonuses and store their favourite cards &#8211; all at one place.<br \/>\n* Availability: Worldwide<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>PayPal &#8211; This payment provider is popular worldwide and offers you and your customers extra protection in case of lost parcels and attempts of fraud.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding by simply connecting your existing PayPal account.<br \/>\n* Transaction fees: Between 1.49% to 2.49% (depending on the total monthly volume) + € 0.35 fixed fee.<\/p>\n<p>Prepayment &#8211; The customer transfers the money in advance and you ship the goods as soon as the money has arrived.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Fast onboarding and instant availability with just a few clicks.<br \/>\n* Transaction fees: None &#8211; Wire transfer is free of charge!<\/p>\n<p>Direct Debit (SEPA): &#8211; Direct Debit is still a very common payment method: During the checkout process your customers just give permission to debit the amount from their bank account.<br \/>\n* Availability: 36 countries within the Single Euro Payment Area (SEPA).<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Stripe.<br \/>\n* Transactions fees: 0,35€ fix<\/p>\n<p>(DEUTSCH)<br \/>\npayever Checkout &#8211; Kompatibles Zahlungs-Gateway. Kostenfrei.<\/p>\n<p>Mit payever Checkout können Sie Ihren Kunden eine Vielzahl von Zahlungsmethoden anbieten &#8211; von B2C\/B2B Buy Now Pay Later, Ratenzahlung &amp; Finanzierung bis hin zu Kreditkartenzahlungen, PayPal, lokalen Zahlungsmethoden und Echtzeit-Überweisungen auf Basis von Open Banking Technologien &#8211; mit nur einem Plugin.<br \/>\nSie können auch von einer exklusiven Auswahl an Zahlungsoptionen unserer engen Partner Santander, Openbank und Ivy profitieren.<br \/>\nMehr als 5.000 Händler in 9 Ländern vertrauen uns bereits &#8211; mit einer einfachen Integration und nur wenigen Klicks können auch Sie dazugehören!<br \/>\nBesuchen Sie uns auf <a href=\"https:\/\/www.getpayever.com\/checkout\" rel=\"nofollow ugc\">www.getpayever.com\/checkout<\/a> und erfahren Sie mehr!<\/p>\n<p><strong>Höhepunkte<\/strong><br \/>\n* B2C &amp; B2B Jetzt kaufen, später bezahlen: Bezahlen in 14 oder 30 Tagen, aufgeteilt in bis zu 36 Monatsraten sowie klassische Finanzierungen mit besten Konditionen für Kunden und Händler bieten wir in Zusammenarbeit mit unseren Partnern Santander, Openbank und Allianz Trade an.<br \/>\n* Nachhaltigkeit: Gemeinsam mit unserem Exklusivpartner Ivy können Sie und Ihre Kunden mit jeder Zahlung zertifizierte Klimaschutzprojekte unterstützen &#8211; ohne zusätzliche Kosten.<br \/>\n* Alle Zahlungsoptionen: Mit payever Checkout können Sie Ihren Kunden alle gängigen Zahlungsmöglichkeiten über nur einen Partner anbieten &#8211; ohne mehrere Plugins installieren und pflegen zu müssen.<br \/>\n* Kostenlos: payever erhebt keine Einrichtungs- oder Transaktionsgebühren &#8211; Sie tragen nur die Kosten des jeweiligen Zahlungsanbieters oder der Bank. Sie können sogar von günstigeren Partnerkonditionen für bestimmte Zahlungsoptionen profitieren.<br \/>\n* Checkout-Branding: Sie können Ihren payever Checkout komplett anpassen &#8211; laden Sie Ihr Logo hoch und passen Sie Farben, Felder sowie Buttons so an, dass der Checkout perfekt zu Ihrem Online-Shop passt.<\/p>\n<p><strong>Unsere Zahlungsoptionen<\/strong><br \/>\nSantander BNPL &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen innerhalb von 30 Tagen per Überweisung an unseren Partner Santander.<br \/>\n* Zahlungsfrist: 30 Tage<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung erforderlich.<br \/>\n* Verfügbarkeit: Deutschland, Norwegen<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander Splitpay &#8211; Sie werden sofort in voller Höhe bezahlt, Ihre Kunden zahlen in günstigen Raten an unseren Partner Santander.<br \/>\n* Zahlungszeitraum: 3 &#8211; 36 Monate (Kundenzinssatz zwischen 0% &#8211; 7,9%)<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Verfügbarkeit: Deutschland<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander-Finanzierung \/ Ratenzahlung &#8211; Sie erhalten sofort den vollen Betrag ohne Ausfallrisiko, während Ihre Kunden in bis zu 72 günstigen Raten an unseren Partner Santander zurückzahlen.<br \/>\n* Zahlungszeitraum: 6 &#8211; 72 Monate (0% Finanzierung möglich)<br \/>\n* Besonderes Merkmal: Der Prozess ist vollständig digital mit Videolegitimation und elektronischer Unterschrift.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Niederlande, Belgien, Schweden, Dänemark, Norwegen, Finnland, UK<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Zinia Buy Now Pay Later &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen nach Erhalt ihrer Bestellung per Überweisung an unseren Partner Zinia.<br \/>\n* Verfügbarkeit: Deutschland, Niederlande<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>B2B Buy Now Pay Later by Allianz Trade &#8211; Ermöglicht es Händlern, allen ihren Geschäftskunden flexible Zahlungsbedingungen anzubieten.<br \/>\n* Verfügbarkeit: Europa, USA<br \/>\n* Besonderes Merkmal: Entscheidung in Echtzeit. Keine Dokumentenprüfung erforderlich.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Swedbank Pay Invoice &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen nach Erhalt ihrer Bestellung per Überweisung an unseren Partner Swedbank.<br \/>\n* Verfügbarkeit: Schweden, Finnland, Norwegen<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Ivy &#8211; Open Banking ermöglicht es Ihren Kunden, den Kaufbetrag in Echtzeit per Online-Banking-Zugang während des Bestellvorgangs zu überweisen. Sie erhalten sofort die Transaktionsbestätigung und können den Lieferprozess starten. Als grüne Zahlungsmethode verbindet Ivy die Themen Bezahlen und Nachhaltigkeit und reduziert strukturell die Transaktionsgebühren durch Open Banking. Ivy nutzt diese Kosteneinsparungen, um Händlern die niedrigsten Transaktionsgebühren am Markt zu bieten und mit jeder Transaktion Klimaschutzprojekte zu unterstützen.<br \/>\n* Verfügbarkeit: Deutschland, Finnland, Frankreich, Italien, Estland, Litauen, Niederlande, Portugal, Österreich, Spanien, Großbritannien, Belgien, Ungarn, Irland, Lettland, Polen, Australien<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander Instant Payments &#8211; Open Banking ermöglicht Ihren Kunden, den Kaufbetrag in Echtzeit über den Online-Banking-Zugang während des Bestellvorgangs zu überweisen. Sie erhalten sofort die Transaktionsbestätigung und können den Lieferprozess starten.<br \/>\n* Besonderes Merkmal: Vorteilhafte Konditionen in Kombination mit anderen Santander-Zahlungsarten.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Schweiz<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Sofort (Klarna) &#8211; Die moderne Variante der Vorkasse. Der Kunde überweist den Kaufbetrag per Online-Banking, Sie erhalten sofort eine Transaktionsbestätigung und können den Versandvorgang starten.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Niederlande, Belgien, Spanien, Italien, Schweiz, Polen, Grossbritannien<br \/>\n* Besonderes Merkmal: Partnerkonditionen von 0,8% + 0,25€ fix<\/p>\n<p>Stripe Credit Card &#8211; Über Stripe oder können Sie alle gängigen Kreditkarten akzeptieren: Visa, Master, American Express, JCB und Diners.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Stripe.<br \/>\n* Transaktionsgebühren: 1,4% + € 0,25 für in Europa ausgegebene Karten, 2,9% + € 0,25 für außerhalb Europas ausgegebene Karten.<\/p>\n<p>Swedbank Pay Credit Card &#8211; Über Swedbank Pay oder können Sie alle gängigen Kreditkarten akzeptieren: Visa, Master, American Express, JCB und Diners.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Swedbank Pay.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Apple Pay &#8211; Apple Pay ersetzt Debitkarten und Bargeld durch eine einfachere, sicherere und privatere Zahlungsmethode, egal ob im Geschäft, auf einer Website oder in einer App.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Transaktionsgebühren: 1,4 % + 0,25 € für in Europa ausgestellte Karten, 2,9 % + 0,25 € für außerhalb Europas ausgestellte Karten.<\/p>\n<p>Google Pay &#8211; Die einfache Art, im Geschäft, in Apps oder in Online-Shops zu bezahlen. Ihre Kunden können auch Boni sammeln und ihre Lieblingskarten speichern &#8211; alles an einem Ort.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Transaktionsgebühren: 1,4 % + 0,25 € für in Europa ausgestellte Karten, 2,9 % + 0,25 € für außerhalb Europas ausgestellte Karten.<\/p>\n<p>PayPal &#8211; Dieser Zahlungsanbieter ist weltweit beliebt und bietet Ihnen und Ihren Kunden zusätzlichen Schutz bei verlorenen Paketen und Betrugsversuchen.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding durch einfaches Verbinden Ihres bestehenden PayPal-Kontos.<br \/>\n* Transaktionsgebühren: Zwischen 1,49% und 2,49% (abhängig vom monatlichen Gesamtvolumen) + 0,35 € Fixgebühr.<\/p>\n<p>Vorkasse &#8211; Der Kunde überweist das Geld im Voraus und Sie versenden die Ware, sobald das Geld eingegangen ist.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Schnelles Onboarding und sofortige Verfügbarkeit mit nur wenigen Klicks.<br \/>\n* Transaktionsgebühren: Keine &#8211; die Überweisung ist kostenlos!<\/p>\n<p>Lastschriftverfahren (SEPA): &#8211; Das Lastschriftverfahren ist nach wie vor eine sehr verbreitete Zahlungsmethode: Während des Bezahlvorgangs geben Ihre Kunden einfach die Erlaubnis, den Betrag von ihrem Bankkonto abzubuchen.<br \/>\n* Verfügbarkeit: 36 Länder innerhalb der Single Euro Payment Area (SEPA).<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Stripe.<br \/>\n* Transaktionsgebühren: 0,35€ fix<\/p>\n",
        "installation": "<p>(Für den deutschen Beschreibungstext bitte nach unten scrollen)<\/p>\n<p>The integration is easy and doesn&#8217;t require coding skills!<\/p>\n<p>Should there ever be a problem, please send a description (if possible with screenshot) and the email address you have used to create you payever account to support@payever.de<\/p>\n<p>Step 1:<br \/>\nPlease first <a href=\"https:\/\/commerceos.payever.org\/entry\/registration\/business\" rel=\"nofollow ugc\">create<\/a> a payever account and configure the payment methods you want to integrate. Detailed instructions can be found <a href=\"https:\/\/support.payever.org\/hc\/en-us\/articles\/360023893874-How-to-setup-a-checkout\" rel=\"nofollow ugc\">here<\/a>.<\/p>\n<p>Step 2:<br \/>\nThe next step is to upload the plugin files to the \/wp-content\/plugins\/ directory or to install the plugin in the WordPress plguins screen directly and adjust some settings. Detailed instructions can be found <a href=\"https:\/\/support.payever.org\/hc\/en-us\/articles\/360024065033\" rel=\"nofollow ugc\">here<\/a>.<\/p>\n<p>(DEUTSCH)<\/p>\n<p>Die Integration ist einfach und erfordert kein Vorwissen oder Programmierkenntnisse!<\/p>\n<p>Sollte es doch einmal ein Problem geben, senden Sie bitte unter Angabe Ihres payever Kontos eine Schilderung (gerne mit Screenshot) an support@payever.de<\/p>\n<p>Schritt 1:<br \/>\nBitte legen Sie sich zuerst ein <a href=\"https:\/\/commerceos.payever.org\/entry\/registration\/business\" rel=\"nofollow ugc\">Konto<\/a> bei payever an und konfigurieren Sie die Zahlungsarten, die Sie integrieren möchten. Folgen Sie dazu bitte dieser <a href=\"https:\/\/support.payever.org\/hc\/de\/articles\/360008415419\" rel=\"nofollow ugc\">Anleitung<\/a>.<\/p>\n<p>Schritt 2:<br \/>\nIm nächsten Schritt müssen Sie das Plugin herunterladen und einige Einstellungen treffen. Eine genaue Anleitung dazu finden Sie <a href=\"https:\/\/support.payever.org\/hc\/de\/articles\/360024065033-WooCommerce\" rel=\"nofollow ugc\">hier<\/a>.<\/p>\n",
        "faq": "\n<dt id='do%20i%20have%20to%20use%20all%20payment%20options%20or%20can%20i%20only%20use%20parts%20of%20it%3F'>\nDo I have to use all payment options or can I only use parts of it?\n<\/h4>\n<p>\n<p>You can choose any number of payment methods you want to integrate – of course, you can also choose only one payment method if you already have the others.<\/p>\n<\/p>\n<dt id='is%20payever%20really%20free%3F'>\nIs payever really free?\n<\/h4>\n<p>\n<p>payever doesn’t charge you anything extra – you neither pay set up fees nor monthly recurrent fees to us and aren’t contractually bound to us. Transaction fees are only paid to the respective payment provider (for instance, PayPal). payever does NOT add any extra fees on top of that.<\/p>\n<\/p>\n<dt id='what%20makes%20payever%20different%3F'>\nWhat makes payever different?\n<\/h4>\n<p>\n<p>payever is a commerce platform that allows you to easily connect your business to all relevant payment providers. Besides the checkout, payever offers a broad range of addtional e-commerce services for your business.<\/p>\n<\/p>\n\n",
        "changelog": "<h4>1.2.2<\/h4>\n<ul>\n<li>Start version of plugin.<\/li>\n<\/ul>\n<h4>1.3.0<\/h4>\n<ul>\n<li>Added Santander Installment Sweden.<\/li>\n<\/ul>\n<h4>1.4.0<\/h4>\n<ul>\n<li>Added method PayEx Faktura.<\/li>\n<\/ul>\n<h4>1.5.0<\/h4>\n<ul>\n<li>Added Santander Invoice DE payment option.<\/li>\n<\/ul>\n<h4>1.6.0<\/h4>\n<ul>\n<li>Added Santander Factoring payment option.<\/li>\n<\/ul>\n<h4>1.7.0<\/h4>\n<ul>\n<li>Payever SDK implementation.<\/li>\n<\/ul>\n<h4>1.8.0<\/h4>\n<ul>\n<li>Implemented refund functionality.<\/li>\n<\/ul>\n<h4>1.9.0<\/h4>\n<ul>\n<li>Fixed getting pan_id functionality.<\/li>\n<\/ul>\n<h4>1.10.1<\/h4>\n<ul>\n<li>Added Stripe Direct Debit payment option.<\/li>\n<\/ul>\n<h4>1.10.3<\/h4>\n<ul>\n<li>Resolved division by zero issue for 0-priced cart items.<\/li>\n<\/ul>\n<h4>1.10.4<\/h4>\n<ul>\n<li>Added &#8220;allow-popups allow-modals&#8221; to iframe &#8220;sandbox&#8221; attribute.<\/li>\n<\/ul>\n<h4>1.10.5<\/h4>\n<ul>\n<li>Minor fixes.<\/li>\n<\/ul>\n<h4>1.10.6<\/h4>\n<ul>\n<li>Minor fixes.<\/li>\n<\/ul>\n<h4>1.11.0<\/h4>\n<ul>\n<li>Refactoring.<\/li>\n<\/ul>\n<h4>1.11.1<\/h4>\n<ul>\n<li>Minor fixes.<\/li>\n<\/ul>\n<h4>1.11.3<\/h4>\n<ul>\n<li>Removed token checks.<\/li>\n<\/ul>\n<h4>1.12.0<\/h4>\n<ul>\n<li>Implemented SDK 2.0 usage.<\/li>\n<\/ul>\n<h4>1.12.1<\/h4>\n<ul>\n<li>Bugfix: Call to a member function get_payment_method() on null<\/li>\n<\/ul>\n<h4>1.12.2<\/h4>\n<ul>\n<li>Bugfix: Fix for PHP Warning<\/li>\n<\/ul>\n<h4>1.13.0<\/h4>\n<ul>\n<li>Compatibility with WordPress 5.3<\/li>\n<\/ul>\n<h4>1.13.2<\/h4>\n<ul>\n<li>Minor fixes<\/li>\n<\/ul>\n<h4>1.14.0<\/h4>\n<ul>\n<li>Implemented payment option variants API<\/li>\n<\/ul>\n<h4>1.14.1<\/h4>\n<ul>\n<li>Fixed notice messages<\/li>\n<\/ul>\n<h4>1.14.3<\/h4>\n<ul>\n<li>Fixed warning messages in emails<\/li>\n<\/ul>\n<h4>1.14.4<\/h4>\n<ul>\n<li>Minor fixes<\/li>\n<\/ul>\n<h4>1.15.0<\/h4>\n<ul>\n<li>Implemented plugin registry and commands API, plugin embedded support info, products synchronization<\/li>\n<\/ul>\n<h4>1.15.1<\/h4>\n<ul>\n<li>Minor fixes<\/li>\n<\/ul>\n<h4>1.15.2<\/h4>\n<ul>\n<li>Fixed stock issue<\/li>\n<\/ul>\n<h4>1.15.3<\/h4>\n<ul>\n<li>Adjusted PAN ID block<\/li>\n<\/ul>\n<h4>1.16.0<\/h4>\n<ul>\n<li>Implemented payment notifications signature<\/li>\n<\/ul>\n<h4>1.17.0<\/h4>\n<ul>\n<li>Fixed outward product delete action and warnings in synchronization queue<\/li>\n<\/ul>\n<h4>1.17.1<\/h4>\n<ul>\n<li>Fixed refund issue<\/li>\n<\/ul>\n<h4>1.18.0<\/h4>\n<ul>\n<li>Made plugin compatible with DHL for WooCommerce<\/li>\n<\/ul>\n<h4>1.19.0<\/h4>\n<ul>\n<li>Implemented submit payment<\/li>\n<li>Fixed plugin compatibility with minor versions of WordPress and WooCommerce<\/li>\n<li>Involved new verison of Payever\\ExternalIntegration\\Payments\\Action\\ActionDecider<\/li>\n<\/ul>\n<h4>1.20.0<\/h4>\n<ul>\n<li>Added uninstall hook<\/li>\n<li>Made valid product sku in cart<\/li>\n<li>Fixed issue during enqueuing javascripts<\/li>\n<li>Improved sku in cproducts and inventory synchronization<\/li>\n<\/ul>\n<h4>1.22.0<\/h4>\n<ul>\n<li>implemented callback controllers for Finance Express widget<\/li>\n<\/ul>\n<h4>1.23.0<\/h4>\n<ul>\n<li>Improved expired shop session handling in checkout callbacks<\/li>\n<\/ul>\n<h4>1.24.0<\/h4>\n<ul>\n<li>Fixed error message upon synchronization<\/li>\n<li>PHP 8 compatibility<\/li>\n<li>WordPress 5.8 compatibility<\/li>\n<\/ul>\n<h4>1.25.0<\/h4>\n<ul>\n<li>added shipping address to create payment request and processed hidden options<\/li>\n<li>added transaction ID to field transaction_id<\/li>\n<li>processed requests for invalid tokens (regenerated token)<\/li>\n<li>implemented payment_items in refund<\/li>\n<\/ul>\n<h4>1.25.1<\/h4>\n<ul>\n<li>updated compatibility version tags<\/li>\n<\/ul>\n<h4>1.26.0<\/h4>\n<ul>\n<li>fixed marketplace issues<\/li>\n<\/ul>\n<h4>1.26.1<\/h4>\n<ul>\n<li>implemented openbank cancel<\/li>\n<\/ul>\n<h4>1.27.0<\/h4>\n<ul>\n<li>implemented address equality for hidden methods<\/li>\n<\/ul>\n<h4>1.28.0<\/h4>\n<ul>\n<li>applied shipping details and payment items for shipping goods request<\/li>\n<\/ul>\n<h4>1.29.0<\/h4>\n<ul>\n<li>fixed payment methods variants issue<\/li>\n<li>added &#8220;allow-popups-to-escape-sandbox&#8221; sandbox attribute to iframe<\/li>\n<\/ul>\n<h4>1.30.0<\/h4>\n<ul>\n<li>Add configurable option for \/api\/v2\/payment endpoint<\/li>\n<\/ul>\n<h4>1.30.1<\/h4>\n<ul>\n<li>Add session fix for woocommerce version &gt;= 7.1<\/li>\n<\/ul>\n<h4>1.30.2<\/h4>\n<ul>\n<li>Fix amount and tax issues on shipping goods<\/li>\n<\/ul>\n<h4>1.31.0<\/h4>\n<ul>\n<li>Improved plugin registration functinality<\/li>\n<\/ul>\n<h4>1.31.1<\/h4>\n<ul>\n<li>Don&#8217;t send locale for redirect methods<\/li>\n<\/ul>\n<h4>1.31.2<\/h4>\n<ul>\n<li>Fixed PHP Warnings<\/li>\n<\/ul>\n<h4>2.0.0<\/h4>\n<ul>\n<li>Send logs via APM SDK to our Kibana from merchants plugins for diagnostics<\/li>\n<\/ul>\n<h4>2.1.0<\/h4>\n<ul>\n<li>Added express widget<\/li>\n<\/ul>\n<h4>2.1.1<\/h4>\n<ul>\n<li>Express widget fixes<\/li>\n<\/ul>\n<h4>2.1.2<\/h4>\n<ul>\n<li>Extended notification handling<\/li>\n<\/ul>\n<h4>2.1.4<\/h4>\n<ul>\n<li>Added region field for payment processing<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-1.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-1.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-2.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-2.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-3.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-3.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-4.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-4.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-5.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-5.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-6.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-6.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-7.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-7.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-8.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-8.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-9.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-9.jpg?rev=2943854\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-10.jpg?rev=2943854\"><img src=\"https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-10.jpg?rev=2943854\" alt=\"\"><\/a><\/li><\/ol>",
        "reviews": ""
    },
    "short_description": "With payever you can easily add all your preferred payment options to your checkout. Within minutes! Find more about us: www.getpayever.com",
    "description": "<p>(Für den deutschen Beschreibungstext bitte nach unten scrollen)<br \/>\npayever Checkout &#8211; Composable Payment Gateway. For Free.<\/p>\n<p>With payever Checkout you can offer your customers a variety of payment methods &#8211; from B2C\/B2B Buy Now Pay Later, Installments &amp; Financing to Credit Card payments, PayPal, local payment methods and real time bank transfers based on Open banking technologies &#8211; with just one plugin.<br \/>\nYou can also benefit from an exclusive selection of payment options from our close partners Santander, Openbank and Ivy.<br \/>\nMore than 5,000 merchants in 9 countries trust in us already &#8211; with a simple integration and just a few clicks you can be part of it too!<br \/>\nVisit us at <a href=\"https:\/\/www.getpayever.com\/checkout\" rel=\"nofollow ugc\">www.getpayever.com\/checkout<\/a> to learn more!<\/p>\n<p><strong>Highlights<\/strong><br \/>\n* B2C &amp; B2B Buy Now Pay Later: Pay in 14 or 30 days, split in up to 36 monthly installments as well as traditional financing with best terms and conditions for both costumers and merchants, we offer different types of buy now pay later products &#8211; in cooperation with our partners Santander, Openbank and Allianz Trade.<br \/>\n* Sustainability: Together with our exclusive partner Ivy, you and your customers can support certified climate protection projects with every payment &#8211; without any additional costs.<br \/>\n* All Payment Options: With payever Checkout you can offer your customers all common payment options via just one partner &#8211; without having to install and maintain multiple plugins.<br \/>\n* Free of Charge: payever is not charging any setup or transaction fees &#8211; you only bear the costs of the respective payment provider or bank. You can even benefit from lower partner conditions for specific payment options.<br \/>\n* Checkout Branding: You can completely customize your payever Checkout &#8211; upload your logo and adjust colors, fields as well as buttons so that the checkout fits your online shop perfectly.<\/p>\n<p><strong>Our Payment Options<\/strong><br \/>\nSantander BNPL &#8211; You get paid right away, your customers pay in 30 days by bank transfer to our partner Santander.<br \/>\n* Payment period: 30 days<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Availability: Germany, Norway<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Splitpay &#8211; You get paid in full right away, your customers pay in affordable installments to our partner Santander.<br \/>\n* Payment period: 3 &#8211; 36 Month (customer interest rate between 0% &#8211; 7,9%)<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Availability: Germany<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Financing \/ Installments &#8211; You get paid in full right away with zero risk of default, while your customers pay back at their own pace in up to 72 affordable installments to our partner Santander.<br \/>\n* Payment period: 6 &#8211; 72 Month (0% financing possible)<br \/>\n* Special Feature: The process is completely digital with video legitimation and electronic signing.<br \/>\n* Availability: Germany, Austria, Netherlands, Belgium, Sweden, Denmark, Norway, Finland, UK<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Zinia Buy Now Pay Later &#8211; You get paid right away, your customers pay after receiving their order by bank transfer to our partner Zinia.<br \/>\n* Availability: Germany, Netherlands<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>B2B Buy Now Pay Later by Allianz Trade &#8211; Allows merchants to offer flexible paymet terms to all their business customers.<br \/>\n* Availability: Europe, USA<br \/>\n* Special Feature: Decision in real time. No document check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Swedbank Pay Invoice &#8211; You get paid right away, your customers pay after receiving their order by bank transfer to our partner Swedbank.<br \/>\n* Availability: Sweden, Finland, Norway<br \/>\n* Special Feature: No loan agreement or identity check necessary.<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Ivy &#8211; Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process. As a green payment method, Ivy combines the topics payment with sustainability and structurally reduces transaction fees through open banking. Ivy uses these cost savings to offer merchants the lowest transactions fees on the market and to support climate protection projects with every transaction.<br \/>\n* Availability: Germany, Finland, France, Italy, Estonia, Lithuania, Netherlands, Portugal, Austria, Spain, Great Britain, Belgium, Hungary, Ireland, Latvia, Poland, Australia<br \/>\n* Transaction fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Santander Instant Payments &#8211; Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process.<br \/>\n* Special Feature: Beneficial terms and conditions in combination with other Santander payment methods.<br \/>\n* Availability: Germany, Austria, Switzerland<br \/>\n* Transactions fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Sofort (Klarna) &#8211; The modern version of prepayment. The customer transfers the purchase amount via online banking, you immediately receive a transactions confirmation and can start the shipping process.<br \/>\n* Availability: Germany, Austria, Netherlands, Belgium, Spain, Italy, Switzerland, Poland, Great Britain<br \/>\n* Special Feature: Partner Conditions of 0,8% + 0,25€ fix<\/p>\n<p>Stripe Credit Card &#8211; Via Stripe or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Stripe.<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>Swedbank Pay Credit Card &#8211; Via Swedbank Pay or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Swedbank Pay.<br \/>\n* Transaction Fees: Please contact support@payever.de to receive an individual offer.<\/p>\n<p>Apple Pay &#8211; Apple Pay replaces debit cards and cash with a simpler, safer, and more private payment method, wether in store on a website or in an app.<br \/>\n* Availability: Worldwide<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>Google Pay &#8211; The simple way to pay in store, in apps or in online shops. Your customers can also collect bonuses and store their favourite cards &#8211; all at one place.<br \/>\n* Availability: Worldwide<br \/>\n* Transaction Fees: 1.4% + € 0.25 on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.<\/p>\n<p>PayPal &#8211; This payment provider is popular worldwide and offers you and your customers extra protection in case of lost parcels and attempts of fraud.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Smooth onboarding by simply connecting your existing PayPal account.<br \/>\n* Transaction fees: Between 1.49% to 2.49% (depending on the total monthly volume) + € 0.35 fixed fee.<\/p>\n<p>Prepayment &#8211; The customer transfers the money in advance and you ship the goods as soon as the money has arrived.<br \/>\n* Availability: Worldwide<br \/>\n* Special Feature: Fast onboarding and instant availability with just a few clicks.<br \/>\n* Transaction fees: None &#8211; Wire transfer is free of charge!<\/p>\n<p>Direct Debit (SEPA): &#8211; Direct Debit is still a very common payment method: During the checkout process your customers just give permission to debit the amount from their bank account.<br \/>\n* Availability: 36 countries within the Single Euro Payment Area (SEPA).<br \/>\n* Special Feature: Smooth onboarding for credit card acceptance with Stripe.<br \/>\n* Transactions fees: 0,35€ fix<\/p>\n<p>(DEUTSCH)<br \/>\npayever Checkout &#8211; Kompatibles Zahlungs-Gateway. Kostenfrei.<\/p>\n<p>Mit payever Checkout können Sie Ihren Kunden eine Vielzahl von Zahlungsmethoden anbieten &#8211; von B2C\/B2B Buy Now Pay Later, Ratenzahlung &amp; Finanzierung bis hin zu Kreditkartenzahlungen, PayPal, lokalen Zahlungsmethoden und Echtzeit-Überweisungen auf Basis von Open Banking Technologien &#8211; mit nur einem Plugin.<br \/>\nSie können auch von einer exklusiven Auswahl an Zahlungsoptionen unserer engen Partner Santander, Openbank und Ivy profitieren.<br \/>\nMehr als 5.000 Händler in 9 Ländern vertrauen uns bereits &#8211; mit einer einfachen Integration und nur wenigen Klicks können auch Sie dazugehören!<br \/>\nBesuchen Sie uns auf <a href=\"https:\/\/www.getpayever.com\/checkout\" rel=\"nofollow ugc\">www.getpayever.com\/checkout<\/a> und erfahren Sie mehr!<\/p>\n<p><strong>Höhepunkte<\/strong><br \/>\n* B2C &amp; B2B Jetzt kaufen, später bezahlen: Bezahlen in 14 oder 30 Tagen, aufgeteilt in bis zu 36 Monatsraten sowie klassische Finanzierungen mit besten Konditionen für Kunden und Händler bieten wir in Zusammenarbeit mit unseren Partnern Santander, Openbank und Allianz Trade an.<br \/>\n* Nachhaltigkeit: Gemeinsam mit unserem Exklusivpartner Ivy können Sie und Ihre Kunden mit jeder Zahlung zertifizierte Klimaschutzprojekte unterstützen &#8211; ohne zusätzliche Kosten.<br \/>\n* Alle Zahlungsoptionen: Mit payever Checkout können Sie Ihren Kunden alle gängigen Zahlungsmöglichkeiten über nur einen Partner anbieten &#8211; ohne mehrere Plugins installieren und pflegen zu müssen.<br \/>\n* Kostenlos: payever erhebt keine Einrichtungs- oder Transaktionsgebühren &#8211; Sie tragen nur die Kosten des jeweiligen Zahlungsanbieters oder der Bank. Sie können sogar von günstigeren Partnerkonditionen für bestimmte Zahlungsoptionen profitieren.<br \/>\n* Checkout-Branding: Sie können Ihren payever Checkout komplett anpassen &#8211; laden Sie Ihr Logo hoch und passen Sie Farben, Felder sowie Buttons so an, dass der Checkout perfekt zu Ihrem Online-Shop passt.<\/p>\n<p><strong>Unsere Zahlungsoptionen<\/strong><br \/>\nSantander BNPL &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen innerhalb von 30 Tagen per Überweisung an unseren Partner Santander.<br \/>\n* Zahlungsfrist: 30 Tage<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung erforderlich.<br \/>\n* Verfügbarkeit: Deutschland, Norwegen<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander Splitpay &#8211; Sie werden sofort in voller Höhe bezahlt, Ihre Kunden zahlen in günstigen Raten an unseren Partner Santander.<br \/>\n* Zahlungszeitraum: 3 &#8211; 36 Monate (Kundenzinssatz zwischen 0% &#8211; 7,9%)<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Verfügbarkeit: Deutschland<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander-Finanzierung \/ Ratenzahlung &#8211; Sie erhalten sofort den vollen Betrag ohne Ausfallrisiko, während Ihre Kunden in bis zu 72 günstigen Raten an unseren Partner Santander zurückzahlen.<br \/>\n* Zahlungszeitraum: 6 &#8211; 72 Monate (0% Finanzierung möglich)<br \/>\n* Besonderes Merkmal: Der Prozess ist vollständig digital mit Videolegitimation und elektronischer Unterschrift.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Niederlande, Belgien, Schweden, Dänemark, Norwegen, Finnland, UK<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Zinia Buy Now Pay Later &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen nach Erhalt ihrer Bestellung per Überweisung an unseren Partner Zinia.<br \/>\n* Verfügbarkeit: Deutschland, Niederlande<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>B2B Buy Now Pay Later by Allianz Trade &#8211; Ermöglicht es Händlern, allen ihren Geschäftskunden flexible Zahlungsbedingungen anzubieten.<br \/>\n* Verfügbarkeit: Europa, USA<br \/>\n* Besonderes Merkmal: Entscheidung in Echtzeit. Keine Dokumentenprüfung erforderlich.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Swedbank Pay Invoice &#8211; Sie werden sofort bezahlt, Ihre Kunden zahlen nach Erhalt ihrer Bestellung per Überweisung an unseren Partner Swedbank.<br \/>\n* Verfügbarkeit: Schweden, Finnland, Norwegen<br \/>\n* Besonderes Merkmal: Kein Kreditvertrag oder Identitätsprüfung notwendig.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Ivy &#8211; Open Banking ermöglicht es Ihren Kunden, den Kaufbetrag in Echtzeit per Online-Banking-Zugang während des Bestellvorgangs zu überweisen. Sie erhalten sofort die Transaktionsbestätigung und können den Lieferprozess starten. Als grüne Zahlungsmethode verbindet Ivy die Themen Bezahlen und Nachhaltigkeit und reduziert strukturell die Transaktionsgebühren durch Open Banking. Ivy nutzt diese Kosteneinsparungen, um Händlern die niedrigsten Transaktionsgebühren am Markt zu bieten und mit jeder Transaktion Klimaschutzprojekte zu unterstützen.<br \/>\n* Verfügbarkeit: Deutschland, Finnland, Frankreich, Italien, Estland, Litauen, Niederlande, Portugal, Österreich, Spanien, Großbritannien, Belgien, Ungarn, Irland, Lettland, Polen, Australien<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Santander Instant Payments &#8211; Open Banking ermöglicht Ihren Kunden, den Kaufbetrag in Echtzeit über den Online-Banking-Zugang während des Bestellvorgangs zu überweisen. Sie erhalten sofort die Transaktionsbestätigung und können den Lieferprozess starten.<br \/>\n* Besonderes Merkmal: Vorteilhafte Konditionen in Kombination mit anderen Santander-Zahlungsarten.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Schweiz<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Sofort (Klarna) &#8211; Die moderne Variante der Vorkasse. Der Kunde überweist den Kaufbetrag per Online-Banking, Sie erhalten sofort eine Transaktionsbestätigung und können den Versandvorgang starten.<br \/>\n* Verfügbarkeit: Deutschland, Österreich, Niederlande, Belgien, Spanien, Italien, Schweiz, Polen, Grossbritannien<br \/>\n* Besonderes Merkmal: Partnerkonditionen von 0,8% + 0,25€ fix<\/p>\n<p>Stripe Credit Card &#8211; Über Stripe oder können Sie alle gängigen Kreditkarten akzeptieren: Visa, Master, American Express, JCB und Diners.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Stripe.<br \/>\n* Transaktionsgebühren: 1,4% + € 0,25 für in Europa ausgegebene Karten, 2,9% + € 0,25 für außerhalb Europas ausgegebene Karten.<\/p>\n<p>Swedbank Pay Credit Card &#8211; Über Swedbank Pay oder können Sie alle gängigen Kreditkarten akzeptieren: Visa, Master, American Express, JCB und Diners.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Swedbank Pay.<br \/>\n* Transaktionsgebühren: Bitte kontaktieren Sie support@payever.de, um ein individuelles Angebot zu erhalten.<\/p>\n<p>Apple Pay &#8211; Apple Pay ersetzt Debitkarten und Bargeld durch eine einfachere, sicherere und privatere Zahlungsmethode, egal ob im Geschäft, auf einer Website oder in einer App.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Transaktionsgebühren: 1,4 % + 0,25 € für in Europa ausgestellte Karten, 2,9 % + 0,25 € für außerhalb Europas ausgestellte Karten.<\/p>\n<p>Google Pay &#8211; Die einfache Art, im Geschäft, in Apps oder in Online-Shops zu bezahlen. Ihre Kunden können auch Boni sammeln und ihre Lieblingskarten speichern &#8211; alles an einem Ort.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Transaktionsgebühren: 1,4 % + 0,25 € für in Europa ausgestellte Karten, 2,9 % + 0,25 € für außerhalb Europas ausgestellte Karten.<\/p>\n<p>PayPal &#8211; Dieser Zahlungsanbieter ist weltweit beliebt und bietet Ihnen und Ihren Kunden zusätzlichen Schutz bei verlorenen Paketen und Betrugsversuchen.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding durch einfaches Verbinden Ihres bestehenden PayPal-Kontos.<br \/>\n* Transaktionsgebühren: Zwischen 1,49% und 2,49% (abhängig vom monatlichen Gesamtvolumen) + 0,35 € Fixgebühr.<\/p>\n<p>Vorkasse &#8211; Der Kunde überweist das Geld im Voraus und Sie versenden die Ware, sobald das Geld eingegangen ist.<br \/>\n* Verfügbarkeit: Weltweit<br \/>\n* Besonderes Merkmal: Schnelles Onboarding und sofortige Verfügbarkeit mit nur wenigen Klicks.<br \/>\n* Transaktionsgebühren: Keine &#8211; die Überweisung ist kostenlos!<\/p>\n<p>Lastschriftverfahren (SEPA): &#8211; Das Lastschriftverfahren ist nach wie vor eine sehr verbreitete Zahlungsmethode: Während des Bezahlvorgangs geben Ihre Kunden einfach die Erlaubnis, den Betrag von ihrem Bankkonto abzubuchen.<br \/>\n* Verfügbarkeit: 36 Länder innerhalb der Single Euro Payment Area (SEPA).<br \/>\n* Besonderes Merkmal: Reibungsloses Onboarding für die Kreditkartenakzeptanz mit Stripe.<br \/>\n* Transaktionsgebühren: 0,35€ fix<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.zip",
    "upgrade_notice": {
        "1.2.2": "<ul>\n<li>Start version of plugin.<\/li>\n<\/ul>",
        "1.3.0": "<ul>\n<li>Added Santander Installment Sweden.<\/li>\n<\/ul>",
        "1.3.1": "<ul>\n<li>Solved bug with currency.<\/li>\n<\/ul>",
        "1.3.2": "<ul>\n<li>Solved bug with sychronization. Testing for PHP7.<\/li>\n<\/ul>",
        "1.3.3": "<ul>\n<li>Tested up to wordpress 4.7 and solved bug with icons.<\/li>\n<\/ul>",
        "1.3.4": "<ul>\n<li>Changed a logic of fee.<\/li>\n<\/ul>",
        "1.3.5": "<ul>\n<li>Solved bug with Santander Installment Sweden.<\/li>\n<\/ul>",
        "1.3.6": "<ul>\n<li>Changed a logic of transaction.<\/li>\n<\/ul>",
        "1.3.7": "<ul>\n<li>Fixed conflict with PayEx plugin.<\/li>\n<\/ul>",
        "1.3.8": "<ul>\n<li>Corrected plugin url.<\/li>\n<\/ul>",
        "1.3.9": "<ul>\n<li>Changed plugin url.<\/li>\n<\/ul>",
        "1.3.10": "<ul>\n<li>Added new translations.<\/li>\n<\/ul>",
        "1.3.11": "<ul>\n<li>Added button Synchronization in settings.<\/li>\n<\/ul>",
        "1.3.12": "<ul>\n<li>Fixed Min and Max constraints for payment amount.<\/li>\n<\/ul>",
        "1.4.0": "<ul>\n<li>Added method PayEx Faktura.<\/li>\n<\/ul>",
        "1.4.2": "<ul>\n<li>Added PayEx Credit Card payment method.<\/li>\n<\/ul>",
        "1.4.4": "<ul>\n<li>Implemented with payever new checkout.<\/li>\n<\/ul>",
        "1.4.5": "<ul>\n<li>Integrated shipping functionality. Added setting &quot;Default language in checkout&quot;.<\/li>\n<\/ul>",
        "1.4.6": "<ul>\n<li>Fixed bug with total amounts.<\/li>\n<\/ul>",
        "1.4.7": "<ul>\n<li>Implemented new logic of mix\/max limits.<\/li>\n<\/ul>",
        "1.4.8": "<ul>\n<li>Edited thankyou page.<\/li>\n<\/ul>",
        "1.4.9": "<ul>\n<li>Compatibility with WooCommerce 3.2.0.<\/li>\n<\/ul>",
        "1.4.10": "<ul>\n<li>Fixed compatibility with other plugins.<\/li>\n<\/ul>",
        "1.4.11": "<ul>\n<li>Fixed paypal cart item amounts.<\/li>\n<\/ul>",
        "1.4.12": "<ul>\n<li>Fixed cancel\/shipping functionality.<\/li>\n<\/ul>",
        "1.4.13": "<ul>\n<li>Fixed total amount.<\/li>\n<\/ul>",
        "1.4.14": "<ul>\n<li>Restricted order status changes after shipping goods.<\/li>\n<\/ul>",
        "1.4.15": "<ul>\n<li>Fixed bug with readme.txt.<\/li>\n<\/ul>",
        "1.4.16": "<ul>\n<li>Fixed text domain.<\/li>\n<\/ul>",
        "1.4.17": "<ul>\n<li>Compatibility with new WooCommerce version.<\/li>\n<\/ul>",
        "1.5.0": "<ul>\n<li>Added Santander Invoice DE payment option.<\/li>\n<\/ul>",
        "1.5.1": "<ul>\n<li>Added PAN ID variable to the email template.<\/li>\n<\/ul>",
        "1.5.2": "<ul>\n<li>Fixed OAuth access_token invalidation<\/li>\n<\/ul>",
        "1.5.3": "<ul>\n<li>Fixed OAuth refresh_token invalidation<\/li>\n<\/ul>",
        "1.6.0": "<ul>\n<li>Payever SDK implemented<\/li>\n<\/ul>",
        "1.6.1": "<ul>\n<li>Reduced refresh_token lifetime<\/li>\n<\/ul>",
        "1.7.0": "<ul>\n<li>Fixed SDK implementation<\/li>\n<\/ul>",
        "1.8.0": "<ul>\n<li>Implemented refund functionality.<\/li>\n<\/ul>",
        "1.8.2": "<ul>\n<li>Improved notification handling<\/li>\n<\/ul>",
        "1.9.0": "<ul>\n<li>Fixed getting pan_id functionality<\/li>\n<\/ul>",
        "1.10.1": "<ul>\n<li>Added Stripe Direct Debit payment option.<\/li>\n<\/ul>",
        "1.10.3": "<ul>\n<li>Resolved division by zero issue for 0-priced cart items.<\/li>\n<\/ul>",
        "1.10.4": "<ul>\n<li>Added &quot;allow-popups allow-modals&quot; to iframe &quot;sandbox&quot; attribute.<\/li>\n<\/ul>",
        "1.10.5": "<ul>\n<li>Minor fixes.<\/li>\n<\/ul>",
        "1.10.6": "<ul>\n<li>Minor fixes.<\/li>\n<\/ul>",
        "1.11.0": "<ul>\n<li>Refactoring.<\/li>\n<\/ul>",
        "1.11.1": "<ul>\n<li>Minor fixes.<\/li>\n<\/ul>",
        "1.11.3": "<ul>\n<li>Removed token checks.<\/li>\n<\/ul>",
        "1.12.0": "<ul>\n<li>Implemented SDK 2.0 usage.<\/li>\n<\/ul>",
        "1.12.1": "<ul>\n<li>Bugfix: Call to a member function get_payment_method() on null<\/li>\n<\/ul>",
        "1.12.2": "<ul>\n<li>Bugfix: Fix for PHP Warning<\/li>\n<\/ul>",
        "1.13.0": "<ul>\n<li>Compatibility with Wordpress 5.3<\/li>\n<\/ul>",
        "1.13.2": "<ul>\n<li>Minor fixes<\/li>\n<\/ul>",
        "1.14.0": "<ul>\n<li>Implemented payment option variants API<\/li>\n<\/ul>",
        "1.14.1": "<ul>\n<li>Fixed notice messages<\/li>\n<\/ul>",
        "1.14.3": "<ul>\n<li>Fixed warning messages in emails<\/li>\n<\/ul>",
        "1.14.4": "<ul>\n<li>Minor fixes<\/li>\n<\/ul>",
        "1.15.0": "<ul>\n<li>Implemented plugin registry and commands API, plugin embedded support info, products synchronization<\/li>\n<\/ul>",
        "1.15.1": "<ul>\n<li>Minor fixes<\/li>\n<\/ul>",
        "1.15.2": "<ul>\n<li>Fixed stock issue<\/li>\n<\/ul>",
        "1.15.3": "<ul>\n<li>Adjusted PAN ID block<\/li>\n<\/ul>",
        "1.16.0": "<ul>\n<li>Implemented payment notifications signature<\/li>\n<\/ul>",
        "1.17.0": "<ul>\n<li>Fixed outward product delete action and warnings in synchronization queue<\/li>\n<\/ul>",
        "1.17.1": "<ul>\n<li>Fixed refund issue<\/li>\n<\/ul>",
        "1.18.0": "<ul>\n<li>Made plugin compatible with DHL for WooCommerce<\/li>\n<\/ul>",
        "1.19.0": "<ul>\n<li>Implemented submit payment<\/li>\n<li>Fixed plugin compatibility with minor versions of Wordpress and WooCommerce<\/li>\n<li>Involved new verison of Payever\\ExternalIntegration\\Payments\\Action\\ActionDecider<\/li>\n<\/ul>",
        "1.20.0": "<ul>\n<li>Added uninstall hook<\/li>\n<li>Made valid product sku in cart<\/li>\n<li>Fixed issue during enqueuing javascripts<\/li>\n<li>Improved sku in cproducts and inventory synchronization<\/li>\n<\/ul>",
        "1.22.0": "<ul>\n<li>implemented callback controllers for Finance Express widget<\/li>\n<\/ul>",
        "1.23.0": "<ul>\n<li>Improved expired shop session handling in checkout callbacks<\/li>\n<\/ul>",
        "1.24.0": "<ul>\n<li>Involved protected API endpoints for payment options<\/li>\n<li>PHP 8 compatibility<\/li>\n<li>Wordpress 5.8 compatibility<\/li>\n<li>Disable product synchronization on error<\/li>\n<\/ul>",
        "1.25.0": "<ul>\n<li>added shipping address to create payment request and processed hidden options<\/li>\n<li>added transaction ID to field transaction_id<\/li>\n<li>processed requests for invalid tokens (regenerated token)<\/li>\n<li>implemented payment_items in refund<\/li>\n<\/ul>",
        "1.25.1": "<ul>\n<li>updated compatibility version tags<\/li>\n<\/ul>",
        "1.26.0": "<ul>\n<li>fixed marketplace issues<\/li>\n<\/ul>",
        "1.26.1": "<ul>\n<li>implemented openbank cancel<\/li>\n<\/ul>",
        "1.27.0": "<ul>\n<li>implemented address equality for hidden methods<\/li>\n<\/ul>",
        "1.28.0": "<ul>\n<li>applied shipping details and partial capture<\/li>\n<\/ul>",
        "1.29.0": "<ul>\n<li>fixed payment methods variants issue<\/li>\n<li>added &quot;allow-popups-to-escape-sandbox&quot; sandbox attribute to iframe<\/li>\n<\/ul>",
        "1.29.1": "<ul>\n<li>fixed problems with totals of orders that uses custom fee\/discount plugins<\/li>\n<\/ul>",
        "1.30.0": "<ul>\n<li>Add configurable option for \/api\/v2\/payment endpoint<\/li>\n<\/ul>",
        "1.30.1": "<ul>\n<li>Add session fix for woocommerce version &gt;= 7.1<\/li>\n<\/ul>",
        "1.31.0": "<ul>\n<li>Improved plugin registration functinality<\/li>\n<\/ul>",
        "1.31.1": "<ul>\n<li>Don&#039;t send locale for redirect methods<\/li>\n<\/ul>",
        "1.31.2": "<ul>\n<li>Fixed PHP Warnings<\/li>\n<\/ul>",
        "1.31.3": "<ul>\n<li>Fixed PHP Warnings<\/li>\n<\/ul>",
        "1.32.3": "<ul>\n<li>Fixed problem with refund button<\/li>\n<\/ul>",
        "1.32.4": "<ul>\n<li>Fixed: PHP Fatal error: Uncaught Exception: Wrong arguments.<\/li>\n<\/ul>",
        "2.0.0": "<ul>\n<li>Send logs via APM SDK to our Kibana from merchants plugins for diagnostics<\/li>\n<\/ul>",
        "2.1.0": "<ul>\n<li>Added express widget<\/li>\n<\/ul>",
        "2.1.1": "<ul>\n<li>Express widget fixes<\/li>\n<\/ul>",
        "2.1.2": "<ul>\n<li>Extended notification handling<\/li>\n<\/ul>",
        "2.1.4": "<ul>\n<li>Added region field for payment processing<\/li>\n<\/ul>",
        "2.2.0": "<ul>\n<li>implemented Quote callback url for express Ivy widget<\/li>\n<li>Fixed wrong shipping amount while updating the order status<\/li>\n<\/ul>",
        "2.2.4": "<ul>\n<li>Extra logs for quotecallback<\/li>\n<\/ul>",
        "2.2.5": "<ul>\n<li>Finance Express Widget fixes<\/li>\n<\/ul>",
        "2.3.0": "<ul>\n<li>Fix log diagnostic token authorization<\/li>\n<\/ul>",
        "2.4.1": "<ul>\n<li>Fix VatRate Calculation in Checkout<\/li>\n<\/ul>",
        "2.4.3": "<ul>\n<li>Added Compatibility with Weglot Translate plugin<\/li>\n<\/ul>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-1.jpg?rev=2943854",
            "caption": ""
        },
        "2": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-2.jpg?rev=2943854",
            "caption": ""
        },
        "3": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-3.jpg?rev=2943854",
            "caption": ""
        },
        "4": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-4.jpg?rev=2943854",
            "caption": ""
        },
        "5": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-5.jpg?rev=2943854",
            "caption": ""
        },
        "6": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-6.jpg?rev=2943854",
            "caption": ""
        },
        "7": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-7.jpg?rev=2943854",
            "caption": ""
        },
        "8": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-8.jpg?rev=2943854",
            "caption": ""
        },
        "9": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-9.jpg?rev=2943854",
            "caption": ""
        },
        "10": {
            "src": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/screenshot-10.jpg?rev=2943854",
            "caption": ""
        }
    },
    "tags": {
        "credit-card": "credit card",
        "e-commerce": "e-commerce",
        "payever-payment-gateway": "payever payment gateway",
        "woocommerce": "woocommerce",
        "woocommerce-free-payment-gateways": "WooCommerce free payment gateways"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.10.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.10.0.zip",
        "1.10.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.10.2.zip",
        "1.10.3": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.10.3.zip",
        "1.10.4": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.10.4.zip",
        "1.2.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.2.2.zip",
        "1.3.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.0.zip",
        "1.3.10": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.10.zip",
        "1.3.11": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.11.zip",
        "1.3.12": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.12.zip",
        "1.3.3": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.3.zip",
        "1.3.5": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.5.zip",
        "1.3.6": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.6.zip",
        "1.3.7": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.7.zip",
        "1.3.8": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.8.zip",
        "1.3.9": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.3.9.zip",
        "1.32.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.32.1.zip",
        "1.32.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.32.2.zip",
        "1.4.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.0.zip",
        "1.4.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.1.zip",
        "1.4.10": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.10.zip",
        "1.4.11": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.11.zip",
        "1.4.12": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.12.zip",
        "1.4.13": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.13.zip",
        "1.4.14": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.14.zip",
        "1.4.16": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.16.zip",
        "1.4.17": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.17.zip",
        "1.4.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.2.zip",
        "1.4.4": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.4.zip",
        "1.4.5": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.5.zip",
        "1.4.6": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.6.zip",
        "1.4.7": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.7.zip",
        "1.4.8": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.8.zip",
        "1.4.9": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.4.9.zip",
        "1.5.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.5.0.zip",
        "1.5.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.5.1.zip",
        "1.5.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.5.2.zip",
        "1.5.3": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.5.3.zip",
        "1.6.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.6.0.zip",
        "1.6.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.6.1.zip",
        "1.7.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.7.0.zip",
        "1.8.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.8.0.zip",
        "1.8.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.8.1.zip",
        "1.8.2": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.8.2.zip",
        "1.9.0": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.1.9.0.zip",
        "2.1.1": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.2.1.1.zip",
        "2.1.4": "https:\/\/downloads.wordpress.org\/plugin\/payever-woocommerce-gateway.2.1.4.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/getpayever.com\/",
    "banners": {
        "low": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/banner-772x250.png?rev=2946958",
        "high": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/banner-1544x500.png?rev=2946954"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/payever-woocommerce-gateway\/assets\/icon-128x128.png?rev=2407520"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}