{
    "name": "Designil PDPA Thailand",
    "slug": "pdpa-thailand",
    "version": "1.2.6",
    "author": "<a href=\"https:\/\/www.designilcode.com\">DesignilCode<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/aumkub\/",
    "contributors": {
        "aumkub": {
            "profile": "https:\/\/profiles.wordpress.org\/aumkub\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/f38379892541972da4555e5e0c0504e8?s=96&d=monsterid&r=g",
            "display_name": "Aum Watcharapon"
        }
    },
    "requires": false,
    "tested": "6.4.4",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/pdpa-thailand\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 4000,
    "downloaded": 18611,
    "last_updated": "2024-02-20 7:34am GMT",
    "added": "2021-01-27",
    "homepage": "https:\/\/www.designilpdpa.com",
    "sections": {
        "description": "<p><strong>Designil PDPA Thailand: All-in-one solution for PDPA Consent Popup on WordPress<\/strong><\/p>\n<p>Designil PDPA Thailand&#8217;s mission is to provide the reliable and affordable PDPA cookie consent solution for WordPress website owners in Thailand and around the world.<\/p>\n<p>Designil PDPA Thailand Free contains everything that you need to manage your cookies consent for PDPA, and Designil PDPA Thailand Pro (Designil PDPA) open up a lot of premium features and extremely flexible customizations.<\/p>\n<p>Designil PDPA Thailand is developed and maintained by Designil Code. We have more than 10 years experience in building websites with WordPress, developing WordPress plugins and WordPress themes.<\/p>\n<p>Designil PDPA Thailand คือ ปลั๊กอินสำหรับทำให้เว็บไซต์ WordPress ของคุณรองรับ PDPA ง่าย ๆ<\/p>\n<p>จุดมุ่งหมายของ Designil PDPA Thailand คือ เราอยากสร้างปลั๊กอินสำหรับทำ Cookie Consent ตามกฏหมาย PDPA ที่ใช้งานง่าย และเชื่อถือได้ สำหรับเจ้าของเว็บไซต์ทั้งในไทยและต่างประเทศที่ต้องเก็บข้อมูลลูกค้าคนไทย<\/p>\n<p>Designil PDPA Thailand เวอร์ชั่นฟรี มีทุกฟีเจอร์ที่จำเป็นต่อการจัดการ Cookie Consent ตามกฏหมาย และยังสามารถปรับแต่งหน้าตาเพิ่มความสวยงามได้ นอกจากนั้น ยังมี Designil PDPA Thailand Pro (หรือ Designil PDPA) ที่จะทำให้ระบบ Cookie Consent ของคุณมีฟีเจอร์มากกว่าเดิม<\/p>\n<p>Designil PDPA Thailand พัฒนาโดย Designil Code ผู้เชี่ยวชาญด้าน WordPress ที่มีประสบการณ์กว่า 10 ปี ในการพัฒนาปลั๊กอินและธีมสำหรับเว็บไซต์ WordPress<\/p>\n<h3>ทำเว็บไซต์ของคุณให้รองรับ PDPA ใน 3 นาที<\/h3>\n<p>Designil PDPA Thailand ถูกออกแบบมาให้ครอบคลุมตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ของประเทศไทย (Thailand&#8217;s Personal Data Protection Act &#8211; PDPA) ซึ่งเป็นฉบับล่าสุด<\/p>\n<p>เราออกแบบออกมาให้ใช้งานได้ง่าย สามารถติดตั้งปลั๊กอินเพื่อเริ่มใช้งานได้ทันที<\/p>\n<p><strong>[พิเศษ]<\/strong> เราสร้างเทมเพลต Privacy Policy ให้อัตโนมัติ สามารถนำมาใช้ หรือแก้ไขให้ตรงตามข้อมูลของเว็บไซต์คุณได้แบบง่าย ๆ (อ้างอิงจาก Thailand Data Protection Guidelines 3.0 ของคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย)<\/p>\n<h3>ฟีเจอร์ของ Designil PDPA Thailand<\/h3>\n<p>ฟีเจอร์ต่าง ๆ ของ Designil PDPA Thailand จะช่วยให้เว็บไซต์ WordPress ของคุณรองรับ PDPA แบบง่าย ๆ ฟีเจอร์เด่น ๆ ของเรามีดังนี้:<\/p>\n<ul>\n<li><strong>ถูกต้องตามหลัก PDPA<\/strong>: ปลั๊กอินนี้ไม่มีการเก็บข้อมูลส่วนตัวของลูกค้าโดยพลการ ลูกค้าต้องกดยินยอมก่อนเท่านั้น<\/li>\n<li><strong>ปรับแต่งหน้าตาได้<\/strong>: สามารถเลือกสีที่ต้องการสำหรับหน้าตา Cookie Consent Popup บนหน้าเว็บไซต์ได้<\/li>\n<li><strong>โหลดเร็ว ขนาดไฟล์เล็ก<\/strong>: เราไม่ใช้ jQuery ทำให้มั่นใจได้ว่าไฟล์ปลั๊กอินมีขนาดเล็ก โหลดเร็ว ไม่หนักเว็บไซต์ของคุณ<\/li>\n<li><strong>ระบบจัดการคุกกี้ที่ใช้งานง่าย<\/strong>: จัดกลุ่มและตั้งชื่อคุกกี้ เพื่ออธิบายสคริปต์บนเว็บไซต์ได้ตามกฏหมาย PDPA โดยรองรับการใช้งานกับ Google Analytics และ Facebook Pixel (อาจมีการเพิ่มเติมในอนาคต สามารถส่งไอเดียของคุณได้ที่ Facebook Page: Designil Code)<\/li>\n<li><strong>รองรับการทำงานกับทุกธีม WordPress<\/strong>: ไม่ว่าคุณจะใช้ธีมอะไร ก็สามารถติดตั้ง Designil PDPA Thailand แล้วใช้งานได้ทันที<\/li>\n<li>สามารถรีเซ็ทการยินยอมจากหลังบ้านได้เลย เพื่อให้ Popup ขึ้นมาถามผู้ใช้ทั้งเก่าและใหม่โดยอัตโนมัติ<\/li>\n<li>ปรับแต่งข้อความใน Popup ได้ตามต้องการ<\/li>\n<\/ul>\n<h3>เพิ่มฟีเจอร์เด็ด ๆ มากขึ้น ด้วย Designil PDPA Thailand Pro<\/h3>\n<p>ปลั๊กอิน Designil PDPA Thailand Pro จะทำให้ Cookie Consent Popup ของคุณมีฟีเจอร์ที่ดียิ่งขึ้นไปอีก ฟีเจอร์ที่ลูกค้าของเราชอบ เช่น<br \/>\n&#8211; <strong>[PRO] 100% free for unlimited pageview<\/strong>: ไม่จำกัดจำนวนคน เพื่อเข้าใช้งาน ไม่ตัดหรือหยุดการทำงานเมื่อครบถึงจำนวนคนที่กำหนด<br \/>\n&#8211; <strong>[PRO] ใส่สคริปต์ได้อย่างอิสระถึง 3 จุด<\/strong>: สคริปต์สำหรับเก็บข้อมูลส่วนบุคคล อาจมีความจำเป็นที่ต้องวางไว้ในหลากหลายตำแหน่ง คุณสามารถเลือกใส่สคริปต์บน , หลัง , หรือก่อน  ก็ได้ (หรือใส่ทุกจุดก็ยังได้)<br \/>\n&#8211; <strong>[PRO] กำหนดเวลาหมดอายุคุกกี้เองได้<\/strong>: คุณสามรถกำหนดเงื่อนไขเวลาของ Cookie ให้หมดอายุอัตโนมัติเองได้ ใน X วัน<br \/>\n&#8211; <strong>[PRO] ระบบ Cache Proof<\/strong>: ใช้คู่กับปลั๊กอินแคชได้ ไม่มีปัญหา<br \/>\n&#8211; <strong>[PRO] ระบบ Designil Dynamic Caching<\/strong>: สร้างไฟล์ CSS และ JS ใหม่ออกมาอัตโนมัติ ให้รองรับกับระบบ CDN ต่าง ๆ ที่คุณใช้<br \/>\n&#8211; <strong>[PRO] ปรับแต่งได้ 100%<\/strong>: ตกแต่งหน้าตาให้เหมาะกับแบรนด์ของคุณได้ตามต้องการ สามารถปรับความกว้าง Container และเลือกสีได้อย่างอิสระ<br \/>\n&#8211; <strong>[PRO] Light Mode &amp; Dark Mode<\/strong>: เลือกปรับ Light Mode (พื้นหลังสีขาว) และ Dark Mode (พื้นหลังสีดำ) ให้เข้ากับเว็บไซต์ของคุณได้<br \/>\n&#8211; <strong>[PRO] Cookie Scanner<\/strong>: ระบบช่วยตรวจหาว่ามีการใช้คุกกี้อะไรในเว็บบ้าง เพื่อนำมาเขียน Privacy Policy ได้อย่างถูกต้อง<br \/>\n&#8211; <strong>[PRO] เพิ่มกลุ่มคุกกี้ได้ไม่จำกัด<\/strong>: สามารถเพิ่มกลุ่มคุกกี้เพื่อเก็บข้อมูลส่วนตัวกลุ่มที่แตกต่างกันได้ เช่น คุกกี้เพื่อทำ Marketing, คุกกี้เพื่อวิเคราะห์ข้อมูล ฯลฯ เพื่อให้ผู้ใช้เว็บไซต์สามารถเลือกยินยอมคุกกี้ในแต่ละกลุ่มแยกจากกันได้<br \/>\n&#8211; <strong>[PRO] Developer &#8211; ระบบ Override Template<\/strong>: สำหรับโปรแกรมเมอร์ที่ต้องการปรับแต่งหน้าตา Popup ด้วยตนเอง สามารถเขียนไฟล์เข้ามาใช้แทนได้ทันที<br \/>\n&#8211; <strong>[PRO] Advanced Consent Log Management<\/strong>: เก็บข้อมูลทุกครั้งที่มีการยินยอม \/ ไม่ยินยอม ทำให้แอดมินเว็บ หรือทีม IT ของบริษัท สามารถเข้ามาตรวจเช็คได้ตลอด และฟีเจอร์อีกมากมาย เช่น สามารถ export มาเป็น CSV, ระบบ filter ด้วยวันและเวลา, กำหนดจำนวนวันสูงสุดที่จะเก็บ, กำหนดให้เก็บเฉพาะคนที่ยอมรับ,​ ระบบ clear log เป็นต้น<br \/>\n&#8211; <strong>[PRO] เพิ่มฟีเจอร์ Reqeust form ( ระบบร้องเรียน )<\/strong>: User มีสิทธิ์เพิกถอนความยินยอมที่เคยให้ไปแล้ว Designil PDPA มีระบบฟอร์มเพียงแค่ติดตั้ง shortcode ก็สามารถใช้งานได้ทันที และฟีเจอร์อีกมากมาย เช่น มีระบบรักษาความปลอดภัยของไฟล์ยืนยันตัวตน ของ user ที่อัพโหลดมา, สามารถกำหนด ให้ร้องเรียนได้แค่ user ที่ login ได้, มีระบบแจ้งเตือนเมื่อมีการอัพเดทสถานะ ของการร้องเรียน และเตือนถึงผู้ดูแล, มีระบบแจ้งเตือนแบบรายวัน เมื่อวันที่ครบกำหนดใกล้เข้ามา, สามารถกำหนดอีเมลที่แจ้งเตือนเองได้ และกำหนดวันที่ครบกำหนด ( ตามกฎหมายต้องทำเสร็จภายใน 30 วัน ),​ สามารถกำหนดขนาดไฟล์ที่ใช้แจ้งยืนยันตน เป็นต้น<br \/>\n&#8211; <strong>[PRO] ใหม่ล่าสุด ! ระบบธีม มีให้เลือกถึง 14 แบบ<\/strong><\/p>\n<p>สำหรับลิสต์ฟีเจอร์ทั้งหมดของ Designil PDPA Thailand Pro สามารถเยี่ยมชมได้ที่ <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">เว็บไซต์ Designil PDPA Thailand Pro<\/a><\/p>\n<h3>แจ้งปัญหาการใช้งาน &#8211; BUG REPORTS<\/h3>\n<p>หากคุณพบปัญหาในการใช้งานปลั๊กอินนี้ สามารถแจ้งปัญหาได้ทางระบบ Ticket บน หน้าเว็บไซต์ <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">Designil PDPA Thailand Pro<\/a> หรือทาง Inbox <a href=\"https:\/\/fb.com\/designilcode\" rel=\"nofollow ugc\">เพจ Facebook: Designil Code<\/a><\/p>\n<p>Do you want to report a bug for Designil PDPA Thailand? Please feel free to contact us on the ticket system on <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">our website<\/a>, or send us a message on <a href=\"https:\/\/fb.com\/designilcode\" rel=\"nofollow ugc\">our Facebook page<\/a><\/p>\n<h3>ปลั๊กอิน Designil PDPA Thailand เหมาะกับใคร<\/h3>\n<p>ทุกคนที่ต้องการทำให้เว็บไซต์ WordPress ของคุณ รองรับกฏหมาย PDPA แบบง่าย ๆ อาทิ<\/p>\n<ul>\n<li>เจ้าของเว็บไซต์ WordPress ในประเทศไทย หรือต่างประเทศที่ต้องการก็บข้อมูลส่วนตัวจากลูกค้าในประเทศไทย (ตามกฏหมาย PDPA)<\/li>\n<li>Digital Marketer ที่ต้องการเก็บข้อมูลส่วนตัวของผู้ใช้งาน<\/li>\n<li>IT Officer ที่ต้องการเก็บข้อมูลให้ถูกต้องตามกฏหมาย PDPA<\/li>\n<\/ul>\n",
        "installation": "<ol>\n<li>Add new plugin: ไปยังเมนู Plugins &gt; Add New<\/li>\n<li>Upload this plugin: ด้านบนจะพบคำว่า “Add Plugins” ถัดไปด้านขวามีปุ่ม “Upload Plugin” ให้คลิกเพื่อเข้าไป<\/li>\n<li>Install this plugin: เมื่อเข้ามายังหน้าแล้วให้เลือก “Choose File” จากนั้นอัพโหลด zip file ที่ได้จากทางเราหลังจากนั้นคลิกปุ่ม “Install Now”<\/li>\n<\/ol>\n",
        "faq": "\n<dt id='%E0%B8%AB%E0%B8%B2%E0%B8%81%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%97%E0%B8%B3%E0%B8%95%E0%B8%B2%E0%B8%A1%E0%B8%81%E0%B8%8F%E0%B8%AB%E0%B8%A1%E0%B8%B2%E0%B8%A2%20pdpa%20%E0%B8%A1%E0%B8%B5%E0%B8%84%E0%B9%88%E0%B8%B2%E0%B8%9B%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%84%E0%B8%A3%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%87%3F'>\nหากไม่ทำตามกฏหมาย PDPA มีค่าปรับอย่างไรบ้าง?\n<\/h4>\n<p>\n<p>ค่าปรับสูงสุด 5 ล้านบาท และจำคุกไม่เกิน 1 ปี<\/p>\n<\/p>\n<dt id='%E0%B8%9B%E0%B8%A5%E0%B8%B1%E0%B9%8A%E0%B8%81%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%99%E0%B8%B5%E0%B9%89%E0%B8%A1%E0%B8%B5%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%80%E0%B8%81%E0%B9%87%E0%B8%9A%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%A2%E0%B8%B4%E0%B8%99%E0%B8%A2%E0%B8%AD%E0%B8%A1%E0%B8%88%E0%B8%B2%E0%B8%81%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B9%80%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%8A%E0%B8%A1%E0%B9%84%E0%B8%A7%E0%B9%89%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%84%E0%B8%AB%E0%B8%99%20%3F'>\nปลั๊กอินนี้มีการเก็บความยินยอมจากผู้เข้าชมไว้ที่ไหน ?\n<\/h4>\n<p>\n<p>เมื่อ user กดยอมรับหรือปฏิเสธ ระบบจะทำการเก็บเข้าคุกกี้ โดยระยะเวลาขึ้นอยู่กับการตั้งค่าที่ระบบหลังบ้าน (เจ้าของเว็บไซต์สามารถปรับแต่งได้ 100%)<\/p>\n<\/p>\n<dt id='%E0%B8%9B%E0%B8%A5%E0%B8%B1%E0%B9%8A%E0%B8%81%E0%B8%AD%E0%B8%B4%E0%B8%99%20designil%20pdpa%20thailand%20%E0%B9%81%E0%B8%95%E0%B8%81%E0%B8%95%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%88%E0%B8%B2%E0%B8%81%E0%B8%9B%E0%B8%A5%E0%B8%B1%E0%B9%8A%E0%B8%81%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%82%E0%B8%AD%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%A2%E0%B8%B4%E0%B8%99%E0%B8%A2%E0%B8%AD%E0%B8%A1%E0%B8%84%E0%B8%B8%E0%B8%81%E0%B8%81%E0%B8%B5%E0%B9%89%E0%B8%97%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B9%84%E0%B8%9B%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%84%E0%B8%A3%3F'>\nปลั๊กอิน Designil PDPA Thailand แตกต่างจากปลั๊กอินขอความยินยอมคุกกี้ทั่วไปอย่างไร?\n<\/h4>\n<p>\n<p>เรามีการรันสคริปต์ในการเก็บข้อมูลส่วนตัวก็ต่อเมื่อผู้ใช้เว็บยินยอมแล้วเท่านั้น ทำให้มั่นใจได้ว่าคุณจะเก็บข้อมูลถูกต้องตามหลักตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ของประเทศไทย (Thailand&#8217;s Personal Data Protection Act &#8211; PDPA)<\/p>\n<p>นอกจากนั้น เราพัฒนาระบบพิเศษ Designil Dynamic Caching ที่จะสร้างไฟล์ CSS และ JS ใหม่ออกมาอัตโนมัติ ให้รองรับกับปลั๊ํกอินแคช และระบบ CDN ต่าง ๆ ที่เว็บไซต์ลูกค้าใช้<\/p>\n<\/p>\n<dt id='cookie%20scanner%20%E0%B8%84%E0%B8%B7%E0%B8%AD%E0%B8%AD%E0%B8%B0%E0%B9%84%E0%B8%A3'>\nCookie Scanner คืออะไร\n<\/h4>\n<p>\n<p>Cookie Scanner เป็นเครื่องมือที่ช่วยค้นหาคุกกี้ในเว็บไซต์ของคุณ ทำให้คุณทราบเบื้องต้นว่าคุกกี้มีอะไรบ้าง เพื่อนำไปเขียนนโยบายความเป็นส่วนตัวได้ง่ายขึ้น<\/p>\n<p>(ฟีเจอร์นี้จะอยู่ในปลั๊กอิน Designil PDPA Pro)<\/p>\n<\/p>\n<dt id='%E0%B8%9B%E0%B8%A5%E0%B8%B1%E0%B9%8A%E0%B8%81%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%99%E0%B8%B5%E0%B9%89%E0%B8%A1%E0%B8%B5%20privacy%20policy%20%28%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%95%E0%B8%81%E0%B8%A5%E0%B8%87%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%AA%E0%B9%88%E0%B8%A7%E0%B8%99%E0%B8%95%E0%B8%B1%E0%B8%A7%29%20%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD%E0%B9%84%E0%B8%A1%E0%B9%88'>\nปลั๊กอินนี้มี Privacy Policy (ข้อตกลงความเป็นส่วนตัว) ให้หรือไม่\n<\/h4>\n<p>\n<p>เรามีเทมเพลต Privacy Policy (ข้อตกลงความเป็นส่วนตัว) และ Cookie Policy (ข้อตกลงการใช้คุกกี้) พื้นฐานให้ ซึ่งแนะนำให้เจ้าของเว็บไซต์นำไปปรับปรุงต่อให้เหมาะสมกับเว็บไซต์ของตนเอง<\/p>\n<\/p>\n<dt id='%E0%B8%AB%E0%B8%B2%E0%B8%81%E0%B8%A1%E0%B8%B5%E0%B8%84%E0%B8%B3%E0%B8%96%E0%B8%B2%E0%B8%A1%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%AA%E0%B8%87%E0%B8%AA%E0%B8%B1%E0%B8%A2%E0%B9%80%E0%B8%9E%E0%B8%B4%E0%B9%88%E0%B8%A1%E0%B9%80%E0%B8%95%E0%B8%B4%E0%B8%A1%20%E0%B8%AA%E0%B8%AD%E0%B8%9A%E0%B8%96%E0%B8%B2%E0%B8%A1%E0%B9%84%E0%B8%94%E0%B9%89%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%84%E0%B8%AB%E0%B8%99%20%3F'>\nหากมีคำถามหรือข้อสงสัยเพิ่มเติม สอบถามได้ที่ไหน ?\n<\/h4>\n<p>\n<p>หากมีคำถามเพิ่มเติม สอบถามเราได้ทาง Inbox Facebook Page ของเรา https:\/\/fb.com\/designilcode เลยครับ<\/p>\n<\/p>\n\n",
        "changelog": "<h4>1.2.6<\/h4>\n<ul>\n<li>รองรับการทำงาน WordPress 6.4.3<\/li>\n<li>ปรับปรุงโลโก้หลังบ้าน<\/li>\n<li>ตรวจสอบ code tracking Gogole Analytic, Facebook Pixel<\/li>\n<\/ul>\n<h4>1.2.5<\/h4>\n<ul>\n<li>รองรับการทำงาน WordPress 6.4.1<\/li>\n<\/ul>\n<h4>1.2.4<\/h4>\n<ul>\n<li>รองรับการทำงาน WordPress 6.2.2<\/li>\n<\/ul>\n<h4>1.2.3<\/h4>\n<ul>\n<li>แก้ไขบั๊กเล็กน้อย<\/li>\n<\/ul>\n<h4>1.2.2<\/h4>\n<ul>\n<li>ปรับ UI หลังบ้าน<\/li>\n<li>แก้ไขบั๊กเล็กน้อย<\/li>\n<li>รองรับการทำงาน WordPress 6.0<\/li>\n<\/ul>\n<h4>1.2.1<\/h4>\n<ul>\n<li>ปรับ UI หลังบ้าน<\/li>\n<li>รองรับการทำงาน WordPress 5.9.3<\/li>\n<\/ul>\n<h4>1.2<\/h4>\n<ul>\n<li>แก้ปัญหาปุ่มปิด แล้วยังโหลด Code<\/li>\n<li>จัดลำดับ z-index ของ popup<\/li>\n<\/ul>\n<h4>1.1<\/h4>\n<ul>\n<li>แทรก Script Google Analytic<\/li>\n<li>แทรก Script Facebook Pixel<\/li>\n<li>ปรับ Style + Script ให้บันทึกลง Temp เพื่อแสดงใน Inline<\/li>\n<\/ul>\n<h4>1.0<\/h4>\n<ul>\n<li>ระบบจัดการ Cookie และแยกประเภท script ได้เองจากหลังบ้าน<\/li>\n<li>Inject script ในการเก็บข้อมูล เมือมีการกดยินยอมจากผู้ใช้เท่านั้น<\/li>\n<li>สามารถรีเซ็ทการยินยอมจากหลังบ้านได้เลย เพื่อให้ Popup ขึ้นมาถามทุก User โดยอัตโนมัติ<\/li>\n<li>ปรับแต่งข้อความใน Popup ได้ตามต้องการ<\/li>\n<li>ปรับแต่งรูปแบบ สี \/ ตำแหน่ง \/ การแสดงผลของ Popup ได้<\/li>\n<li>Cache Proof ใช้คู่กับปลั๊กอินแคชได้ ไม่มีปัญหา<\/li>\n<li>ระบบ Designil Dynamic Caching ปลั๊กอินจะ generate ไฟล์ CSS JS เพื่อการโหลดในครั้งถัดไป<\/li>\n<li>ระบบ Cookie scanner ตรวจหาได้ว่าในเว็บมีใช้ Cookie อะไรอยู่บ้าง<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-1.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-1.png?rev=2460769\" alt=\"รูปแบบ Popup\"><\/a><p>รูปแบบ Popup<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-2.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-2.png?rev=2460769\" alt=\"รูปแบบ Sidebar - Cookie settings\"><\/a><p>รูปแบบ Sidebar - Cookie settings<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-3.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-3.png?rev=2460769\" alt=\"Tab settings - General\"><\/a><p>Tab settings - General<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-4.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-4.png?rev=2460769\" alt=\"Tab settings - Messages\"><\/a><p>Tab settings - Messages<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-5.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-5.png?rev=2460769\" alt=\"Tab settings - Cookies\"><\/a><p>Tab settings - Cookies<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-6.png?rev=2460769\"><img src=\"https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-6.png?rev=2460769\" alt=\"Tab settings - Appearance\"><\/a><p>Tab settings - Appearance<\/p><\/li><\/ol>",
        "reviews": ""
    },
    "short_description": "Popup สำหรับขอ Consent ที่รองรับความต้องการของ PDPA มีระบบจัดการคุกกี้อย่างเป็นระบบ และสามารถขอความยินยอมจากผู้ใช้ก่อนที่จะเก็บข้อมูล",
    "description": "<p><strong>Designil PDPA Thailand: All-in-one solution for PDPA Consent Popup on WordPress<\/strong><\/p>\n<p>Designil PDPA Thailand&#8217;s mission is to provide the reliable and affordable PDPA cookie consent solution for WordPress website owners in Thailand and around the world.<\/p>\n<p>Designil PDPA Thailand Free contains everything that you need to manage your cookies consent for PDPA, and Designil PDPA Thailand Pro (Designil PDPA) open up a lot of premium features and extremely flexible customizations.<\/p>\n<p>Designil PDPA Thailand is developed and maintained by Designil Code. We have more than 10 years experience in building websites with WordPress, developing WordPress plugins and WordPress themes.<\/p>\n<p>Designil PDPA Thailand คือ ปลั๊กอินสำหรับทำให้เว็บไซต์ WordPress ของคุณรองรับ PDPA ง่าย ๆ<\/p>\n<p>จุดมุ่งหมายของ Designil PDPA Thailand คือ เราอยากสร้างปลั๊กอินสำหรับทำ Cookie Consent ตามกฏหมาย PDPA ที่ใช้งานง่าย และเชื่อถือได้ สำหรับเจ้าของเว็บไซต์ทั้งในไทยและต่างประเทศที่ต้องเก็บข้อมูลลูกค้าคนไทย<\/p>\n<p>Designil PDPA Thailand เวอร์ชั่นฟรี มีทุกฟีเจอร์ที่จำเป็นต่อการจัดการ Cookie Consent ตามกฏหมาย และยังสามารถปรับแต่งหน้าตาเพิ่มความสวยงามได้ นอกจากนั้น ยังมี Designil PDPA Thailand Pro (หรือ Designil PDPA) ที่จะทำให้ระบบ Cookie Consent ของคุณมีฟีเจอร์มากกว่าเดิม<\/p>\n<p>Designil PDPA Thailand พัฒนาโดย Designil Code ผู้เชี่ยวชาญด้าน WordPress ที่มีประสบการณ์กว่า 10 ปี ในการพัฒนาปลั๊กอินและธีมสำหรับเว็บไซต์ WordPress<\/p>\n<h3>ทำเว็บไซต์ของคุณให้รองรับ PDPA ใน 3 นาที<\/h3>\n<p>Designil PDPA Thailand ถูกออกแบบมาให้ครอบคลุมตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ของประเทศไทย (Thailand&#8217;s Personal Data Protection Act &#8211; PDPA) ซึ่งเป็นฉบับล่าสุด<\/p>\n<p>เราออกแบบออกมาให้ใช้งานได้ง่าย สามารถติดตั้งปลั๊กอินเพื่อเริ่มใช้งานได้ทันที<\/p>\n<p><strong>[พิเศษ]<\/strong> เราสร้างเทมเพลต Privacy Policy ให้อัตโนมัติ สามารถนำมาใช้ หรือแก้ไขให้ตรงตามข้อมูลของเว็บไซต์คุณได้แบบง่าย ๆ (อ้างอิงจาก Thailand Data Protection Guidelines 3.0 ของคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย)<\/p>\n<h3>ฟีเจอร์ของ Designil PDPA Thailand<\/h3>\n<p>ฟีเจอร์ต่าง ๆ ของ Designil PDPA Thailand จะช่วยให้เว็บไซต์ WordPress ของคุณรองรับ PDPA แบบง่าย ๆ ฟีเจอร์เด่น ๆ ของเรามีดังนี้:<\/p>\n<ul>\n<li><strong>ถูกต้องตามหลัก PDPA<\/strong>: ปลั๊กอินนี้ไม่มีการเก็บข้อมูลส่วนตัวของลูกค้าโดยพลการ ลูกค้าต้องกดยินยอมก่อนเท่านั้น<\/li>\n<li><strong>ปรับแต่งหน้าตาได้<\/strong>: สามารถเลือกสีที่ต้องการสำหรับหน้าตา Cookie Consent Popup บนหน้าเว็บไซต์ได้<\/li>\n<li><strong>โหลดเร็ว ขนาดไฟล์เล็ก<\/strong>: เราไม่ใช้ jQuery ทำให้มั่นใจได้ว่าไฟล์ปลั๊กอินมีขนาดเล็ก โหลดเร็ว ไม่หนักเว็บไซต์ของคุณ<\/li>\n<li><strong>ระบบจัดการคุกกี้ที่ใช้งานง่าย<\/strong>: จัดกลุ่มและตั้งชื่อคุกกี้ เพื่ออธิบายสคริปต์บนเว็บไซต์ได้ตามกฏหมาย PDPA โดยรองรับการใช้งานกับ Google Analytics และ Facebook Pixel (อาจมีการเพิ่มเติมในอนาคต สามารถส่งไอเดียของคุณได้ที่ Facebook Page: Designil Code)<\/li>\n<li><strong>รองรับการทำงานกับทุกธีม WordPress<\/strong>: ไม่ว่าคุณจะใช้ธีมอะไร ก็สามารถติดตั้ง Designil PDPA Thailand แล้วใช้งานได้ทันที<\/li>\n<li>สามารถรีเซ็ทการยินยอมจากหลังบ้านได้เลย เพื่อให้ Popup ขึ้นมาถามผู้ใช้ทั้งเก่าและใหม่โดยอัตโนมัติ<\/li>\n<li>ปรับแต่งข้อความใน Popup ได้ตามต้องการ<\/li>\n<\/ul>\n<h3>เพิ่มฟีเจอร์เด็ด ๆ มากขึ้น ด้วย Designil PDPA Thailand Pro<\/h3>\n<p>ปลั๊กอิน Designil PDPA Thailand Pro จะทำให้ Cookie Consent Popup ของคุณมีฟีเจอร์ที่ดียิ่งขึ้นไปอีก ฟีเจอร์ที่ลูกค้าของเราชอบ เช่น<br \/>\n&#8211; <strong>[PRO] 100% free for unlimited pageview<\/strong>: ไม่จำกัดจำนวนคน เพื่อเข้าใช้งาน ไม่ตัดหรือหยุดการทำงานเมื่อครบถึงจำนวนคนที่กำหนด<br \/>\n&#8211; <strong>[PRO] ใส่สคริปต์ได้อย่างอิสระถึง 3 จุด<\/strong>: สคริปต์สำหรับเก็บข้อมูลส่วนบุคคล อาจมีความจำเป็นที่ต้องวางไว้ในหลากหลายตำแหน่ง คุณสามารถเลือกใส่สคริปต์บน , หลัง , หรือก่อน  ก็ได้ (หรือใส่ทุกจุดก็ยังได้)<br \/>\n&#8211; <strong>[PRO] กำหนดเวลาหมดอายุคุกกี้เองได้<\/strong>: คุณสามรถกำหนดเงื่อนไขเวลาของ Cookie ให้หมดอายุอัตโนมัติเองได้ ใน X วัน<br \/>\n&#8211; <strong>[PRO] ระบบ Cache Proof<\/strong>: ใช้คู่กับปลั๊กอินแคชได้ ไม่มีปัญหา<br \/>\n&#8211; <strong>[PRO] ระบบ Designil Dynamic Caching<\/strong>: สร้างไฟล์ CSS และ JS ใหม่ออกมาอัตโนมัติ ให้รองรับกับระบบ CDN ต่าง ๆ ที่คุณใช้<br \/>\n&#8211; <strong>[PRO] ปรับแต่งได้ 100%<\/strong>: ตกแต่งหน้าตาให้เหมาะกับแบรนด์ของคุณได้ตามต้องการ สามารถปรับความกว้าง Container และเลือกสีได้อย่างอิสระ<br \/>\n&#8211; <strong>[PRO] Light Mode &amp; Dark Mode<\/strong>: เลือกปรับ Light Mode (พื้นหลังสีขาว) และ Dark Mode (พื้นหลังสีดำ) ให้เข้ากับเว็บไซต์ของคุณได้<br \/>\n&#8211; <strong>[PRO] Cookie Scanner<\/strong>: ระบบช่วยตรวจหาว่ามีการใช้คุกกี้อะไรในเว็บบ้าง เพื่อนำมาเขียน Privacy Policy ได้อย่างถูกต้อง<br \/>\n&#8211; <strong>[PRO] เพิ่มกลุ่มคุกกี้ได้ไม่จำกัด<\/strong>: สามารถเพิ่มกลุ่มคุกกี้เพื่อเก็บข้อมูลส่วนตัวกลุ่มที่แตกต่างกันได้ เช่น คุกกี้เพื่อทำ Marketing, คุกกี้เพื่อวิเคราะห์ข้อมูล ฯลฯ เพื่อให้ผู้ใช้เว็บไซต์สามารถเลือกยินยอมคุกกี้ในแต่ละกลุ่มแยกจากกันได้<br \/>\n&#8211; <strong>[PRO] Developer &#8211; ระบบ Override Template<\/strong>: สำหรับโปรแกรมเมอร์ที่ต้องการปรับแต่งหน้าตา Popup ด้วยตนเอง สามารถเขียนไฟล์เข้ามาใช้แทนได้ทันที<br \/>\n&#8211; <strong>[PRO] Advanced Consent Log Management<\/strong>: เก็บข้อมูลทุกครั้งที่มีการยินยอม \/ ไม่ยินยอม ทำให้แอดมินเว็บ หรือทีม IT ของบริษัท สามารถเข้ามาตรวจเช็คได้ตลอด และฟีเจอร์อีกมากมาย เช่น สามารถ export มาเป็น CSV, ระบบ filter ด้วยวันและเวลา, กำหนดจำนวนวันสูงสุดที่จะเก็บ, กำหนดให้เก็บเฉพาะคนที่ยอมรับ,​ ระบบ clear log เป็นต้น<br \/>\n&#8211; <strong>[PRO] เพิ่มฟีเจอร์ Reqeust form ( ระบบร้องเรียน )<\/strong>: User มีสิทธิ์เพิกถอนความยินยอมที่เคยให้ไปแล้ว Designil PDPA มีระบบฟอร์มเพียงแค่ติดตั้ง shortcode ก็สามารถใช้งานได้ทันที และฟีเจอร์อีกมากมาย เช่น มีระบบรักษาความปลอดภัยของไฟล์ยืนยันตัวตน ของ user ที่อัพโหลดมา, สามารถกำหนด ให้ร้องเรียนได้แค่ user ที่ login ได้, มีระบบแจ้งเตือนเมื่อมีการอัพเดทสถานะ ของการร้องเรียน และเตือนถึงผู้ดูแล, มีระบบแจ้งเตือนแบบรายวัน เมื่อวันที่ครบกำหนดใกล้เข้ามา, สามารถกำหนดอีเมลที่แจ้งเตือนเองได้ และกำหนดวันที่ครบกำหนด ( ตามกฎหมายต้องทำเสร็จภายใน 30 วัน ),​ สามารถกำหนดขนาดไฟล์ที่ใช้แจ้งยืนยันตน เป็นต้น<br \/>\n&#8211; <strong>[PRO] ใหม่ล่าสุด ! ระบบธีม มีให้เลือกถึง 14 แบบ<\/strong><\/p>\n<p>สำหรับลิสต์ฟีเจอร์ทั้งหมดของ Designil PDPA Thailand Pro สามารถเยี่ยมชมได้ที่ <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">เว็บไซต์ Designil PDPA Thailand Pro<\/a><\/p>\n<h3>แจ้งปัญหาการใช้งาน &#8211; BUG REPORTS<\/h3>\n<p>หากคุณพบปัญหาในการใช้งานปลั๊กอินนี้ สามารถแจ้งปัญหาได้ทางระบบ Ticket บน หน้าเว็บไซต์ <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">Designil PDPA Thailand Pro<\/a> หรือทาง Inbox <a href=\"https:\/\/fb.com\/designilcode\" rel=\"nofollow ugc\">เพจ Facebook: Designil Code<\/a><\/p>\n<p>Do you want to report a bug for Designil PDPA Thailand? Please feel free to contact us on the ticket system on <a href=\"https:\/\/www.designilpdpa.com\" rel=\"nofollow ugc\">our website<\/a>, or send us a message on <a href=\"https:\/\/fb.com\/designilcode\" rel=\"nofollow ugc\">our Facebook page<\/a><\/p>\n<h3>ปลั๊กอิน Designil PDPA Thailand เหมาะกับใคร<\/h3>\n<p>ทุกคนที่ต้องการทำให้เว็บไซต์ WordPress ของคุณ รองรับกฏหมาย PDPA แบบง่าย ๆ อาทิ<\/p>\n<ul>\n<li>เจ้าของเว็บไซต์ WordPress ในประเทศไทย หรือต่างประเทศที่ต้องการก็บข้อมูลส่วนตัวจากลูกค้าในประเทศไทย (ตามกฏหมาย PDPA)<\/li>\n<li>Digital Marketer ที่ต้องการเก็บข้อมูลส่วนตัวของผู้ใช้งาน<\/li>\n<li>IT Officer ที่ต้องการเก็บข้อมูลให้ถูกต้องตามกฏหมาย PDPA<\/li>\n<\/ul>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.6.zip",
    "upgrade_notice": {
        "": "<p>*<\/p>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-1.png?rev=2460769",
            "caption": "รูปแบบ Popup"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-2.png?rev=2460769",
            "caption": "รูปแบบ Sidebar - Cookie settings"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-3.png?rev=2460769",
            "caption": "Tab settings - General"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-4.png?rev=2460769",
            "caption": "Tab settings - Messages"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-5.png?rev=2460769",
            "caption": "Tab settings - Cookies"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/screenshot-6.png?rev=2460769",
            "caption": "Tab settings - Appearance"
        }
    },
    "tags": {
        "cookie": "cookie",
        "gdpr": "GDPR",
        "pdpa": "pdpa",
        "thai": "thai",
        "thailand": "thailand"
    },
    "stable_tag": "1.2.6",
    "versions": {
        "1.0": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.0.zip",
        "1.1": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.1.zip",
        "1.2": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.zip",
        "1.2.1": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.1.zip",
        "1.2.2": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.2.zip",
        "1.2.3": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.3.zip",
        "1.2.4": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.4.zip",
        "1.2.5": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.5.zip",
        "1.2.6": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.1.2.6.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/pdpa-thailand.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/www.paypal.me\/watcharapon\/0usd",
    "banners": {
        "low": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/banner-772x250.png?rev=2727461",
        "high": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/banner-1544x500.png?rev=2727461"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/icon-128x128.png?rev=2460769",
        "2x": "https:\/\/ps.w.org\/pdpa-thailand\/assets\/icon-256x256.png?rev=2460769"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}