{
    "name": "Web Push Notifications by PushEngage: WordPress Push Notifications to Supercharge Your Engagement",
    "slug": "pushengage",
    "version": "4.0.8.1",
    "author": "<a href=\"https:\/\/www.pushengage.com\/?utm_source=WordPress&utm_campaign=Plugin&utm_medium=pluginHeader&utm_content=author-uri-link\">PushEngage<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/smub\/",
    "contributors": {
        "pushengage": {
            "profile": "https:\/\/profiles.wordpress.org\/pushengage\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/3e8806707f175597680b9c66d1a27c44?s=96&d=monsterid&r=g",
            "display_name": "PushEngage"
        },
        "smub": {
            "profile": "https:\/\/profiles.wordpress.org\/smub\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/2ec3ed918bbdc22954328effa1b8140b?s=96&d=monsterid&r=g",
            "display_name": "Syed Balkhi"
        }
    },
    "requires": "4.5.0",
    "tested": "6.4.4",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 17,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 6
    },
    "num_ratings": 24,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/pushengage\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 235941,
    "last_updated": "2024-02-07 2:04pm GMT",
    "added": "2016-01-09",
    "homepage": "https:\/\/www.pushengage.com\/?utm_source=WordPress&utm_campaign=Plugin&utm_medium=pluginHeader&utm_content=plugin-uri-link",
    "sections": {
        "installation": "<ol>\n<li>Install PushEngage web push notifications either via the WordPress.org plugin repository or by uploading the files to your server.<\/li>\n<li>Activate the PushEngage plugin from the plugin section.<\/li>\n<li>Navigate to the PushEngage tab in your WordPress admin and connect your PushEngage account to your WordPress site to start displaying subscription popups to build a subscriber base.<\/li>\n<li>Click on the Campaigns tab to configure campaigns or send out automatic posts with every post being published.<\/li>\n<li>Want more push notification features? <a href=\"https:\/\/www.pushengage.com\/pricing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Upgrade to PushEngage Business, Premium, or Growth plan<\/a>.<\/li>\n<\/ol>\n",
        "changelog": "<p><strong>Most Recent Changes:<\/strong><\/p>\n<h4>4.0.8.1<\/h4>\n<ul>\n<li>Resolved JSON encoding error in multi-byte string processing for enhanced reliability.<\/li>\n<li>Improved error handling for service-worker registration to ensure seamless functionality.<\/li>\n<li>Added detailed error messages for troubleshooting in the case of notification sending failure.<\/li>\n<\/ul>\n<h4>4.0.8<\/h4>\n<ul>\n<li>Added the option to install the WPCode plugin via PushEngage plugin dashboard.<\/li>\n<li>Implemented configurable options to trigger browse and cart abandonment campaigns for WooCommerce and EDD through WPCode plugin.<\/li>\n<li>Added a setting to show\/hide pushengage overview widget in on WP Dashboard.<\/li>\n<li>Updated PushEngage Admin menu label from &#8220;Campaigns&#8221; to &#8220;Push Broadcasts&#8221;.<\/li>\n<\/ul>\n<h4>4.0.7.1<\/h4>\n<ul>\n<li>Removed the PushEngage subscription popup modal from WordPress admin pages.<\/li>\n<\/ul>\n<h4>4.0.7<\/h4>\n<ul>\n<li>Added subscription management widget.<\/li>\n<li>Improved popup modals and widgets preview.<\/li>\n<li>Improved plugin review notice flow.<\/li>\n<li>Updated PushEngage sdk init script.<\/li>\n<\/ul>\n<h4>4.0.6<\/h4>\n<ul>\n<li>Added Push Broadcast templates.<\/li>\n<li>Added handling for empty UTM parameters on post editor screen.<\/li>\n<li>Added checks to prevent double notification sending in the Gutenberg post editor screen.<\/li>\n<li>Improved default service worker implementation and flow to to fix the issue.<\/li>\n<li>Fixed special character encoding issue in the notification title and message on post editor screen.<\/li>\n<li>Fixed empty notification message issue on post editor screen.<\/li>\n<\/ul>\n<h4>4.0.5.1<\/h4>\n<ul>\n<li>Fixed performance issue in Post Editor.<\/li>\n<li>Fixed notification preview style conflict.<\/li>\n<\/ul>\n<h4>4.0.5<\/h4>\n<ul>\n<li>Added support for selecting post types for auto push campaigns.<\/li>\n<li>Added support for custom UTM parameters on the Post Editor screen.<\/li>\n<li>Added Windows 11 notification preview.<\/li>\n<li>Added support to test sending notifications on the Post Editor screen.<\/li>\n<li>Added iOS web notification preview.<\/li>\n<li>Added notification preview on the Post editor screen.<\/li>\n<li>Added PushEngage menu in the WordPress admin bar.<\/li>\n<li>Added PushEngage overview widget to display stats and recent notifications on the WordPress Dashboard.<\/li>\n<li>Added notice and alert message to collect plugin reviews.<\/li>\n<li>Added a quick link menu widget inside the PushEngage plugin page.<\/li>\n<li>Added an email verification warning message in the onboarding flow.<\/li>\n<li>Added Plan label tag for pro features.<\/li>\n<li>Added admin notice and alert message to display service worker access permission issues.<\/li>\n<li>Improved Windows 10 notification preview.<\/li>\n<li>Improved macOS Chrome notification preview.<\/li>\n<li>Improved iOS web notification preview.<\/li>\n<li>Improved PushEngage metabox interface on the Post Editor screen.<\/li>\n<li>Fixed missing error code in the onboarding error message.<\/li>\n<li>Changed the default notification title from blog title to post title for auto push campaigns.<\/li>\n<li>Changed the action button URL to be optional on the Post Editor screen.<\/li>\n<li>Removed Windows 8 notification preview.<\/li>\n<\/ul>\n<p><strong><a href=\"https:\/\/plugins.svn.wordpress.org\/pushengage\/trunk\/CHANGELOG.md\" rel=\"nofollow ugc\">View entire PushEngage changelog<\/a><\/strong><\/p>\n",
        "description": "<p>🤩 Send personalized web push notifications on autopilot. 10x your repeat traffic and WordPress site engagement with push notification campaigns. 🚀<\/p>\n<h3><\/h3>\n<p><a href=\"https:\/\/www.pushengage.com\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">PushEngage<\/a> is the #1 push notification plugin in the world. It’s a marketing plugin that helps you get more web push notification subscribers, increase sales, and grow your business.<\/p>\n<p>With PushEngage’s web push notifications, you can turn your website visitors into regular readers, loyal fans, and repeat customers. The coolest part is that it only takes your subscribers two clicks or less to get subscribed to your notifications.<\/p>\n<p>PushEngage gives you a simple, easy-to-use dashboard that helps you create optins, launch web push campaigns, grow your subscriber base, track your revenue goals, and manage your audience using advanced segmentation and audience targeting rules.<\/p>\n<p>Using the PushEngage dashboard, you can even add custom call to action (CTA) buttons. The buttons have many of our customers dramatically increase their click-through rates (CTR).<\/p>\n<p>You also get advanced analytics to track your performance metrics with or without using third-party tools such as Google Analytics.<\/p>\n<p>We also offer mobile popup modals so that your marketing messages will always look great on all devices (mobile, tablet, laptop, and desktop). We’re constantly working to improve the opt-in prompts as well. In fact, we’re the only push notification service that can integrate seamlessly with a web popup builder to offer a better user experience.<\/p>\n<p>Along with the absolute best web push notification software in the market, you also get a top-tier Customer Success team to help you get more success from your push notifications more often.<\/p>\n<p><strong>PushEngage App<\/strong><br \/>\nPushEngage is a SaaS service to send browser notifications including:<\/p>\n<ul>\n<li>Chrome push notifications<\/li>\n<li>Firefox push notifications<\/li>\n<li>Edge push notifications<\/li>\n<li>Safari push notifications<\/li>\n<li>iOS and iPadOS web notifications<\/li>\n<li>Opera push notifications<\/li>\n<li>Android web push notifications<\/li>\n<li>AMP web push notifications<\/li>\n<li>PWA web push notifications<\/li>\n<li>Mozilla web push notifications<\/li>\n<\/ul>\n<p>And more.<\/p>\n<p>You will need to create a PushEngage account to use our popup builder and to gain push notification subscribers using PushEngage. We recommend <a href=\"https:\/\/www.pushengage.com\/pricing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"nofollow ugc\">getting started with PushEngage Premium!<\/a><\/p>\n<p>It’s super easy to create highly targeted and personalized push messages with our easy campaign creator.<\/p>\n<p>If you’re looking for advanced automation, you can use the push API to serve use cases that your competitors aren’t even thinking of!<\/p>\n<p>The best part is the PushEngage plugin connects directly with the web app and installs the service worker on your site automatically unlike any other push notification service. Just in case you’re not a developer, the service worker is a JSON file that allows you to collect push notification subscribers. With other push notification software, you need to manually download and place the file into your server. But our plugin automatically does it for you.<\/p>\n<p>Here’s why 10,000+ smart business owners, designers, and developers use PushEngage to send <strong>15+ billion web push campaigns every month<\/strong>, and you will too!<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/eBhtAZgoNbE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>Send Push Notifications to Increase Repeat Traffic &amp; Conversions<\/h3>\n<p>Whether you&#8217;re running a blog, a news site, a travel site, a SaaS site, or an eCommerce site, push notifications can help you grow your business.<\/p>\n<p>The best part about PushEngage&#8217;s web push campaigns is that you can modify it to suit any type of business.<\/p>\n<p>If you&#8217;re running an eCommerce site, you can send transactional push notifications to increase your revenue. And if you&#8217;re running a blog site or a media outlet, then you can create powerful automated campaigns to get repeat readers, more ad revenue, higher views on your social media content, and so much more.<\/p>\n<p>You can even increase paid subscriptions to your premium content, merchandise sales, conversions on your affiliate offers, and more.<\/p>\n<p>Here&#8217;s a quick look at some of the most advanced features you should know about:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-install-web-push-notifications-plugin-on-wordpress-website\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Push Broadcast<\/a> &#8211; Schedule or send web push notification broadcasts to a custom audience in a matter of minutes. Use revenue tracking to keep sight of your goals and A\/B testing to improve your campaign performance.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/website-welcome-message\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Welcome Push Notifications<\/a> &#8211; Send automated welcome messages to your push notification subscribers. Get higher retention rates and send discounts and offers to increase your sales.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-do-segmentation-in-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Automatic Segmentation<\/a> &#8211; Quickly segment your web push notification subscribers as soon as they subscribe based on their interests.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/announcement-audience-grouping\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Audience Group<\/a> &#8211; Create retargeting push notifications and advanced targeting groups within your audience. Filter your audience by behavior, engagement, and interests.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-schedule-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Timezone Push Notifications<\/a> &#8211; Schedule your push notifications to automatically get sent when it has the most impact. Send push notifications in your timezone or in your subscribers’ timezones with a single click.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/personalize-your-campaigns-using-attributes\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Custom Drip Campaigns<\/a> &#8211; Send personalized drip push notifications to improve your repeat traffic, engagement, and sales. Retarget your customers and turn them into loyal superfans.<\/li>\n<\/ul>\n<p>And if you’re super busy with marketing activities and you just want to use push notifications to promote your new content, you can send RSS push notifications as well. Unlike other push notification services, you don’t even need to use a notifications API. You can do it straight from the plugin.<\/p>\n<p>Even better, the PushEngage plugin can automatically turn your WordPress blog categories into segments that you can use to send retargeting push messages.<\/p>\n<p>The coolest part is that we help you succeed with your campaigns. You can always talk to our top-tier Customer Success team to set up, track, and optimize your campaigns. And we also give you push notification templates that are proven to work so that you don&#8217;t have to build anything from scratch. It’s super user-friendly.<\/p>\n<p>What’s more is that you can use our Javascript API to create custom campaigns and send notifications synced to a CRM software.<\/p>\n<h3>The PushEngage Dashboard Makes it Easy<\/h3>\n<p>We were tired of the push notification software that in the market that are too difficult to use and are built for developers instead of business owners. That’s why we built PushEngage to help you create powerful marketing workflows and custom web push notification campaigns even without a developer.<\/p>\n<p>With PushEngage, you can create powerful marketing campaigns from a simple dashboard in a matter of minutes even if:<\/p>\n<ul>\n<li>You’re not a developer and don’t know how to use code to send push notifications<\/li>\n<li>You’ve never used push notifications before and you have no idea where to start<\/li>\n<li>You tried another push notification software and hated the experience<\/li>\n<\/ul>\n<p>But don’t just take our word for it. Here’s what Amanda had to say:<\/p>\n<blockquote>\n<p>It’s uber-easy to use, the support team is helpful, and the results are impressive. Especially when you take into account how little work they are to build and send. Highly recommend PushEngage to anyone wanting a way to reach customers that’s fast, reliable, and effective.<br \/>\n  &#8211; Amanda Hyciek, Digital Marketing Strategist, Wicked Weasel (<a href=\"https:\/\/www.pushengage.com\/case-study-wicked-weasel-2k-to-4k-sales-per-week-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">See Case Study<\/a>)<\/p>\n<\/blockquote>\n<h3>Time-Tested Push Notification Campaign Templates<\/h3>\n<p>Don’t know what push notification campaigns you need and how to get started?<\/p>\n<p>No worries. We built campaign templates into our dashboard that you can use to get started.<\/p>\n<p>The technical stuff is all taken care of. All you have to do is:<\/p>\n<ul>\n<li>Select a campaign type<\/li>\n<li>Create your push notifications<\/li>\n<li>Select an audience to send to<\/li>\n<li>Send\/Schedule your campaign<\/li>\n<\/ul>\n<p>Even with <a href=\"https:\/\/www.pushengage.com\/automated-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">advanced trigger campaigns<\/a>, you can start with a template that comes with pre-built triggers so that you don’t have to configure them yourself. All you have to do is focus on growing your business.<\/p>\n<h3>Smart Page Targeting and Behavior Based Personalization<\/h3>\n<p>All PushEngage popup modals come with advanced page targeting and behavior based personalization.<\/p>\n<p>This means you can <a  rel=\"friend nofollow ugc\">show a custom popup<\/a> for:<\/p>\n<ul>\n<li>A specific page or set of pages of your site<\/li>\n<li>Different website visitors based on their geolocation<\/li>\n<li>Users who click a specific link<\/li>\n<\/ul>\n<p>And more!<\/p>\n<p>You can even segment your subscribers automatically when they visit your site. PushEngage allows you to create <a href=\"https:\/\/www.pushengage.com\/how-to-do-segmentation-in-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">custom segmentation rules<\/a>. And if you want your visitors to click a button on your site to subscribe to your push notifications, you can create <a href=\"https:\/\/www.pushengage.com\/how-to-collect-web-push-subscribers-using-button-or-link-click\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">click to subscribe buttons<\/a> as well.<\/p>\n<p>If you like, you can even create a <a href=\"https:\/\/www.pushengage.com\/subscription-widget-wordpress\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">subscription widget<\/a> where your visitors can choose what kind of notifications they want to receive.<\/p>\n<p>This allows you to send targeted web push notifications that fetch you more subscribers, higher engagement rates, and more sales.<\/p>\n<blockquote>\n<p>PushEngage is our best converting paid traffic channel. The open-rate is about 400% better than sending out newsletters and also the time to create a push notification is far more effective. The overall performance of sending out push notifications with PushEngage has been a pleasant surprise last year.<br \/>\n  &#8211; Domingo Karsten, CEO &amp; Co-Founder, Saleduck<\/p>\n<\/blockquote>\n<h3>Advanced Analytics and A\/B Testing<\/h3>\n<p>Unlike other WordPress push notification plugins, PushEngage comes with reliable A\/B split testing and accurate analytics without slowing down your site. Most other plugins face significant issues with caching that can skew your web push campaign analytics and A\/B tests.<\/p>\n<p>But PushEngage offers far better infrastructure for more accurate results. You get detailed analytics on all your campaigns and optins right from your dashboard.<\/p>\n<p>What’s more is that you can create Intelligent A\/B tests to improve an ongoing campaign.<\/p>\n<p>With Intelligent A\/B testing, you can select a small audience to split test your browser push notifications and then send the winning notification to the rest of your audience.<\/p>\n<p><a href=\"https:\/\/www.pushengage.com\/brandsmart-usa-case-study\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">BrandsMart USA Got a Whopping 2.9 Million Views from Push Notifications<\/a> by using A\/B testing. If you’re new to push notification analytics and split testing, you should check out our guides on:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/push-notification-a-b-testing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">How to do Push Notification A\/B Testing (Best Practices)<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-track-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">How to Track Push Notifications with Google Analytics<\/a><\/li>\n<\/ul>\n<p><strong>NOTE:<\/strong> You can only get access to advanced analytics and A\/B testing if you&#8217;re on a paid plan. The free plan only helps you get started with push notifications.<\/p>\n<h3>Powerful Integrations<\/h3>\n<p>PushEngage just works no matter what device or browser your visitors are using including:<\/p>\n<ul>\n<li>Google Chrome<\/li>\n<li>Safari<\/li>\n<li>Firefox<\/li>\n<li>Edge<\/li>\n<li>Opera<\/li>\n<li>Samsung<\/li>\n<li>UC Browser<\/li>\n<\/ul>\n<p>It also works out of the box with all major website builders and eCommerce platforms and solutions. Check out our installation guides:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-install-web-push-notifications-plugin-on-wordpress-website\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WordPress<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-use-push-notification-on-wordpress-without-plugin\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WordPress (without a plugin)<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-go-live-with-web-push-notifications-on-a-woocommerce-site\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WooCommerce<\/a><\/li>\n<\/ul>\n<p>And it integrates seamlessly with marketing tools such as:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-track-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Google Analytics<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/install-pushengage-through-gtm\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Google Tag Manager<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-integrate-web-push-notification-on-instapage-landingpages\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Instapage<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-integrate-web-push-notification-clickfunnels\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">ClickFunnels<\/a><\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.pushengage.com\/pricing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Get started with PushEngage today!<\/a><\/p>\n<h4>Credits<\/h4>\n<p>This WordPress web push notifications plugin was created by <a href=\"https:\/\/syedbalkhi.com\/\" rel=\"friend nofollow ugc\">Syed Balkhi<\/a>.<\/p>\n<h4>Branding Guidelines<\/h4>\n<p>When writing about the browser push notification plugin by PushEngage, please make sure to uppercase the letter P and E.<\/p>\n<ul>\n<li>PushEngage (correct)<\/li>\n<li>Push Engage (incorrect)<\/li>\n<li>pushengage (incorrect)<\/li>\n<li>push engage (incorrect)<\/li>\n<\/ul>\n<p>See our <a href=\"https:\/\/www.pushengage.com\/press\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Press &amp; Brand Assets page<\/a> for more details.<\/p>\n<h4>What’s Next<\/h4>\n<p>To get the most value out of your growing browser push notification subscriber list, see our <a href=\"https:\/\/www.pushengage.com\/best-practices-web-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">push notification best practices<\/a>.<\/p>\n<p>You should also check out our article on <a href=\"https:\/\/www.pushengage.com\/push-notification-examples\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">75 Epic Push Notification Examples You Can Steal Right Now<\/a>.<\/p>\n<p>If you like this WordPress web push notifications plugin, then consider checking out our other projects:<\/p>\n<ul>\n<li><a href=\"https:\/\/optinmonster.com\/\" rel=\"friend nofollow ugc\">OptinMonster<\/a> – Get more email subscribers with the most popular conversion optimization plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/wpforms.com\/\" rel=\"friend nofollow ugc\">WPForms<\/a> – #1 drag &amp; drop online form builder for WordPress (trusted by 5 million sites).<\/li>\n<li><a href=\"https:\/\/aioseo.com\/\" rel=\"friend nofollow ugc\">AIOSEO<\/a> &#8211; The original WordPress SEO plugin to help you rank higher in search results (trusted by over 3 million sites).<\/li>\n<li><a href=\"https:\/\/www.monsterinsights.com\/\" rel=\"friend nofollow ugc\">MonsterInsights<\/a> – See the stats that matter and grow your business with confidence. Best Google Analytics plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/www.seedprod.com\/\" rel=\"friend nofollow ugc\">SeedProd<\/a> – Create beautiful landing pages with our powerful drag &amp; drop landing page builder.<\/li>\n<li><a href=\"https:\/\/wpmailsmtp.com\/\" rel=\"friend nofollow ugc\">WP Mail SMTP<\/a> – Improve email deliverability for your contact form with the most popular SMTP plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/smashballoon.com\/\" rel=\"friend nofollow ugc\">Smash Balloon<\/a> &#8211; #1 social feeds plugin for WordPress &#8211; display social media content in WordPress without code.<\/li>\n<li><a href=\"https:\/\/wpcode.com\/\" rel=\"friend nofollow ugc\">WPCode<\/a> &#8211; must have WordPress code snippet management plugin to help you future-proof website customization (trusted by 1.5 million sites).<\/li>\n<li><a href=\"https:\/\/duplicator.com\/\" rel=\"friend nofollow ugc\">Duplicator<\/a> – popular WordPress backup and migration plugin used by over 1 million websites.<\/li>\n<li><a href=\"https:\/\/wpsimplepay.com\/\" rel=\"friend nofollow ugc\">WP Simple Pay<\/a> –  #1 Stripe payments plugin for WordPress. Start accepting one-time or recurring payments without a shopping cart.<\/li>\n<li><a href=\"https:\/\/rafflepress.com\/\" rel=\"friend nofollow ugc\">RafflePress<\/a> – Best WordPress giveaway and contest plugin to grow traffic and social followers.<\/li>\n<li><a href=\"https:\/\/trustpulse.com\/\" rel=\"friend nofollow ugc\">TrustPulse<\/a> &#8211; Add real-time social proof notifications to boost your store conversions by up to 15%.<\/li>\n<li><a href=\"https:\/\/searchwp.com\/\" rel=\"friend nofollow ugc\">SearchWP<\/a> &#8211;  The most advanced custom WordPress search plugin to improve WordPress search quality.<\/li>\n<li><a href=\"https:\/\/affiliatewp.com\/\" rel=\"friend nofollow ugc\">AffiliateWP<\/a> &#8211; #1 affiliate management plugin for WordPress. Add a referral program to your online store.<\/li>\n<li><a href=\"https:\/\/easydigitaldownloads.com\/\" rel=\"friend nofollow ugc\">Easy Digital Downloads<\/a> &#8211; The best WordPress eCommerce plugin to sell digital products (eBooks, software, music, and more).<\/li>\n<li><a href=\"https:\/\/www.wpcharitable.com\/\" rel=\"friend nofollow ugc\">WPCharitable<\/a> &#8211; Top-rated WordPress donation and fundraising plugin for WordPress.<\/li>\n<\/ul>\n<p>Visit <a href=\"https:\/\/www.wpbeginner.com\/\" rel=\"friend nofollow ugc\">WPBeginner<\/a> to learn from our <a href=\"https:\/\/www.wpbeginner.com\/category\/wp-tutorials\/\" rel=\"friend nofollow ugc\">WordPress Tutorials<\/a> and about the <a href=\"https:\/\/www.wpbeginner.com\/category\/plugins\/\" rel=\"friend nofollow ugc\">best WordPress plugins<\/a>.<\/p>\n<h3>Notes<\/h3>\n<p>PushEngage is hands down the <a href=\"https:\/\/www.pushengage.com\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">best push notifications plugin<\/a> on the market. No other WordPress notification plugin even comes close to PushEngage and the features it offers.<\/p>\n<p>We are pioneering the world of push notifications. For the longest time, push notification software was nowhere as powerful or flexible as email marketing software. With PushEngage, that’s changing. And fast!<\/p>\n<p>Also I’m the founder of <a href=\"https:\/\/syedbalkhi.com\/companies\/\" rel=\"friend nofollow ugc\">several popular online businesses<\/a>, so it was a huge priority for me to make a WordPress push notification plugin that can help us grow our subscribers &amp; sales.<br \/>\nI feel that we have done that. I hope you enjoy using PushEngage.<\/p>\n<p>Thank you,<br \/>\nSyed Balkhi<\/p>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-1.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-1.png?rev=2873206\" alt=\"Analytics Dashboard\"><\/a><p>Analytics Dashboard<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-2.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-2.png?rev=2873206\" alt=\"Personalized marketing through segmentation\"><\/a><p>Personalized marketing through segmentation<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-3.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-3.png?rev=2873206\" alt=\"Opt-in analytics data overview\"><\/a><p>Opt-in analytics data overview<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-4.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-4.png?rev=2873206\" alt=\"Safari style popup modal\"><\/a><p>Safari style popup modal<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-5.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-5.png?rev=2873206\" alt=\"Safari style popup modal with segment preference\"><\/a><p>Safari style popup modal with segment preference<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-6.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-6.png?rev=2873206\" alt=\"Browser permission request dialog\"><\/a><p>Browser permission request dialog<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-7.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-7.png?rev=2873206\" alt=\"Powerful push notifications for user engagement\"><\/a><p>Powerful push notifications for user engagement<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-8.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-8.png?rev=2873206\" alt=\"Comprehensive analytics overview for detailed insights\"><\/a><p>Comprehensive analytics overview for detailed insights<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-9.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-9.png?rev=2873206\" alt=\"Notification Look and Design\"><\/a><p>Notification Look and Design<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-10.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-10.png?rev=2873206\" alt=\"Boost user engagement with A\/B testing\"><\/a><p>Boost user engagement with A\/B testing<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-11.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-11.png?rev=2873206\" alt=\"Targeted campaigns through audience selection\"><\/a><p>Targeted campaigns through audience selection<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-12.png?rev=2873206\"><img src=\"https:\/\/ps.w.org\/pushengage\/assets\/screenshot-12.png?rev=2873206\" alt=\"Send campaigns at the perfect time\"><\/a><p>Send campaigns at the perfect time<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Appreciation<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/intergemm\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/6b8e6e2b46dbfa72c5d32d8798639a6c?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/6b8e6e2b46dbfa72c5d32d8798639a6c?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/intergemm\/\" class=\"reviewer-name\">intergemm<\/a> on <span class=\"review-date\">April 6, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Good Job guys<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great tool to invite your audience<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/mgyula\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/2a555552c42cca1bc5850def8dfb9fc0?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/2a555552c42cca1bc5850def8dfb9fc0?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/mgyula\/\" class=\"reviewer-name\">mgyula<\/a> on <span class=\"review-date\">March 15, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">It helps me a lot to reach my audience whenever an event is going on my web site.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Exceeded my expectations!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/scottsearch\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/7553297b13db8d38f73d1e1ec01c46ea?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/7553297b13db8d38f73d1e1ec01c46ea?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/scottsearch\/\" class=\"reviewer-name\">scottsearch<\/a> on <span class=\"review-date\">February 1, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Had an issue (I created) during set up of an upgrade and Rakesh from their service team went over and above to handle my issue and fix my mistake. Very happy with the level of support I received! Thanks!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Awesome Plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/yodaasecc\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/07e27c0248d0bdec087b11a4d70066f7?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/07e27c0248d0bdec087b11a4d70066f7?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/yodaasecc\/\" class=\"reviewer-name\">yodaasecc<\/a> on <span class=\"review-date\">January 19, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\"><strong><em>Fantasic job!<\/em><\/strong><\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Excellent !<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/danielsami\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/bea65ee8fe0abb1454d57145a1656f79?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/bea65ee8fe0abb1454d57145a1656f79?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/danielsami\/\" class=\"reviewer-name\">danielsami<\/a> on <span class=\"review-date\">December 18, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Big help with your SEO efforts. Easy way to build a visitors database<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/aazarghafoor\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/9b7f870935a1336dcb9e1efedfa17207?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/9b7f870935a1336dcb9e1efedfa17207?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/aazarghafoor\/\" class=\"reviewer-name\">aazarghafoor<\/a> on <span class=\"review-date\">November 30, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">good work<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Powerful plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/naija247news\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/446bc6dde81eb68475a4eb72ff79d6db?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/446bc6dde81eb68475a4eb72ff79d6db?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/naija247news\/\" class=\"reviewer-name\">Naija247news<\/a> on <span class=\"review-date\">October 24, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">very nice and powerful plugin and I would recommend it to anyone <\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">account was upgraded without my approval<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/jh-web-designer\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/88727c549bb4ee5460516f9757f9e992?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/88727c549bb4ee5460516f9757f9e992?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/jh-web-designer\/\" class=\"reviewer-name\">JH Web Designer<\/a> on <span class=\"review-date\">September 19, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">For a while now I've been using PushEngage. Seeing that with some other sites I use I'll get browser notifications, and I wanted the same for my site. I signed up for the FREE plan on PushEngage's website and installed the WP plugin. Well with the FREE plan your only allowed to send out 30 Campaigns, which is fine. However today my Credit Card was charged and they automatically upgraded my account to Business to \"accommodate\" my needs, but I never consented to this. If anything I should have at least gotten a notice that I've already reached my 30 Campaign limit, but I didn't, instead they just upgraded my account and charged me. I am getting a refund, but BE WARE! This is a bit ridiculous though that I had to write to them to get a refund. Not to mention that IF the \"FREE PLAN\" works in the way that where you only get to send out only 30 Campaigns and then it stops working, where instead the FREE plan should work where once you've reached your limit for that month, then a block should be inplace, but then it resets for the next months time period. Just about any type of a FREE service plan works in the manor where once you've reached your limit for the month, you get a email notice, and then their is a block, but then the block is lifted or reset for the next month period. PushEngage however doesn't seem to follow this. If they do, then this isn't happening. I do not recomend using this to send out notifications about your site to your subscribers. Their are other ways to give subscribers or customers notices about anything regarding your site.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Work Great until last week!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"2 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"2\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/cliffbusiness4466\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/d67b5b9e8464f239e668299034e51d86?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/d67b5b9e8464f239e668299034e51d86?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/cliffbusiness4466\/\" class=\"reviewer-name\">cliffbusiness4466<\/a> on <span class=\"review-date\">September 8, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I used the plugin for about three months with no issues and good results. Until last week, I got an error on my dashboard. I had to pay a WO specialist only to find out the plugin was blocked. Here is the message:<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">\"Due to increased security policies, there are now themes and\/or plugins that are not compatible with the Managed WordPress platform, and there are blacklisted folders where PHP files are not accessible to stop future malware from infecting websites hosted on this platform. Unfortunately, this change is permanent, and there is no way around it.\"<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">It is a shame this is a great plugin. I would have given it 5 stars.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Awesome plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/jabith\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1b478283ea6d8d136ed5a78accb56a2b?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1b478283ea6d8d136ed5a78accb56a2b?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/jabith\/\" class=\"reviewer-name\">jabith<\/a> on <span class=\"review-date\">August 25, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">We use this plugin for automatic push messages every time a blog post is launched, and it perfectly does the job.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "🤩 Send personalized web push notifications on autopilot. 10x your repeat traffic and WordPress site engagement with push notification campaigns. 🚀",
    "description": "<p>🤩 Send personalized web push notifications on autopilot. 10x your repeat traffic and WordPress site engagement with push notification campaigns. 🚀<\/p>\n<h3><\/h3>\n<p><a href=\"https:\/\/www.pushengage.com\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">PushEngage<\/a> is the #1 push notification plugin in the world. It’s a marketing plugin that helps you get more web push notification subscribers, increase sales, and grow your business.<\/p>\n<p>With PushEngage’s web push notifications, you can turn your website visitors into regular readers, loyal fans, and repeat customers. The coolest part is that it only takes your subscribers two clicks or less to get subscribed to your notifications.<\/p>\n<p>PushEngage gives you a simple, easy-to-use dashboard that helps you create optins, launch web push campaigns, grow your subscriber base, track your revenue goals, and manage your audience using advanced segmentation and audience targeting rules.<\/p>\n<p>Using the PushEngage dashboard, you can even add custom call to action (CTA) buttons. The buttons have many of our customers dramatically increase their click-through rates (CTR).<\/p>\n<p>You also get advanced analytics to track your performance metrics with or without using third-party tools such as Google Analytics.<\/p>\n<p>We also offer mobile popup modals so that your marketing messages will always look great on all devices (mobile, tablet, laptop, and desktop). We’re constantly working to improve the opt-in prompts as well. In fact, we’re the only push notification service that can integrate seamlessly with a web popup builder to offer a better user experience.<\/p>\n<p>Along with the absolute best web push notification software in the market, you also get a top-tier Customer Success team to help you get more success from your push notifications more often.<\/p>\n<p><strong>PushEngage App<\/strong><br \/>\nPushEngage is a SaaS service to send browser notifications including:<\/p>\n<ul>\n<li>Chrome push notifications<\/li>\n<li>Firefox push notifications<\/li>\n<li>Edge push notifications<\/li>\n<li>Safari push notifications<\/li>\n<li>iOS and iPadOS web notifications<\/li>\n<li>Opera push notifications<\/li>\n<li>Android web push notifications<\/li>\n<li>AMP web push notifications<\/li>\n<li>PWA web push notifications<\/li>\n<li>Mozilla web push notifications<\/li>\n<\/ul>\n<p>And more.<\/p>\n<p>You will need to create a PushEngage account to use our popup builder and to gain push notification subscribers using PushEngage. We recommend <a href=\"https:\/\/www.pushengage.com\/pricing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"nofollow ugc\">getting started with PushEngage Premium!<\/a><\/p>\n<p>It’s super easy to create highly targeted and personalized push messages with our easy campaign creator.<\/p>\n<p>If you’re looking for advanced automation, you can use the push API to serve use cases that your competitors aren’t even thinking of!<\/p>\n<p>The best part is the PushEngage plugin connects directly with the web app and installs the service worker on your site automatically unlike any other push notification service. Just in case you’re not a developer, the service worker is a JSON file that allows you to collect push notification subscribers. With other push notification software, you need to manually download and place the file into your server. But our plugin automatically does it for you.<\/p>\n<p>Here’s why 10,000+ smart business owners, designers, and developers use PushEngage to send <strong>15+ billion web push campaigns every month<\/strong>, and you will too!<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/eBhtAZgoNbE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>Send Push Notifications to Increase Repeat Traffic &amp; Conversions<\/h3>\n<p>Whether you&#8217;re running a blog, a news site, a travel site, a SaaS site, or an eCommerce site, push notifications can help you grow your business.<\/p>\n<p>The best part about PushEngage&#8217;s web push campaigns is that you can modify it to suit any type of business.<\/p>\n<p>If you&#8217;re running an eCommerce site, you can send transactional push notifications to increase your revenue. And if you&#8217;re running a blog site or a media outlet, then you can create powerful automated campaigns to get repeat readers, more ad revenue, higher views on your social media content, and so much more.<\/p>\n<p>You can even increase paid subscriptions to your premium content, merchandise sales, conversions on your affiliate offers, and more.<\/p>\n<p>Here&#8217;s a quick look at some of the most advanced features you should know about:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-install-web-push-notifications-plugin-on-wordpress-website\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Push Broadcast<\/a> &#8211; Schedule or send web push notification broadcasts to a custom audience in a matter of minutes. Use revenue tracking to keep sight of your goals and A\/B testing to improve your campaign performance.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/website-welcome-message\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Welcome Push Notifications<\/a> &#8211; Send automated welcome messages to your push notification subscribers. Get higher retention rates and send discounts and offers to increase your sales.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-do-segmentation-in-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Automatic Segmentation<\/a> &#8211; Quickly segment your web push notification subscribers as soon as they subscribe based on their interests.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/announcement-audience-grouping\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Audience Group<\/a> &#8211; Create retargeting push notifications and advanced targeting groups within your audience. Filter your audience by behavior, engagement, and interests.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-schedule-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Timezone Push Notifications<\/a> &#8211; Schedule your push notifications to automatically get sent when it has the most impact. Send push notifications in your timezone or in your subscribers’ timezones with a single click.<\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/personalize-your-campaigns-using-attributes\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Custom Drip Campaigns<\/a> &#8211; Send personalized drip push notifications to improve your repeat traffic, engagement, and sales. Retarget your customers and turn them into loyal superfans.<\/li>\n<\/ul>\n<p>And if you’re super busy with marketing activities and you just want to use push notifications to promote your new content, you can send RSS push notifications as well. Unlike other push notification services, you don’t even need to use a notifications API. You can do it straight from the plugin.<\/p>\n<p>Even better, the PushEngage plugin can automatically turn your WordPress blog categories into segments that you can use to send retargeting push messages.<\/p>\n<p>The coolest part is that we help you succeed with your campaigns. You can always talk to our top-tier Customer Success team to set up, track, and optimize your campaigns. And we also give you push notification templates that are proven to work so that you don&#8217;t have to build anything from scratch. It’s super user-friendly.<\/p>\n<p>What’s more is that you can use our Javascript API to create custom campaigns and send notifications synced to a CRM software.<\/p>\n<h3>The PushEngage Dashboard Makes it Easy<\/h3>\n<p>We were tired of the push notification software that in the market that are too difficult to use and are built for developers instead of business owners. That’s why we built PushEngage to help you create powerful marketing workflows and custom web push notification campaigns even without a developer.<\/p>\n<p>With PushEngage, you can create powerful marketing campaigns from a simple dashboard in a matter of minutes even if:<\/p>\n<ul>\n<li>You’re not a developer and don’t know how to use code to send push notifications<\/li>\n<li>You’ve never used push notifications before and you have no idea where to start<\/li>\n<li>You tried another push notification software and hated the experience<\/li>\n<\/ul>\n<p>But don’t just take our word for it. Here’s what Amanda had to say:<\/p>\n<blockquote>\n<p>It’s uber-easy to use, the support team is helpful, and the results are impressive. Especially when you take into account how little work they are to build and send. Highly recommend PushEngage to anyone wanting a way to reach customers that’s fast, reliable, and effective.<br \/>\n  &#8211; Amanda Hyciek, Digital Marketing Strategist, Wicked Weasel (<a href=\"https:\/\/www.pushengage.com\/case-study-wicked-weasel-2k-to-4k-sales-per-week-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">See Case Study<\/a>)<\/p>\n<\/blockquote>\n<h3>Time-Tested Push Notification Campaign Templates<\/h3>\n<p>Don’t know what push notification campaigns you need and how to get started?<\/p>\n<p>No worries. We built campaign templates into our dashboard that you can use to get started.<\/p>\n<p>The technical stuff is all taken care of. All you have to do is:<\/p>\n<ul>\n<li>Select a campaign type<\/li>\n<li>Create your push notifications<\/li>\n<li>Select an audience to send to<\/li>\n<li>Send\/Schedule your campaign<\/li>\n<\/ul>\n<p>Even with <a href=\"https:\/\/www.pushengage.com\/automated-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">advanced trigger campaigns<\/a>, you can start with a template that comes with pre-built triggers so that you don’t have to configure them yourself. All you have to do is focus on growing your business.<\/p>\n<h3>Smart Page Targeting and Behavior Based Personalization<\/h3>\n<p>All PushEngage popup modals come with advanced page targeting and behavior based personalization.<\/p>\n<p>This means you can <a  rel=\"friend nofollow ugc\">show a custom popup<\/a> for:<\/p>\n<ul>\n<li>A specific page or set of pages of your site<\/li>\n<li>Different website visitors based on their geolocation<\/li>\n<li>Users who click a specific link<\/li>\n<\/ul>\n<p>And more!<\/p>\n<p>You can even segment your subscribers automatically when they visit your site. PushEngage allows you to create <a href=\"https:\/\/www.pushengage.com\/how-to-do-segmentation-in-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">custom segmentation rules<\/a>. And if you want your visitors to click a button on your site to subscribe to your push notifications, you can create <a href=\"https:\/\/www.pushengage.com\/how-to-collect-web-push-subscribers-using-button-or-link-click\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">click to subscribe buttons<\/a> as well.<\/p>\n<p>If you like, you can even create a <a href=\"https:\/\/www.pushengage.com\/subscription-widget-wordpress\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">subscription widget<\/a> where your visitors can choose what kind of notifications they want to receive.<\/p>\n<p>This allows you to send targeted web push notifications that fetch you more subscribers, higher engagement rates, and more sales.<\/p>\n<blockquote>\n<p>PushEngage is our best converting paid traffic channel. The open-rate is about 400% better than sending out newsletters and also the time to create a push notification is far more effective. The overall performance of sending out push notifications with PushEngage has been a pleasant surprise last year.<br \/>\n  &#8211; Domingo Karsten, CEO &amp; Co-Founder, Saleduck<\/p>\n<\/blockquote>\n<h3>Advanced Analytics and A\/B Testing<\/h3>\n<p>Unlike other WordPress push notification plugins, PushEngage comes with reliable A\/B split testing and accurate analytics without slowing down your site. Most other plugins face significant issues with caching that can skew your web push campaign analytics and A\/B tests.<\/p>\n<p>But PushEngage offers far better infrastructure for more accurate results. You get detailed analytics on all your campaigns and optins right from your dashboard.<\/p>\n<p>What’s more is that you can create Intelligent A\/B tests to improve an ongoing campaign.<\/p>\n<p>With Intelligent A\/B testing, you can select a small audience to split test your browser push notifications and then send the winning notification to the rest of your audience.<\/p>\n<p><a href=\"https:\/\/www.pushengage.com\/brandsmart-usa-case-study\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">BrandsMart USA Got a Whopping 2.9 Million Views from Push Notifications<\/a> by using A\/B testing. If you’re new to push notification analytics and split testing, you should check out our guides on:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/push-notification-a-b-testing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">How to do Push Notification A\/B Testing (Best Practices)<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-track-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">How to Track Push Notifications with Google Analytics<\/a><\/li>\n<\/ul>\n<p><strong>NOTE:<\/strong> You can only get access to advanced analytics and A\/B testing if you&#8217;re on a paid plan. The free plan only helps you get started with push notifications.<\/p>\n<h3>Powerful Integrations<\/h3>\n<p>PushEngage just works no matter what device or browser your visitors are using including:<\/p>\n<ul>\n<li>Google Chrome<\/li>\n<li>Safari<\/li>\n<li>Firefox<\/li>\n<li>Edge<\/li>\n<li>Opera<\/li>\n<li>Samsung<\/li>\n<li>UC Browser<\/li>\n<\/ul>\n<p>It also works out of the box with all major website builders and eCommerce platforms and solutions. Check out our installation guides:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-install-web-push-notifications-plugin-on-wordpress-website\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WordPress<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-use-push-notification-on-wordpress-without-plugin\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WordPress (without a plugin)<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-go-live-with-web-push-notifications-on-a-woocommerce-site\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Install push notifications on WooCommerce<\/a><\/li>\n<\/ul>\n<p>And it integrates seamlessly with marketing tools such as:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-track-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Google Analytics<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/install-pushengage-through-gtm\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Google Tag Manager<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-to-integrate-web-push-notification-on-instapage-landingpages\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Instapage<\/a><\/li>\n<li><a href=\"https:\/\/www.pushengage.com\/how-integrate-web-push-notification-clickfunnels\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">ClickFunnels<\/a><\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.pushengage.com\/pricing\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Get started with PushEngage today!<\/a><\/p>\n<h4>Credits<\/h4>\n<p>This WordPress web push notifications plugin was created by <a href=\"https:\/\/syedbalkhi.com\/\" rel=\"friend nofollow ugc\">Syed Balkhi<\/a>.<\/p>\n<h4>Branding Guidelines<\/h4>\n<p>When writing about the browser push notification plugin by PushEngage, please make sure to uppercase the letter P and E.<\/p>\n<ul>\n<li>PushEngage (correct)<\/li>\n<li>Push Engage (incorrect)<\/li>\n<li>pushengage (incorrect)<\/li>\n<li>push engage (incorrect)<\/li>\n<\/ul>\n<p>See our <a href=\"https:\/\/www.pushengage.com\/press\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">Press &amp; Brand Assets page<\/a> for more details.<\/p>\n<h4>What’s Next<\/h4>\n<p>To get the most value out of your growing browser push notification subscriber list, see our <a href=\"https:\/\/www.pushengage.com\/best-practices-web-push-notifications\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">push notification best practices<\/a>.<\/p>\n<p>You should also check out our article on <a href=\"https:\/\/www.pushengage.com\/push-notification-examples\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">75 Epic Push Notification Examples You Can Steal Right Now<\/a>.<\/p>\n<p>If you like this WordPress web push notifications plugin, then consider checking out our other projects:<\/p>\n<ul>\n<li><a href=\"https:\/\/optinmonster.com\/\" rel=\"friend nofollow ugc\">OptinMonster<\/a> – Get more email subscribers with the most popular conversion optimization plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/wpforms.com\/\" rel=\"friend nofollow ugc\">WPForms<\/a> – #1 drag &amp; drop online form builder for WordPress (trusted by 5 million sites).<\/li>\n<li><a href=\"https:\/\/aioseo.com\/\" rel=\"friend nofollow ugc\">AIOSEO<\/a> &#8211; The original WordPress SEO plugin to help you rank higher in search results (trusted by over 3 million sites).<\/li>\n<li><a href=\"https:\/\/www.monsterinsights.com\/\" rel=\"friend nofollow ugc\">MonsterInsights<\/a> – See the stats that matter and grow your business with confidence. Best Google Analytics plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/www.seedprod.com\/\" rel=\"friend nofollow ugc\">SeedProd<\/a> – Create beautiful landing pages with our powerful drag &amp; drop landing page builder.<\/li>\n<li><a href=\"https:\/\/wpmailsmtp.com\/\" rel=\"friend nofollow ugc\">WP Mail SMTP<\/a> – Improve email deliverability for your contact form with the most popular SMTP plugin for WordPress.<\/li>\n<li><a href=\"https:\/\/smashballoon.com\/\" rel=\"friend nofollow ugc\">Smash Balloon<\/a> &#8211; #1 social feeds plugin for WordPress &#8211; display social media content in WordPress without code.<\/li>\n<li><a href=\"https:\/\/wpcode.com\/\" rel=\"friend nofollow ugc\">WPCode<\/a> &#8211; must have WordPress code snippet management plugin to help you future-proof website customization (trusted by 1.5 million sites).<\/li>\n<li><a href=\"https:\/\/duplicator.com\/\" rel=\"friend nofollow ugc\">Duplicator<\/a> – popular WordPress backup and migration plugin used by over 1 million websites.<\/li>\n<li><a href=\"https:\/\/wpsimplepay.com\/\" rel=\"friend nofollow ugc\">WP Simple Pay<\/a> –  #1 Stripe payments plugin for WordPress. Start accepting one-time or recurring payments without a shopping cart.<\/li>\n<li><a href=\"https:\/\/rafflepress.com\/\" rel=\"friend nofollow ugc\">RafflePress<\/a> – Best WordPress giveaway and contest plugin to grow traffic and social followers.<\/li>\n<li><a href=\"https:\/\/trustpulse.com\/\" rel=\"friend nofollow ugc\">TrustPulse<\/a> &#8211; Add real-time social proof notifications to boost your store conversions by up to 15%.<\/li>\n<li><a href=\"https:\/\/searchwp.com\/\" rel=\"friend nofollow ugc\">SearchWP<\/a> &#8211;  The most advanced custom WordPress search plugin to improve WordPress search quality.<\/li>\n<li><a href=\"https:\/\/affiliatewp.com\/\" rel=\"friend nofollow ugc\">AffiliateWP<\/a> &#8211; #1 affiliate management plugin for WordPress. Add a referral program to your online store.<\/li>\n<li><a href=\"https:\/\/easydigitaldownloads.com\/\" rel=\"friend nofollow ugc\">Easy Digital Downloads<\/a> &#8211; The best WordPress eCommerce plugin to sell digital products (eBooks, software, music, and more).<\/li>\n<li><a href=\"https:\/\/www.wpcharitable.com\/\" rel=\"friend nofollow ugc\">WPCharitable<\/a> &#8211; Top-rated WordPress donation and fundraising plugin for WordPress.<\/li>\n<\/ul>\n<p>Visit <a href=\"https:\/\/www.wpbeginner.com\/\" rel=\"friend nofollow ugc\">WPBeginner<\/a> to learn from our <a href=\"https:\/\/www.wpbeginner.com\/category\/wp-tutorials\/\" rel=\"friend nofollow ugc\">WordPress Tutorials<\/a> and about the <a href=\"https:\/\/www.wpbeginner.com\/category\/plugins\/\" rel=\"friend nofollow ugc\">best WordPress plugins<\/a>.<\/p>\n<h3>Notes<\/h3>\n<p>PushEngage is hands down the <a href=\"https:\/\/www.pushengage.com\/?utm_source=orgplugin&amp;utm_medium=link&amp;utm_campaign=wpreadme\" rel=\"friend nofollow ugc\">best push notifications plugin<\/a> on the market. No other WordPress notification plugin even comes close to PushEngage and the features it offers.<\/p>\n<p>We are pioneering the world of push notifications. For the longest time, push notification software was nowhere as powerful or flexible as email marketing software. With PushEngage, that’s changing. And fast!<\/p>\n<p>Also I’m the founder of <a href=\"https:\/\/syedbalkhi.com\/companies\/\" rel=\"friend nofollow ugc\">several popular online businesses<\/a>, so it was a huge priority for me to make a WordPress push notification plugin that can help us grow our subscribers &amp; sales.<br \/>\nI feel that we have done that. I hope you enjoy using PushEngage.<\/p>\n<p>Thank you,<br \/>\nSyed Balkhi<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.8.1.zip",
    "upgrade_notice": [],
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-1.png?rev=2873206",
            "caption": "Analytics Dashboard"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-2.png?rev=2873206",
            "caption": "Personalized marketing through segmentation"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-3.png?rev=2873206",
            "caption": "Opt-in analytics data overview"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-4.png?rev=2873206",
            "caption": "Safari style popup modal"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-5.png?rev=2873206",
            "caption": "Safari style popup modal with segment preference"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-6.png?rev=2873206",
            "caption": "Browser permission request dialog"
        },
        "7": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-7.png?rev=2873206",
            "caption": "Powerful push notifications for user engagement"
        },
        "8": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-8.png?rev=2873206",
            "caption": "Comprehensive analytics overview for detailed insights"
        },
        "9": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-9.png?rev=2873206",
            "caption": "Notification Look and Design"
        },
        "10": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-10.png?rev=2873206",
            "caption": "Boost user engagement with A\/B testing"
        },
        "11": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-11.png?rev=2873206",
            "caption": "Targeted campaigns through audience selection"
        },
        "12": {
            "src": "https:\/\/ps.w.org\/pushengage\/assets\/screenshot-12.png?rev=2873206",
            "caption": "Send campaigns at the perfect time"
        }
    },
    "tags": {
        "browser-notifications": "browser notifications.",
        "chrome-push-notifications": "chrome push notifications",
        "firefox-push-notifications": "firefox push notifications",
        "opera-push-notifications": "opera push notifications",
        "safari-push-notifications": "safari push notifications"
    },
    "stable_tag": "4.0.8.1",
    "versions": {
        "1.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.1.zip",
        "1.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.zip",
        "1.2.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.1.zip",
        "1.2.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.2.zip",
        "1.2.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.3.zip",
        "1.2.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.4.zip",
        "1.2.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.5.zip",
        "1.2.6": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.6.zip",
        "1.2.7": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.7.zip",
        "1.2.8": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.8.zip",
        "1.2.9": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.2.9.zip",
        "1.3.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.0.zip",
        "1.3.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.1.zip",
        "1.3.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.2.zip",
        "1.3.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.3.zip",
        "1.3.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.4.zip",
        "1.3.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.5.zip",
        "1.3.6": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.6.zip",
        "1.3.7": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.7.zip",
        "1.3.8": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.8.zip",
        "1.3.9": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.3.9.zip",
        "1.4.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.0.zip",
        "1.4.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.1.zip",
        "1.4.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.2.zip",
        "1.4.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.3.zip",
        "1.4.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.4.zip",
        "1.4.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.5.zip",
        "1.4.6": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.6.zip",
        "1.4.7": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.7.zip",
        "1.4.8": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.8.zip",
        "1.4.9": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.4.9.zip",
        "1.5.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.0.zip",
        "1.5.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.1.zip",
        "1.5.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.2.zip",
        "1.5.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.3.zip",
        "1.5.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.4.zip",
        "1.5.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.5.zip",
        "1.5.6": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.6.zip",
        "1.5.7": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.7.zip",
        "1.5.8": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.1.5.8.zip",
        "2.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.2.0.zip",
        "2.0.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.2.0.2.zip",
        "2.0.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.2.0.3.zip",
        "2.0.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.2.0.4.zip",
        "2.0.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.2.0.5.zip",
        "3.0.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.0.0.zip",
        "3.0.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.0.1.zip",
        "3.1.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.1.0.zip",
        "3.1.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.1.1.zip",
        "3.2.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.2.0.zip",
        "3.2.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.2.1.zip",
        "3.2.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.2.2.zip",
        "3.2.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.3.2.3.zip",
        "4.0.0": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.0.zip",
        "4.0.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.1.zip",
        "4.0.2": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.2.zip",
        "4.0.3": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.3.zip",
        "4.0.4": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.4.zip",
        "4.0.4.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.4.1.zip",
        "4.0.5": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.5.zip",
        "4.0.5.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.5.1.zip",
        "4.0.6": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.6.zip",
        "4.0.7": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.7.zip",
        "4.0.7.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.7.1.zip",
        "4.0.8": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.8.zip",
        "4.0.8.1": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.4.0.8.1.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/pushengage.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https:\/\/ps.w.org\/pushengage\/assets\/banner-772x250.png?rev=2873206",
        "high": "https:\/\/ps.w.org\/pushengage\/assets\/banner-1544x500.png?rev=2873206"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/pushengage\/assets\/icon.svg?rev=2873206",
        "svg": "https:\/\/ps.w.org\/pushengage\/assets\/icon.svg?rev=2873206"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}