{
    "name": "RabbitLoader &#8211; All in One PageSpeed Optimization Plugin with Cache, Image Optimization, Lazy Loading &amp; more",
    "slug": "rabbit-loader",
    "version": "2.19.18",
    "author": "<a href=\"https:\/\/rabbitloader.com\/\">RabbitLoader<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/sanrl\/",
    "contributors": {
        "sanrl": {
            "profile": "https:\/\/profiles.wordpress.org\/sanrl\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/adc8adb50bc1f3eb2254514af76d09b4?s=96&d=monsterid&r=g",
            "display_name": "RabbitLoader"
        },
        "abhishekgr": {
            "profile": "https:\/\/profiles.wordpress.org\/abhishekgr\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/9e7850a239bb132ca24c405c2ec3d6ed?s=96&d=monsterid&r=g",
            "display_name": "abhishekgr"
        }
    },
    "requires": "4.7",
    "tested": "6.4.4",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 39,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 7
    },
    "num_ratings": 47,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/rabbit-loader\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 4000,
    "downloaded": 164791,
    "last_updated": "2024-02-29 4:50am GMT",
    "added": "2021-02-28",
    "homepage": "https:\/\/rabbitloader.com",
    "sections": {
        "description": "<p><a href=\"https:\/\/rabbitloader.com\/\" title=\"RabbitLoader\" rel=\"nofollow ugc\">RabbitLoader<\/a> is a CDN cache-based speed optimization plugin that uses caching, CDN, and other techniques to reduce the loading time of WordPress websites. Enabling you to get a perfect score on Google PageSpeed Insights and achieve better SEO rankings.<\/p>\n<p>You would not need 10 different plugins for caching, CDN, HTML, JavaScript, CSS minification, lazy loading of images and videos, image size reduction, AVIF\/WebP conversion, preloading, compression, and so on.<\/p>\n<p>All these optimization plugins overwhelm the admin panel, conflict with each other, and slow down your website. Just install RabbitLoader, and it will optimize the whole website in a few minutes without the need for an expert or a developer.<\/p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/W-jYelvWE0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p><a href=\"https:\/\/rabbitloader.com\/wordpress-crash-course\/\" title=\"PageSpeed optimization crash course videos\" rel=\"nofollow ugc\">Watch bite size tutorial videos<\/a><\/p>\n<p><strong>Highlights<\/strong><\/p>\n<ul>\n<li>Obtain a PageSpeed Score of 95 or higher for all pages.<\/li>\n<li>Reduce image size by 40% with the NextGen AVIF\/WebP format.<\/li>\n<li>Reduce CSS size by 98% automatically.<\/li>\n<li>Improve Core Web Vitals (lower FCP, FID, and CLS).<\/li>\n<li>Higher rankings on Google Search and better conversions.<\/li>\n<li>No coding knowledge is needed.<\/li>\n<li>Replaces 5–10 optimization plugins.<\/li>\n<li>Cache, Lazy Loading, CDN, Compression, Preloading.<\/li>\n<li>Image, CSS, JavaScript Optimization.<\/li>\n<\/ul>\n<p><strong>Benefits of using RabbitLoader:<\/strong><\/p>\n<p><strong>Cache<\/strong><\/p>\n<p>Caching is the process of storing frequently accessed data or assets in a temporary storage space for faster access and retrieval. RabbitLoader does this automatically, and one doesn&#8217;t need to use any separate plugin for caching when using RabbitLoader.<\/p>\n<p>It stores the website&#8217;s assets in the nearest <a href=\"https:\/\/rabbitloader.com\/articles\/category\/caching\/\" title=\"Cache\" rel=\"nofollow ugc\">cache servers<\/a>, which means that the browser does not have to fetch them again from the server, resulting in faster page loads and a better user experience.<\/p>\n<p><strong>CSS and JavaScript Cache<\/strong><\/p>\n<p>All CSS and JavaScript files are cached at CDN servers for a lifetime. This is also referred to as immutable caching because the cached content does not change unless the file version in the URL changes or a full purge is performed.<\/p>\n<p>RabbitLoader improves CSS and JavaScript caching by utilizing browser caching headers. When a browser requests a resource from a server, it can store that resource in its cache, as long as the server provides caching headers that specify how long the resource should be cached.<\/p>\n<p>Overall, RabbitLoader does a better job of caching CSS and JavaScript by leveraging browser caching headers and other techniques. These techniques can significantly improve the performance of a website and enhance the user experience by reducing page load times.<\/p>\n<p><strong>Image Caching<\/strong><\/p>\n<p>Similar to CSS and JavaScript files, images are cached at CDN servers for a lifetime, also known as immutable caching. The cached content never changes unless the file version in the URL changes.<\/p>\n<p>When a user visits a webpage for the first time, their browser downloads all the necessary assets, including images, from the server. The browser stores these images in a cache so that it can access them quickly if the user visits the same webpage again.<\/p>\n<p>RabbitLoader improves image caching by utilizing the browser caching headers, similar to CSS and JavaScript caching. It sets optimal caching headers to ensure that the images are cached for the appropriate amount of time, reducing the number of times the browser has to request them from the server.<\/p>\n<p>RabbitLoader does all this automatically, improving the performance of a website by <a href=\"https:\/\/rabbitloader.com\/articles\/compressing-images-for-the-modern-web\/\" title=\"reducing the load time of images using RabbitLoader\" rel=\"nofollow ugc\">reducing the load time of images<\/a>, resulting in a better user experience.<\/p>\n<p><strong>Browser Cache<\/strong><\/p>\n<p>Browser caching is a technique used to store static assets like HTML pages, CSS and JavaScript files, and images in the user&#8217;s browser cache , allowing the browser to access them quickly if the user visits the same website again.<\/p>\n<p>RabbitLoader automatically ensures that the assets are cached for the right amount of time. This reduces the number of requests the browser makes to the server, reducing the load on the server and improving the overall performance of the website.<\/p>\n<p><strong>Image Optimization<\/strong><\/p>\n<p>Image optimization is the process of reducing the size of an image without compromising its quality. By optimizing images, website owners can reduce the load times of their pages, resulting in a better user experience.<\/p>\n<p>RabbitLoader does this automatically through lossless image conversion to either AVIF or WebP formats, by reducing image size by 40% to 50% on average. It uses various different techniques to optimize images, like lazy loading, compression, etc. These techniques can significantly improve the performance of a website by reducing the load time of images, resulting in a better user experience.<\/p>\n<p><strong>Lazy Loading Images<\/strong><\/p>\n<p>Lazy loading is a technique that loads web content only when it&#8217;s needed. Instead of loading all images on a webpage at once, lazy loading loads images as they come into view. This technique significantly reduces the time it takes for a web page to load by prioritizing the elements that the user can see immediately.<\/p>\n<p>RabbitLoader does this by <a href=\"https:\/\/rabbitloader.com\/kb\/enable-image-auto-conversion-to-webp\/\" title=\"Lazy Load Images using RabbitLoader\" rel=\"nofollow ugc\">lazy loading images<\/a>, along with YouTube and Vimeo videos, Google Maps, and any iframe embedded content. Only below-the-fold images are lazy loaded after all critical resources have finished loading, which keeps your LCP (largest element above the fold) and CLS scores healthy.<\/p>\n<p><strong>NextGen AVIF and WebP Formats<\/strong><\/p>\n<p>The Next-gen AVIF and WebP formats are image formats that uses advanced compression techniques to reduce the size of images while maintaining their quality. These images are up to 30% smaller than JPEG or PNG images, resulting in faster page load times.<\/p>\n<p>RabbitLoader <a href=\"https:\/\/rabbitloader.com\/articles\/next-gen-formats\/\" title=\"convert image to next-gen AVIF\/WebP format\" rel=\"nofollow ugc\">improves the use of next-gen AVIF\/WebP format<\/a> by automatically converting images to the most efficient Next-gen format. RabbitLoader detects the user&#8217;s browser and serves the AVIF\/WebP version of the image if the browser supports it. If the browser does not support the any of the modern format, RabbitLoader serves the original image format. This ensures that the user always receives the best version of the image that their browser supports.<\/p>\n<p><strong>Image Placeholders<\/strong><\/p>\n<p>When images are loaded on a website, they can cause a delay in page loading time, resulting in a poor user experience. To address this issue, many websites use lazy loading techniques that delay the loading of non-critical images until they are needed. This can significantly improve the page loading time, but it can also result in a visual lag or &#8220;layout reflow&#8221; as images load in.<\/p>\n<p>To minimize this issue, RabbitLoader uses inline image placeholders to give the visitors a better experience while waiting for the full-quality image to load.<\/p>\n<p>By using image placeholders, RabbitLoader ensures that the website&#8217;s layout remains intact and does not shift around when images are loaded, leading to a smoother user experience. Additionally, RabbitLoader uses caching to further improve the loading speed of these images, reducing the time required for images to be loaded when a user navigates to a new page or returns to a previously viewed page.<\/p>\n<p>This helps to minimize the visual lag and ensures that visitors have a consistently fast and responsive experience, no matter where they are in the world or what device they are using.<\/p>\n<p><strong>Integrated CDN<\/strong><\/p>\n<p>Integrated CDN is an important feature that RabbitLoader offers, which allows for caching of website content at multiple servers located around the world. RabbitLoader CDN service is integrated with the plugin, and no additional CDN plugin or service is required.<\/p>\n<p>This feature reduces the loading time of a website by serving content from the server nearest to the user, which in turn reduces bounce rates and improves the user experience.<\/p>\n<p>With an integrated CDN, RabbitLoader caches the website assets at multiple locations around the world, ensuring that the content is delivered to the user from the closest server. This reduces the latency and response time, resulting in faster website loading times.<\/p>\n<p>This is especially important for websites with a global audience, as it ensures that visitors from all over the world can access the website quickly and without any delay.<\/p>\n<p><strong>300+ PoP&#8217;s<\/strong><\/p>\n<p>RabbitLoader uses a <a href=\"https:\/\/rabbitloader.com\/origin-savings\/\" title=\"Content Delivery Network\" rel=\"nofollow ugc\">Content Delivery Network<\/a> (CDN) that is distributed throughout the world with over 300 Points of Presence (PoP). This means that no matter where your visitors are located, they can access your website&#8217;s content in milliseconds, resulting in a faster and smoother experience.<\/p>\n<p>This is essential for websites with a global audience, as it ensures that users from all regions can access your website quickly without experiencing any delays. With a distributed network, RabbitLoader is able to provide a faster response time for website content, which can improve user engagement and reduce bounce rates. The CDN&#8217;s wide coverage ensures that the content can be delivered to users from the nearest server, resulting in lower latency and faster loading times.<\/p>\n<p>Moreover, the use of a global CDN can also improve website security by distributing website traffic across multiple servers, reducing the risk of website crashes and distributed denial of service (DDoS) attacks.<\/p>\n<p>Overall, RabbitLoader&#8217;s use of a distributed network with over 300 PoPs offers significant advantages over traditional CDN services and can greatly enhance the performance of your website.<\/p>\n<p><strong>Low Data Transfer Time<\/strong><\/p>\n<p>Low data transfer time refers to the amount of data being transferred between a server and a client during a particular transaction. This could refer to the transfer of any type of data, such as text, images, videos, or other files. A low data transfer means that the amount of data being transferred is minimal, which can result in faster loading times and a better user experience for visitors accessing a website or web application.<\/p>\n<p>Low data transfer time is an important aspect of website performance, especially for users with slow internet connections. RabbitLoader uses the latest content compression algorithm from Cache Memory to minimize data transfer time for visitors on slow networks.<\/p>\n<p>This ensures that visitors can access website content quickly and efficiently, without having to wait for long load times or experience laggy page performance. By reducing data transfer time, RabbitLoader enhances website speed and improves the overall user experience, leading to increased engagement and reduced bounce rates.<\/p>\n<p>This feature is particularly useful for websites that receive a lot of traffic from users on slow or unreliable networks, as it helps to ensure that these visitors can still access the website quickly and easily.<\/p>\n<p><strong>Zero Down Time<\/strong><\/p>\n<p>Zero Down Time refers to the ability of a website to remain accessible to visitors even when the origin server is down. This is a crucial feature for any website that wants to ensure uninterrupted access to its content, products, or services.<\/p>\n<p>RabbitLoader CDN provides Zero Down Time functionality to its users. If the origin server goes down, RabbitLoader&#8217;s CDN cache steps in to serve the website&#8217;s content to visitors. This means that visitors will still be able to access the website&#8217;s content, even if the origin server is offline.<\/p>\n<p>This is a crucial feature for businesses and organizations that rely on their website to generate revenue, as even a short period of downtime can lead to lost sales and revenue. With RabbitLoader, website owners can rest assured that their website will remain accessible to visitors, no matter what happens to the origin server.<\/p>\n<p><strong>CSS Optimization<\/strong><\/p>\n<p>CSS optimization is the process of reducing the file size of CSS files, improving page load speed, and ultimately, the user experience. This is important because CSS is responsible for styling web pages and can become quite large and complex, leading to slower page load times.<\/p>\n<p>RabbitLoader takes care of CSS optimization for both critical and non-critical CSS using CDN cache. By leveraging caching technology, RabbitLoader can significantly reduce the load times of CSS files. Additionally, RabbitLoader optimizes both critical and non-critical CSS files, ensuring that the critical CSS is loaded first for a better user experience.<\/p>\n<p>Optimizing CSS files is an important aspect of improving website performance, and RabbitLoader helps achieve this by automating the process and ensuring that CSS files are cached and optimized for fast loading times.<\/p>\n<p><strong>Critical CSS Rendering<\/strong><\/p>\n<p>Critical CSS rendering is a technique that involves separating the critical CSS code from the non-critical CSS code and loading it first.<\/p>\n<p>This is done to ensure that the website loads quickly and the user can see the above-the-fold content without any delay. Above-the-fold content is the content that a user sees on the screen without having to scroll down.<\/p>\n<p>When a website is loading, the browser has to parse and render all the CSS files before the content can be displayed. This process can be time-consuming, especially if the CSS files are large.<\/p>\n<p>By rendering only the critical CSS, the browser can load the content much faster and improve the overall user experience.<br \/>\nRabbitLoader is designed to optimize critical CSS rendering by automatically detecting and optimizing the critical CSS code. It uses advanced algorithms to identify the critical CSS code and load it first.<\/p>\n<p>This technique helps to minimize render blocking, parsing, and cache misses, which can slow down the website&#8217;s loading speed.<\/p>\n<p><strong>Defer non-critical CSS<\/strong><\/p>\n<p>Defer non-critical CSS is a technique used to improve website loading speed and the overall user experience. As the name suggests, it involves deferring the loading of non-critical CSS until the critical resources have been loaded.<\/p>\n<p>This helps to minimize render blocking, reduce the amount of time it takes for a page to become interactive, and improve the perceived loading speed of the website.<\/p>\n<p>With RabbitLoader, this process is automated and optimized. The <a href=\"https:\/\/rabbitloader.com\/kb\/enable-disable-defer-loading-of-css\/\" title=\"Defer CSS\" rel=\"nofollow ugc\">non-critical CSS is separated<\/a> and deferred to allow the critical resources to load first, and the loading of the non-critical CSS is triggered after the critical resources have been loaded.<\/p>\n<p>This ensures that the website&#8217;s critical content is loaded as quickly as possible, and the non-critical content is loaded in the background without impacting the website&#8217;s performance. By optimizing this process, RabbitLoader helps to improve website speed, reduce bounce rates, and enhance user experience.<\/p>\n<p><strong>Deferring JavaScript<\/strong><\/p>\n<p>Deferring JavaScript refers to delaying the loading of non-critical JavaScript files until after critical resources, such as HTML, CSS, and images, have finished loading. This technique can significantly improve website performance by reducing page load times and enhancing the user experience.<\/p>\n<p>RabbitLoader effectively defers non-critical JavaScript files, especially those from third-party plugins and services, such as pop-ups, analytics, social media buttons, ads, chat widgets, and embedded media.<\/p>\n<p>By doing so, RabbitLoader prioritizes critical resources, allowing them to render faster, which enhances the user experience.<\/p>\n<p>With RabbitLoader, website owners can expect improved website performance, reduced page load times, and better user engagement. By deferring non-critical JavaScript, RabbitLoader ensures that the website loads faster, which leads to better engagement, higher search engine rankings, and improved conversion rates.<\/p>\n<p><strong>Minify HTML, CSS, and JavaScripts<\/strong><\/p>\n<p>Minification of HTML, CSS, and JavaScript codes involves removing unnecessary characters such as white spaces, comments, and line breaks.<\/p>\n<p>This makes the code smaller and faster to download, resulting in a quicker page load time. By minifying the code, the visitor&#8217;s browser can read and render it faster, resulting in a better user experience.<\/p>\n<p>RabbitLoader offers minification of HTML, CSS, and JavaScript codes as a feature, ensuring that the code served to the visitor is smaller  &hellip;<\/p>\n",
        "faq": "\n<dt id='i%20am%20using%20woocommerce%2C%20will%20rabbitloader%20work%3F'>\nI am using WooCommerce, will RabbitLoader work?\n<\/h4>\n<p>\n<p>Yes, RabbitLoader works well for all content categories be it e-commerce, blog, or a fully dynamic page.<\/p>\n<\/p>\n<dt id='can%20i%20set%20page-rules%20for%20different%20sections%20of%20my%20website%3F'>\nCan I set page-rules for different sections of my website?\n<\/h4>\n<p>\n<p>Yes, if you want to customize the behavior, you can choose the correct content-type while <a href=\"https:\/\/rabbitloader.com\/kb\/setting-page-rules\/\" title=\"Setting up Page Rules\" rel=\"nofollow ugc\">creating page rules<\/a>.<\/p>\n<\/p>\n<dt id='i%20am%20using%20shared%20hosting%2C%20will%20rabbitloader%20work%3F'>\nI am using Shared Hosting, will RabbitLoader work?\n<\/h4>\n<p>\n<p>Yes, RabbitLoader works well for shared, dedicated or VPS hosting irrespective of the hosting type and company except your local environment. Additional details available here if you want to <a href=\"https:\/\/rabbitloader.com\/kb\/trying-staging-environment\/\" title=\"Trying RabbitLoader on a staging environment\" rel=\"nofollow ugc\">try the plugin on pre-production or staging environments<\/a>.<\/p>\n<\/p>\n<dt id='how%20does%20this%20plugin%20work%3F'>\nHow does this plugin work?\n<\/h4>\n<p>\n<p>RabbitLoader makes sure that your Google PageSpeed Insights score is always 100 out of 100.<br \/>\nWe improve FCP by removing render-blocking CSS and JS, reduce server response times, keep request counts low by deferring off screen payloads such as non-visible images.<br \/>\nRabbitLoader can help reducing the FID time by reducing the main thread work and allowing the browser to respond to user actions typically within 50 milliseconds.<br \/>\nWe ensure the LCP element and styles needed are loaded as soon as possible and Render-blocking JS\/CSS are deferred so LCP can render typically within 2.5 seconds.<br \/>\nImages are converted from JPEG\/PNG to Next-Gen AVIF and WebP formats.<br \/>\nWe try to minify and compress all possible assets to the best extent possible.<\/p>\n<\/p>\n<dt id='even%20after%20installing%20rabbitloader%20plugin%2C%20my%20google%20pagespeed%20score%20is%20low.%20why%3F'>\nEven after installing RabbitLoader plugin, my Google PageSpeed score is low. Why?\n<\/h4>\n<p>\n<p>After installing and activating RabbitLoader plugin, you need to connect it with our cloud service by clicking on &#8220;Connect with RabbitLoader&#8221; button on the &#8216;Settings&#8217; tab of the plugin.<\/p>\n<p>Once connected, it may take a few hours to optimize all pages of your website. The status are shown on the &#8216;Home&#8217; tab of the RabbitLoader plugin page URL performance tab too.<\/p>\n<p>If you are running ads program on your website, they can heavily impact the performance. Check <a href=\"https:\/\/rabbitloader.com\/kb\/lazy-loading-of-adsense-ads\/\" title=\"Defer loading ads like AdSense\/AdThrive to increase PageSpeed score\" rel=\"nofollow ugc\">how to defer loading AdSense\/AdThrive<\/a> or other ad networks.<\/p>\n<\/p>\n<dt id='do%20i%20need%20a%20specific%20hardware%20configuration%20for%20my%20server%3F'>\nDo I need a specific hardware configuration for my server?\n<\/h4>\n<p>\n<p>No. The plugin works equally efficient irrespective of the hardware size. All the heavy lifting optimization task is carried out outside your origin, adding no overhead to your CPU\/RAM.<\/p>\n<\/p>\n<dt id='can%20i%20use%20it%20with%20other%20performance%20plugin%3F'>\nCan I use it with other performance plugin?\n<\/h4>\n<p>\n<p>You can use other plugins along with RabbitLoader if their functionalities are not overlapping. Make sure you turn off those features which conflict.<\/p>\n<\/p>\n<dt id='my%20hosting%20service%20uses%20varnish%20cache%3F%20can%20i%20use%20rabbitloader%20with%20it%3F'>\nMy hosting service uses Varnish cache? Can I use RabbitLoader with it?\n<\/h4>\n<p>\n<p>Yes, RabbitLoader is 100% compatible with Varnish cache and works great with it without any additional settings.<\/p>\n<\/p>\n<dt id='how%20can%20i%20report%20security%20bugs%3F'>\nHow can I report security bugs?\n<\/h4>\n<p>\n<p>You can report security bugs through the Patchstack Vulnerability Disclosure Program. The Patchstack team help validate, triage and handle any security vulnerabilities. <a href=\"https:\/\/patchstack.com\/database\/vdp\/rabbit-loader\" rel=\"nofollow ugc\">Report a security vulnerability.<\/a><\/p>\n<\/p>\n\n",
        "changelog": "<h4>2.19.18<\/h4>\n<ul>\n<li>Invalidate cache when Me mode is toggled<\/li>\n<\/ul>\n<h4>2.19.17<\/h4>\n<ul>\n<li>Compatibility improvement for PHP 5.6<\/li>\n<\/ul>\n<h4>2.19.16<\/h4>\n<ul>\n<li>Prevent errors when plugin folder is directly deleted<\/li>\n<li>Performance improvements while saving navigation menus<\/li>\n<\/ul>\n<h4>2.19.15<\/h4>\n<ul>\n<li>Bugfix for admin-ajax sending 403 in some cases<\/li>\n<\/ul>\n<h4>2.19.14<\/h4>\n<ul>\n<li>Bugfix for WordPress installation from a backup<\/li>\n<li>Security patches<\/li>\n<\/ul>\n<h4>2.19.13<\/h4>\n<ul>\n<li>Skip optimizations for search pages<\/li>\n<li>Bite-sized video tutorials available in the Help tab<\/li>\n<li>Enhancements for plugin re-install scenarios<\/li>\n<\/ul>\n<h4>2.19.12<\/h4>\n<ul>\n<li>Bugfix related to feedback request message not hiding <\/li>\n<\/ul>\n<h4>2.19.11<\/h4>\n<ul>\n<li>Enhancements for Nginx users<\/li>\n<\/ul>\n<h4>2.19.10<\/h4>\n<ul>\n<li>Fix for accessing the test version when Me mode is active<\/li>\n<li>Enhancements for Flywheel users<\/li>\n<\/ul>\n<h4>2.19.9<\/h4>\n<ul>\n<li>Enhancements related to refreshing stale cache<\/li>\n<\/ul>\n<h4>2.19.8<\/h4>\n<ul>\n<li>Bugfix for WooCommerce products sorting dropdown change<\/li>\n<li>Cache conflict when plugin is in Me mode<\/li>\n<li>Support for latest WordPress version &#8216;6.3.1&#8217;<\/li>\n<\/ul>\n<h4>2.19.7<\/h4>\n<ul>\n<li>Enhancement related content compression when transferring data<\/li>\n<\/ul>\n<h4>2.19.5, 2.19.6<\/h4>\n<ul>\n<li>Bugfix related to content change detection and cleaning up of stale cache<\/li>\n<\/ul>\n<h4>2.19.4<\/h4>\n<ul>\n<li>Compatibility improvements with WPML (WordPress Multilingual) and AMP plugins<\/li>\n<li>Enhancements for Divi and other Elegant Themes<\/li>\n<\/ul>\n<h4>2.19.3<\/h4>\n<ul>\n<li>Fix for broken Single page purge feature<\/li>\n<li>Compatibility improvements with JetPack menu<\/li>\n<li>Plan usage analytics graph<\/li>\n<\/ul>\n<h4>2.19.2<\/h4>\n<ul>\n<li>Compatibility improvements for PHP versions older than  v7.2<\/li>\n<\/ul>\n<h4>2.19.1<\/h4>\n<ul>\n<li>Improved cache hit ratio<\/li>\n<li>Compatibility fixes for IF-SO plugin<\/li>\n<li>Improved page detection for websites built with Elementor <\/li>\n<\/ul>\n<h4>2.18.9<\/h4>\n<ul>\n<li>Bugfix related to critical CSS not shown correctly in some cases<\/li>\n<\/ul>\n<h4>2.18.8<\/h4>\n<ul>\n<li>Bugfix related to cleaning up of stale cache<\/li>\n<\/ul>\n<h4>2.18.7<\/h4>\n<ul>\n<li>Better handling of expired cache and invalidation<\/li>\n<\/ul>\n<h4>2.18.6<\/h4>\n<ul>\n<li>Compatibility with Hide My WP plugin<\/li>\n<\/ul>\n<h4>2.18.5<\/h4>\n<ul>\n<li>Faster cache cleaning on purge or content changes<\/li>\n<li>Compatibility improvements for PHP versions older than  v7.2<\/li>\n<li>Compatibility with Ajax Search Pro plugin<\/li>\n<\/ul>\n<h4>2.18.4<\/h4>\n<ul>\n<li>Support for Module type JavaScript Script tags<\/li>\n<li>Stability fix of intermittent white screen issues<\/li>\n<\/ul>\n<h4>2.18.x<\/h4>\n<ul>\n<li>CDN coverage and performance improvements<\/li>\n<\/ul>\n<h4>2.17.x<\/h4>\n<ul>\n<li>Security and performance improvements<\/li>\n<\/ul>\n<h4>2.16.x<\/h4>\n<ul>\n<li>Compatibility improvement with other plugins<\/li>\n<\/ul>\n<h4>2.15<\/h4>\n<ul>\n<li>Private mode for testing and debugging<\/li>\n<\/ul>\n<h4>2.14<\/h4>\n<ul>\n<li>Control settings to discard cache<\/li>\n<\/ul>\n<h4>2.13<\/h4>\n<ul>\n<li>More insights on CSS optimization<\/li>\n<\/ul>\n<h4>2.12<\/h4>\n<ul>\n<li>More insights on image optimization<\/li>\n<\/ul>\n<h4>2.11<\/h4>\n<ul>\n<li>Feature to ignore URL parameters<\/li>\n<\/ul>\n<h4>2.10<\/h4>\n<ul>\n<li>Detail reports around CDN bandwidth usage and assets requests served<\/li>\n<\/ul>\n<h4>2.9<\/h4>\n<ul>\n<li>Added URL performance report to easily identify good and bad performing URLs for site owners.<\/li>\n<\/ul>\n<h4>2.8<\/h4>\n<ul>\n<li>Log messages to get more insights on things running under the hood, compatibility enhancements with LightSpeed server<\/li>\n<\/ul>\n<h4>2.7<\/h4>\n<ul>\n<li>Enhancements in detecting new post and post status changes<\/li>\n<\/ul>\n<h4>2.3<\/h4>\n<ul>\n<li>Added purge button on the post preview page<\/li>\n<\/ul>\n<h4>2.1<\/h4>\n<ul>\n<li>Option to exclude URLs from optimization and caching<\/li>\n<\/ul>\n<h4>1.6<\/h4>\n<ul>\n<li>Use of WordPress advance cache for faster response of cached data<\/li>\n<\/ul>\n<h4>1.1<\/h4>\n<ul>\n<li>Automatic handling of optimization and caching<\/li>\n<li>Auto-Purge on website wide activities like theme change, etc<\/li>\n<\/ul>\n<h4>1.0<\/h4>\n<ul>\n<li>First release of the plugin<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-1.jpg?rev=2658337\"><img src=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-1.jpg?rev=2658337\" alt=\"Core features of RabbitLoader\"><\/a><p>Core features of RabbitLoader<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-2.jpg?rev=2520775\"><img src=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-2.jpg?rev=2520775\" alt=\"Home tab of the plugin showing Lighthouse score for your pages based on Google PageSpeed.\"><\/a><p>Home tab of the plugin showing Lighthouse score for your pages based on Google PageSpeed.<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-3.jpg?rev=2520775\"><img src=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-3.jpg?rev=2520775\" alt=\"RabbitLoader account overview page shows best and average Google PageSpeed score for all your pages, cached data usage etc.\"><\/a><p>RabbitLoader account overview page shows best and average Google PageSpeed score for all your pages, cached data usage etc.<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-4.jpg?rev=2695177\"><img src=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-4.jpg?rev=2695177\" alt=\"Usage pattern and hits per day for cached and non-cached resources.\"><\/a><p>Usage pattern and hits per day for cached and non-cached resources.<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-5.jpg?rev=2695177\"><img src=\"https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-5.jpg?rev=2695177\" alt=\"Connect your WordPress website with RabbitLoader account with one click.\"><\/a><p>Connect your WordPress website with RabbitLoader account with one click.<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Awesome plugin that maximized my google pagespeed score!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/rnmartinez\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/5524387b881d12759e7f1717f3d9f671?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/5524387b881d12759e7f1717f3d9f671?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/rnmartinez\/\" class=\"reviewer-name\">rnmartinez<\/a> on <span class=\"review-date\">April 10, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">love this plugin. Good, quick tech support and this realy maximized my fooge pagespeed insights. 5\/5<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great performance and exceptional assistance<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/joenav\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/d50ae38b6d07ce72a0bb21be5c12c9f2?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/d50ae38b6d07ce72a0bb21be5c12c9f2?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/joenav\/\" class=\"reviewer-name\">joenav<\/a> on <span class=\"review-date\">March 14, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I wanted to take a moment to express my sincere gratitude for the exceptional assistance provided in resolving the issue I encountered with the app. Your prompt response, expertise, and dedication to ensuring a seamless experience for users like me are truly commendable.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">The efficiency and speed with which the app optimizes and enhances the loading process have significantly improved the user experience on my site. Thank you, Rabbit Loader,<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Excellent plugin with excellent support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/igorkatusic\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/e4943fdb7ac8deca3d9711299502809a?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/e4943fdb7ac8deca3d9711299502809a?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/igorkatusic\/\" class=\"reviewer-name\">igorkatusic<\/a> on <span class=\"review-date\">January 22, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Speeds up our otherwise fairly heavy WP web to 100% for both mobile and desktop. In those rare instances when it clashes with some other plugin or if we notice a bug, the support responses almost immediately and provide solution in a matter of hours. Highly recommended!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good product<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/esnola\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/e404da8607be252c38a1c9695526c7e4?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/e404da8607be252c38a1c9695526c7e4?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/esnola\/\" class=\"reviewer-name\">Juan Jose Gonzalez <small>(esnola)<\/small><\/a> on <span class=\"review-date\">December 23, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This is a good product for optimization.<br \/>The support has always complied perfectly quickly and efficiently to all the queries I have made.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">DO NOT USE IT<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/blu3manx\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/b5c74472b179d8e4a95d59c5ea36c88b?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/b5c74472b179d8e4a95d59c5ea36c88b?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/blu3manx\/\" class=\"reviewer-name\">blu3manx<\/a> on <span class=\"review-date\">December 15, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I do not recommend rabbitloader. They promise one thing, but they never deliver. I made the mistake of buying from them through appsumo a lifetimedeal subscription that they never honored. Moreover, their arrogance to treat the client leaves something completely to be desired. I've written to them countless times, trying to solve the problem, but obviously I don't have anyone to talk to. Run away from them!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Amazing plugin and support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/puntorosso\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/46d09978dcb1adbc4e5b49262df064e3?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/46d09978dcb1adbc4e5b49262df064e3?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/puntorosso\/\" class=\"reviewer-name\">puntorosso<\/a> on <span class=\"review-date\">August 26, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I gotta give a shoutout to Rabbitloader, they seriously rock! Not only the plugin do more than it promose (all my pages are now A on GTMetrix!!) but their support team is on another level of amazingness. I hit them up with a bunch of questions and they were super quick to respond and help me out. They really know their stuff and went the extra mile to make sure I was taken care of. I gotta say, it’s rare to find such a friendly and helpful support team these days. Rabbitloader, you’ve got my thumbs up! Keep up the awesome work! 🙌🐇<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">a very good support team<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/mariojazz\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/0e985eb8b6236add0c39be9c77772f8f?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/0e985eb8b6236add0c39be9c77772f8f?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/mariojazz\/\" class=\"reviewer-name\">mariojazz<\/a> on <span class=\"review-date\">August 24, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">About a week ago, I had a problem with a web page that was really slow. I contacted the support team, and they responded in less than 24 hours. From then on, the support team started to investigate the issue. In two days, I had it fixed. The issue was that a plugin called “Replace Google Fonts with Bunny Fonts” is incompatible with RabbitLoader. Thanks for your support and quick response.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Buyer Beware - You can never change your email<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/swade2569\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/40e5e2cedc39ee26675bd67d7e2ab953?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/40e5e2cedc39ee26675bd67d7e2ab953?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/swade2569\/\" class=\"reviewer-name\">swade2569<\/a> on <span class=\"review-date\">August 6, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I purchased the RabbitLoader product through AppSumo in Sept 2022. The purchase process and activation were flawless thanks to AppSumo.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">The product worked well enough, even though the UI and the process to add domains was clunky and not very intuitive. The help sections were hard to use and not very informative.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">A serious problem emerged from an entirely unlikely reason. The email that I used to purchase the product was being discontinued so I needed to change it. RabbitLoader refused to change the email. They insisted that AppSumo re-issue an invoice with the changed email. There's nothing automated about that process. Even AppSumo support went above and beyond to try and work with RabbitLoader, but they were absolutely stubborn on this point.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">So I offer a cautionary tale that your investment in this product could be LOST in the event you have to do something as simple, and widely supported by nearly every SaaS product, as to change the email on your account.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Straightforward swiftness<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/ratiocination\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/680aa5c6f4eed91cf69ce49b190f6387?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/680aa5c6f4eed91cf69ce49b190f6387?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/ratiocination\/\" class=\"reviewer-name\">ratiocination<\/a> on <span class=\"review-date\">July 26, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This plugin is super easy to use - you won't believe how straightforward it is! And if you ever have any questions or concerns, the support team is always there to help you. The plugin has all the necessary features to speed up your website without hassle. You'll be amazed at how quickly your site will load!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">This Rabbit is faster and also wins the race!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/nitesh-manav\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/bc1594507dade673a49cbfb82e06af0d?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/bc1594507dade673a49cbfb82e06af0d?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/nitesh-manav\/\" class=\"reviewer-name\">Upstream <small>(Nitesh Manav)<\/small><\/a> on <span class=\"review-date\">July 18, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">I used RabbitLoader WordPress Plugin to optimize my website, and it delivered impressive results. With easy installation and setup, it significantly improved loading speed and performance. The plugin boosted my PageSpeed score, reduced image size by 40%, and minimized CSS files by 98%. It enhanced Core Web Vitals, resulting in better Google rankings and conversions. RabbitLoader replaced multiple optimization plugins effortlessly with features like caching, lazy loading, CDN integration, compression, LQIP, image\/CSS\/JavaScript optimization. Its integrated CDN with 300+ Points of Presence ensured fast content delivery worldwide. The support from the team was excellent. Overall, I highly recommend RabbitLoader for website optimization.\n\n<\/div>\n<\/div>\n"
    },
    "short_description": "RabbitLoader can get up to 100\/100 PageSpeed score for your website, boosting search ranking by making the Core Web Vitals (aka Chrome UX report) heal &hellip;",
    "description": "<p><a href=\"https:\/\/rabbitloader.com\/\" title=\"RabbitLoader\" rel=\"nofollow ugc\">RabbitLoader<\/a> is a CDN cache-based speed optimization plugin that uses caching, CDN, and other techniques to reduce the loading time of WordPress websites. Enabling you to get a perfect score on Google PageSpeed Insights and achieve better SEO rankings.<\/p>\n<p>You would not need 10 different plugins for caching, CDN, HTML, JavaScript, CSS minification, lazy loading of images and videos, image size reduction, AVIF\/WebP conversion, preloading, compression, and so on.<\/p>\n<p>All these optimization plugins overwhelm the admin panel, conflict with each other, and slow down your website. Just install RabbitLoader, and it will optimize the whole website in a few minutes without the need for an expert or a developer.<\/p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/W-jYelvWE0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p><a href=\"https:\/\/rabbitloader.com\/wordpress-crash-course\/\" title=\"PageSpeed optimization crash course videos\" rel=\"nofollow ugc\">Watch bite size tutorial videos<\/a><\/p>\n<p><strong>Highlights<\/strong><\/p>\n<ul>\n<li>Obtain a PageSpeed Score of 95 or higher for all pages.<\/li>\n<li>Reduce image size by 40% with the NextGen AVIF\/WebP format.<\/li>\n<li>Reduce CSS size by 98% automatically.<\/li>\n<li>Improve Core Web Vitals (lower FCP, FID, and CLS).<\/li>\n<li>Higher rankings on Google Search and better conversions.<\/li>\n<li>No coding knowledge is needed.<\/li>\n<li>Replaces 5–10 optimization plugins.<\/li>\n<li>Cache, Lazy Loading, CDN, Compression, Preloading.<\/li>\n<li>Image, CSS, JavaScript Optimization.<\/li>\n<\/ul>\n<p><strong>Benefits of using RabbitLoader:<\/strong><\/p>\n<p><strong>Cache<\/strong><\/p>\n<p>Caching is the process of storing frequently accessed data or assets in a temporary storage space for faster access and retrieval. RabbitLoader does this automatically, and one doesn&#8217;t need to use any separate plugin for caching when using RabbitLoader.<\/p>\n<p>It stores the website&#8217;s assets in the nearest <a href=\"https:\/\/rabbitloader.com\/articles\/category\/caching\/\" title=\"Cache\" rel=\"nofollow ugc\">cache servers<\/a>, which means that the browser does not have to fetch them again from the server, resulting in faster page loads and a better user experience.<\/p>\n<p><strong>CSS and JavaScript Cache<\/strong><\/p>\n<p>All CSS and JavaScript files are cached at CDN servers for a lifetime. This is also referred to as immutable caching because the cached content does not change unless the file version in the URL changes or a full purge is performed.<\/p>\n<p>RabbitLoader improves CSS and JavaScript caching by utilizing browser caching headers. When a browser requests a resource from a server, it can store that resource in its cache, as long as the server provides caching headers that specify how long the resource should be cached.<\/p>\n<p>Overall, RabbitLoader does a better job of caching CSS and JavaScript by leveraging browser caching headers and other techniques. These techniques can significantly improve the performance of a website and enhance the user experience by reducing page load times.<\/p>\n<p><strong>Image Caching<\/strong><\/p>\n<p>Similar to CSS and JavaScript files, images are cached at CDN servers for a lifetime, also known as immutable caching. The cached content never changes unless the file version in the URL changes.<\/p>\n<p>When a user visits a webpage for the first time, their browser downloads all the necessary assets, including images, from the server. The browser stores these images in a cache so that it can access them quickly if the user visits the same webpage again.<\/p>\n<p>RabbitLoader improves image caching by utilizing the browser caching headers, similar to CSS and JavaScript caching. It sets optimal caching headers to ensure that the images are cached for the appropriate amount of time, reducing the number of times the browser has to request them from the server.<\/p>\n<p>RabbitLoader does all this automatically, improving the performance of a website by <a href=\"https:\/\/rabbitloader.com\/articles\/compressing-images-for-the-modern-web\/\" title=\"reducing the load time of images using RabbitLoader\" rel=\"nofollow ugc\">reducing the load time of images<\/a>, resulting in a better user experience.<\/p>\n<p><strong>Browser Cache<\/strong><\/p>\n<p>Browser caching is a technique used to store static assets like HTML pages, CSS and JavaScript files, and images in the user&#8217;s browser cache , allowing the browser to access them quickly if the user visits the same website again.<\/p>\n<p>RabbitLoader automatically ensures that the assets are cached for the right amount of time. This reduces the number of requests the browser makes to the server, reducing the load on the server and improving the overall performance of the website.<\/p>\n<p><strong>Image Optimization<\/strong><\/p>\n<p>Image optimization is the process of reducing the size of an image without compromising its quality. By optimizing images, website owners can reduce the load times of their pages, resulting in a better user experience.<\/p>\n<p>RabbitLoader does this automatically through lossless image conversion to either AVIF or WebP formats, by reducing image size by 40% to 50% on average. It uses various different techniques to optimize images, like lazy loading, compression, etc. These techniques can significantly improve the performance of a website by reducing the load time of images, resulting in a better user experience.<\/p>\n<p><strong>Lazy Loading Images<\/strong><\/p>\n<p>Lazy loading is a technique that loads web content only when it&#8217;s needed. Instead of loading all images on a webpage at once, lazy loading loads images as they come into view. This technique significantly reduces the time it takes for a web page to load by prioritizing the elements that the user can see immediately.<\/p>\n<p>RabbitLoader does this by <a href=\"https:\/\/rabbitloader.com\/kb\/enable-image-auto-conversion-to-webp\/\" title=\"Lazy Load Images using RabbitLoader\" rel=\"nofollow ugc\">lazy loading images<\/a>, along with YouTube and Vimeo videos, Google Maps, and any iframe embedded content. Only below-the-fold images are lazy loaded after all critical resources have finished loading, which keeps your LCP (largest element above the fold) and CLS scores healthy.<\/p>\n<p><strong>NextGen AVIF and WebP Formats<\/strong><\/p>\n<p>The Next-gen AVIF and WebP formats are image formats that uses advanced compression techniques to reduce the size of images while maintaining their quality. These images are up to 30% smaller than JPEG or PNG images, resulting in faster page load times.<\/p>\n<p>RabbitLoader <a href=\"https:\/\/rabbitloader.com\/articles\/next-gen-formats\/\" title=\"convert image to next-gen AVIF\/WebP format\" rel=\"nofollow ugc\">improves the use of next-gen AVIF\/WebP format<\/a> by automatically converting images to the most efficient Next-gen format. RabbitLoader detects the user&#8217;s browser and serves the AVIF\/WebP version of the image if the browser supports it. If the browser does not support the any of the modern format, RabbitLoader serves the original image format. This ensures that the user always receives the best version of the image that their browser supports.<\/p>\n<p><strong>Image Placeholders<\/strong><\/p>\n<p>When images are loaded on a website, they can cause a delay in page loading time, resulting in a poor user experience. To address this issue, many websites use lazy loading techniques that delay the loading of non-critical images until they are needed. This can significantly improve the page loading time, but it can also result in a visual lag or &#8220;layout reflow&#8221; as images load in.<\/p>\n<p>To minimize this issue, RabbitLoader uses inline image placeholders to give the visitors a better experience while waiting for the full-quality image to load.<\/p>\n<p>By using image placeholders, RabbitLoader ensures that the website&#8217;s layout remains intact and does not shift around when images are loaded, leading to a smoother user experience. Additionally, RabbitLoader uses caching to further improve the loading speed of these images, reducing the time required for images to be loaded when a user navigates to a new page or returns to a previously viewed page.<\/p>\n<p>This helps to minimize the visual lag and ensures that visitors have a consistently fast and responsive experience, no matter where they are in the world or what device they are using.<\/p>\n<p><strong>Integrated CDN<\/strong><\/p>\n<p>Integrated CDN is an important feature that RabbitLoader offers, which allows for caching of website content at multiple servers located around the world. RabbitLoader CDN service is integrated with the plugin, and no additional CDN plugin or service is required.<\/p>\n<p>This feature reduces the loading time of a website by serving content from the server nearest to the user, which in turn reduces bounce rates and improves the user experience.<\/p>\n<p>With an integrated CDN, RabbitLoader caches the website assets at multiple locations around the world, ensuring that the content is delivered to the user from the closest server. This reduces the latency and response time, resulting in faster website loading times.<\/p>\n<p>This is especially important for websites with a global audience, as it ensures that visitors from all over the world can access the website quickly and without any delay.<\/p>\n<p><strong>300+ PoP&#8217;s<\/strong><\/p>\n<p>RabbitLoader uses a <a href=\"https:\/\/rabbitloader.com\/origin-savings\/\" title=\"Content Delivery Network\" rel=\"nofollow ugc\">Content Delivery Network<\/a> (CDN) that is distributed throughout the world with over 300 Points of Presence (PoP). This means that no matter where your visitors are located, they can access your website&#8217;s content in milliseconds, resulting in a faster and smoother experience.<\/p>\n<p>This is essential for websites with a global audience, as it ensures that users from all regions can access your website quickly without experiencing any delays. With a distributed network, RabbitLoader is able to provide a faster response time for website content, which can improve user engagement and reduce bounce rates. The CDN&#8217;s wide coverage ensures that the content can be delivered to users from the nearest server, resulting in lower latency and faster loading times.<\/p>\n<p>Moreover, the use of a global CDN can also improve website security by distributing website traffic across multiple servers, reducing the risk of website crashes and distributed denial of service (DDoS) attacks.<\/p>\n<p>Overall, RabbitLoader&#8217;s use of a distributed network with over 300 PoPs offers significant advantages over traditional CDN services and can greatly enhance the performance of your website.<\/p>\n<p><strong>Low Data Transfer Time<\/strong><\/p>\n<p>Low data transfer time refers to the amount of data being transferred between a server and a client during a particular transaction. This could refer to the transfer of any type of data, such as text, images, videos, or other files. A low data transfer means that the amount of data being transferred is minimal, which can result in faster loading times and a better user experience for visitors accessing a website or web application.<\/p>\n<p>Low data transfer time is an important aspect of website performance, especially for users with slow internet connections. RabbitLoader uses the latest content compression algorithm from Cache Memory to minimize data transfer time for visitors on slow networks.<\/p>\n<p>This ensures that visitors can access website content quickly and efficiently, without having to wait for long load times or experience laggy page performance. By reducing data transfer time, RabbitLoader enhances website speed and improves the overall user experience, leading to increased engagement and reduced bounce rates.<\/p>\n<p>This feature is particularly useful for websites that receive a lot of traffic from users on slow or unreliable networks, as it helps to ensure that these visitors can still access the website quickly and easily.<\/p>\n<p><strong>Zero Down Time<\/strong><\/p>\n<p>Zero Down Time refers to the ability of a website to remain accessible to visitors even when the origin server is down. This is a crucial feature for any website that wants to ensure uninterrupted access to its content, products, or services.<\/p>\n<p>RabbitLoader CDN provides Zero Down Time functionality to its users. If the origin server goes down, RabbitLoader&#8217;s CDN cache steps in to serve the website&#8217;s content to visitors. This means that visitors will still be able to access the website&#8217;s content, even if the origin server is offline.<\/p>\n<p>This is a crucial feature for businesses and organizations that rely on their website to generate revenue, as even a short period of downtime can lead to lost sales and revenue. With RabbitLoader, website owners can rest assured that their website will remain accessible to visitors, no matter what happens to the origin server.<\/p>\n<p><strong>CSS Optimization<\/strong><\/p>\n<p>CSS optimization is the process of reducing the file size of CSS files, improving page load speed, and ultimately, the user experience. This is important because CSS is responsible for styling web pages and can become quite large and complex, leading to slower page load times.<\/p>\n<p>RabbitLoader takes care of CSS optimization for both critical and non-critical CSS using CDN cache. By leveraging caching technology, RabbitLoader can significantly reduce the load times of CSS files. Additionally, RabbitLoader optimizes both critical and non-critical CSS files, ensuring that the critical CSS is loaded first for a better user experience.<\/p>\n<p>Optimizing CSS files is an important aspect of improving website performance, and RabbitLoader helps achieve this by automating the process and ensuring that CSS files are cached and optimized for fast loading times.<\/p>\n<p><strong>Critical CSS Rendering<\/strong><\/p>\n<p>Critical CSS rendering is a technique that involves separating the critical CSS code from the non-critical CSS code and loading it first.<\/p>\n<p>This is done to ensure that the website loads quickly and the user can see the above-the-fold content without any delay. Above-the-fold content is the content that a user sees on the screen without having to scroll down.<\/p>\n<p>When a website is loading, the browser has to parse and render all the CSS files before the content can be displayed. This process can be time-consuming, especially if the CSS files are large.<\/p>\n<p>By rendering only the critical CSS, the browser can load the content much faster and improve the overall user experience.<br \/>\nRabbitLoader is designed to optimize critical CSS rendering by automatically detecting and optimizing the critical CSS code. It uses advanced algorithms to identify the critical CSS code and load it first.<\/p>\n<p>This technique helps to minimize render blocking, parsing, and cache misses, which can slow down the website&#8217;s loading speed.<\/p>\n<p><strong>Defer non-critical CSS<\/strong><\/p>\n<p>Defer non-critical CSS is a technique used to improve website loading speed and the overall user experience. As the name suggests, it involves deferring the loading of non-critical CSS until the critical resources have been loaded.<\/p>\n<p>This helps to minimize render blocking, reduce the amount of time it takes for a page to become interactive, and improve the perceived loading speed of the website.<\/p>\n<p>With RabbitLoader, this process is automated and optimized. The <a href=\"https:\/\/rabbitloader.com\/kb\/enable-disable-defer-loading-of-css\/\" title=\"Defer CSS\" rel=\"nofollow ugc\">non-critical CSS is separated<\/a> and deferred to allow the critical resources to load first, and the loading of the non-critical CSS is triggered after the critical resources have been loaded.<\/p>\n<p>This ensures that the website&#8217;s critical content is loaded as quickly as possible, and the non-critical content is loaded in the background without impacting the website&#8217;s performance. By optimizing this process, RabbitLoader helps to improve website speed, reduce bounce rates, and enhance user experience.<\/p>\n<p><strong>Deferring JavaScript<\/strong><\/p>\n<p>Deferring JavaScript refers to delaying the loading of non-critical JavaScript files until after critical resources, such as HTML, CSS, and images, have finished loading. This technique can significantly improve website performance by reducing page load times and enhancing the user experience.<\/p>\n<p>RabbitLoader effectively defers non-critical JavaScript files, especially those from third-party plugins and services, such as pop-ups, analytics, social media buttons, ads, chat widgets, and embedded media.<\/p>\n<p>By doing so, RabbitLoader prioritizes critical resources, allowing them to render faster, which enhances the user experience.<\/p>\n<p>With RabbitLoader, website owners can expect improved website performance, reduced page load times, and better user engagement. By deferring non-critical JavaScript, RabbitLoader ensures that the website loads faster, which leads to better engagement, higher search engine rankings, and improved conversion rates.<\/p>\n<p><strong>Minify HTML, CSS, and JavaScripts<\/strong><\/p>\n<p>Minification of HTML, CSS, and JavaScript codes involves removing unnecessary characters such as white spaces, comments, and line breaks.<\/p>\n<p>This makes the code smaller and faster to download, resulting in a quicker page load time. By minifying the code, the visitor&#8217;s browser can read and render it faster, resulting in a better user experience.<\/p>\n<p>RabbitLoader offers minification of HTML, CSS, and JavaScript codes as a feature, ensuring that the code served to the visitor is smaller  &hellip;<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.18.zip",
    "upgrade_notice": {
        "1.0": "<p>Version 1 is the first release<\/p>\n\n<p>By using the plugin, you agree to the RabbitLoader [Privacy Policy](https:\/\/rabbitloader.com\/privacy\/ &quot;Privacy Policy&quot;) and [Terms](https:\/\/rabbitloader.com\/terms\/ &quot;Terms&quot;).<\/p>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-1.jpg?rev=2658337",
            "caption": "Core features of RabbitLoader"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-2.jpg?rev=2520775",
            "caption": "Home tab of the plugin showing Lighthouse score for your pages based on Google PageSpeed."
        },
        "3": {
            "src": "https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-3.jpg?rev=2520775",
            "caption": "RabbitLoader account overview page shows best and average Google PageSpeed score for all your pages, cached data usage etc."
        },
        "4": {
            "src": "https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-4.jpg?rev=2695177",
            "caption": "Usage pattern and hits per day for cached and non-cached resources."
        },
        "5": {
            "src": "https:\/\/ps.w.org\/rabbit-loader\/assets\/screenshot-5.jpg?rev=2695177",
            "caption": "Connect your WordPress website with RabbitLoader account with one click."
        }
    },
    "tags": {
        "cache": "cache",
        "cdn": "cdn",
        "lazy-loading": "Lazy Loading",
        "performance": "performance",
        "speed-optimization": "speed optimization"
    },
    "stable_tag": "2.19.18",
    "versions": {
        "1.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.0.zip",
        "1.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.1.zip",
        "1.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.2.zip",
        "1.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.3.zip",
        "1.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.4.zip",
        "1.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.5.zip",
        "1.6": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.6.zip",
        "1.7": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.7.zip",
        "1.8": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.8.zip",
        "1.9": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.1.9.zip",
        "2.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.0.zip",
        "2.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.1.zip",
        "2.10.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.0.zip",
        "2.10.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.1.zip",
        "2.10.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.2.zip",
        "2.10.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.3.zip",
        "2.10.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.4.zip",
        "2.10.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.10.5.zip",
        "2.11.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.11.0.zip",
        "2.11.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.11.1.zip",
        "2.12.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.12.0.zip",
        "2.12.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.12.1.zip",
        "2.12.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.12.2.zip",
        "2.12.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.12.3.zip",
        "2.12.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.12.4.zip",
        "2.13.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.13.0.zip",
        "2.13.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.13.1.zip",
        "2.13.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.13.2.zip",
        "2.13.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.13.3.zip",
        "2.13.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.13.4.zip",
        "2.14.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.14.0.zip",
        "2.15.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.15.0.zip",
        "2.15.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.15.1.zip",
        "2.15.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.15.2.zip",
        "2.15.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.15.3.zip",
        "2.15.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.15.4.zip",
        "2.16.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.16.0.zip",
        "2.16.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.16.1.zip",
        "2.16.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.16.2.zip",
        "2.16.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.16.3.zip",
        "2.16.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.16.4.zip",
        "2.17.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.0.zip",
        "2.17.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.1.zip",
        "2.17.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.2.zip",
        "2.17.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.3.zip",
        "2.17.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.4.zip",
        "2.17.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.5.zip",
        "2.17.6": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.6.zip",
        "2.17.7": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.17.7.zip",
        "2.18.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.0.zip",
        "2.18.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.1.zip",
        "2.18.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.2.zip",
        "2.18.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.3.zip",
        "2.18.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.4.zip",
        "2.18.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.5.zip",
        "2.18.6": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.6.zip",
        "2.18.7": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.7.zip",
        "2.18.8": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.8.zip",
        "2.18.9": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.18.9.zip",
        "2.19.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.1.zip",
        "2.19.10": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.10.zip",
        "2.19.11": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.11.zip",
        "2.19.12": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.12.zip",
        "2.19.13": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.13.zip",
        "2.19.14": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.14.zip",
        "2.19.15": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.15.zip",
        "2.19.16": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.16.zip",
        "2.19.17": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.17.zip",
        "2.19.18": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.18.zip",
        "2.19.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.2.zip",
        "2.19.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.3.zip",
        "2.19.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.4.zip",
        "2.19.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.5.zip",
        "2.19.6": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.6.zip",
        "2.19.7": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.7.zip",
        "2.19.8": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.8.zip",
        "2.19.9": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.19.9.zip",
        "2.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.2.zip",
        "2.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.3.zip",
        "2.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.4.zip",
        "2.5": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.5.zip",
        "2.6": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.6.zip",
        "2.7": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.7.zip",
        "2.7.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.7.1.zip",
        "2.7.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.7.2.zip",
        "2.7.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.7.3.zip",
        "2.7.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.7.4.zip",
        "2.8.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.8.0.zip",
        "2.8.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.8.1.zip",
        "2.8.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.8.2.zip",
        "2.8.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.8.3.zip",
        "2.8.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.8.4.zip",
        "2.9.0": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.9.0.zip",
        "2.9.1": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.9.1.zip",
        "2.9.2": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.9.2.zip",
        "2.9.3": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.9.3.zip",
        "2.9.4": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.2.9.4.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/rabbit-loader.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https:\/\/ps.w.org\/rabbit-loader\/assets\/banner-772x250.png?rev=3004296",
        "high": "https:\/\/ps.w.org\/rabbit-loader\/assets\/banner-1544x500.png?rev=3004296"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/rabbit-loader\/assets\/icon.svg?rev=2984534",
        "svg": "https:\/\/ps.w.org\/rabbit-loader\/assets\/icon.svg?rev=2984534"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "rabbit-loader",
            "language": "hi_IN",
            "version": "2.19.18",
            "updated": "2022-03-24 17:54:07",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/rabbit-loader\/2.19.18\/hi_IN.zip"
        },
        {
            "type": "plugin",
            "slug": "rabbit-loader",
            "language": "ru_RU",
            "version": "2.19.18",
            "updated": "2023-05-24 17:47:57",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/rabbit-loader\/2.19.18\/ru_RU.zip"
        }
    ]
}