{
    "name": "FormFlow- Simple Intuitive Drag &amp; Drop Form Builder with Advanced Lead Magic",
    "slug": "simple-form",
    "version": "2.11.1",
    "author": "<a href=\"https:\/\/wpxperties.com\/\">WPXpertise<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/devsabbirahmed\/",
    "contributors": {
        "wpxpertise": {
            "profile": "https:\/\/profiles.wordpress.org\/wpxpertise\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/5ee8ed68e5a119fe22b4cba211cc6450?s=96&d=monsterid&r=g",
            "display_name": "wpxpertise"
        },
        "devsabbirahmed": {
            "profile": "https:\/\/profiles.wordpress.org\/devsabbirahmed\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/d8f953bd4233694f95c777fa8565fdca?s=96&d=monsterid&r=g",
            "display_name": "Sabbir Sam"
        }
    },
    "requires": "5.0",
    "tested": "6.5.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 2,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/simple-form\/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 2120,
    "last_updated": "2024-04-09 6:31am GMT",
    "added": "2022-09-16",
    "homepage": "https:\/\/github.com\/sabbirsam\/Simple-Form\/tree\/free",
    "sections": {
        "description": "<h4>The #1 FormFlow comprehensive Drag &amp; Drop builder and form to social redirection, offering a seamless solution for effortless form building and efficient leads management, complete with social redirection capabilities. Simplify your lead distribution to email, WhatsApp, and Slack Workspaces with ease<\/h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/i1i3CIhV0B8?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p><a href=\"https:\/\/wpxperties.com\/simple-form\/\" rel=\"nofollow ugc\">Website<\/a> | <a href=\"https:\/\/wpxperties.com\/docs-category\/simple-form\" rel=\"nofollow ugc\">Documentations<\/a> | <a href=\"https:\/\/www.youtube.com\/playlist?list=PL4m92NgWQaq5uwDLsGxQ9IiCA_Q7bGx7l\" rel=\"nofollow ugc\">Tutorials<\/a><\/p>\n<p>Visit to observe how the floating form appears on the website. 👁️ <a href=\"https:\/\/wpxperties.com\/simple-form\/\" rel=\"nofollow ugc\">View<\/a><\/p>\n<p>Are you looking for an affordable, simple way to create and manage contact\/lead forms on your WordPress website? There&#8217;s nowhere else to look!<\/p>\n<p>Introducing FormFlow- Simple Intuitive Drag &amp; Drop Form Builder with Advanced Lead Magic is intended to expedite your data collection process and make form creation easier for you. It is the most powerful WordPress form plugin. In addition to contact forms, our drag-and-drop form builder allows you to construct any type of form. Unleash the power of 30+ fields features with easy form creation panel. FormFlow provides an easy-to-use drag-and-drop form designer that allows users to automate forms throughout their WordPress sites.<\/p>\n<p>Dive into FormFlow builder now and seize the opportunity to unlock over 30 premium fields at no cost! These exclusive features, usually requiring purchases on other plugins, are now available to you for free. Enhance your experience, tap into the power of advanced fields without any financial commitment. Elevate your capabilities without straining your budget – it&#8217;s the ultimate way to get more value for less!<\/p>\n<p>It&#8217;s a advanced contact form that lets you easily create forms via the drag-and-drop feature. You can use this form using a shortcode or floating widgets anywhere on your website. Get the leads directly in Slack workspace, even in Mail or store in Database. Its upto you.<\/p>\n<h3>FormFlow Features<\/h3>\n<p>🛠️ <strong>Drag and Drop Form Builder<\/strong> –Creating forms has never been this intuitive. With our drag and drop form builder, you can effortlessly design and customize forms to your heart&#8217;s content. Say goodbye to coding hassles and hello to a seamless form-building experience. Simply drag and drop elements to craft the perfect form that suits your needs.<\/p>\n<p>📋 <strong>Seamless Lead Collection<\/strong> – Gathering leads should be a breeze, and that&#8217;s precisely what we offer. Our plugin allows you to effortlessly collect leads by placing forms anywhere on your website using a simple shortcode or floating widgets. No more struggling with complicated integrations or worrying about where to put your forms – it&#8217;s as easy as copy and paste.<\/p>\n<p>📱 <strong>Redirection to WhatsApp<\/strong> – Now, you can offer your users the convenience of initiating a WhatsApp chat directly from your forms. Whether it&#8217;s for inquiries, support, or quick questions, this feature takes user engagement to a whole new level.<\/p>\n<p>🪄 <strong>Shortcode Magic<\/strong> &#8211; Our simple shortcode integration makes it effortless to place forms wherever you need them on your website. It&#8217;s like magic, but better!<\/p>\n<p>🔗 <strong>Floating Widgets<\/strong>: We understand the importance of user experience, and that&#8217;s why we&#8217;ve added Floating Widgets. These sleek and customizable widgets can be placed anywhere on your website, ensuring that your forms are easily accessible to your visitors at all times. Float your forms strategically to capture leads, gather feedback, or facilitate engagement without disrupting your website&#8217;s flow.<\/p>\n<p>📄 <strong>Contact Form 7 Integration<\/strong>: Experience seamless integration with Contact Form 7, enhancing your outreach capabilities and user engagement like never before. Now, harness the power of Contact Form 7 as a versatile floating form, effortlessly accessible to your users across your website.<\/p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/CEPKakCbf6s?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p>You have the flexibility to customize your forms to align perfectly with your brand identity and specific requirements. Whether it&#8217;s tweaking the design, or tailoring the user experience, the possibilities are endless.<\/p>\n<p>By integrating Contact Form 7 with our FormFlow system, you unlock a wealth of functionalities designed to supercharge your lead generation efforts. Seamlessly collect leads, capture vital user data, WhatsApp redirection, and automated lead management. Capture rich metadata to inform targeted marketing strategies.<\/p>\n<p>🎨 <strong>Easy-Peasy Customization for Stylish Forms<\/strong>: Let your imagination run wild with our super-friendly customization panel. Make your forms truly yours by playing with cool colors, funky designs, and even tweak the header and button text. It&#8217;s like giving your forms a makeover without breaking a sweat!<\/p>\n<p>📧 <strong>Effortless Lead Management via Email Notifications<\/strong>: Receive instant lead notifications directly in your mailbox! Our form builder lets you stay on top of your leads by configuring email notifications. Get real-time updates, making it easy for you to respond promptly to your potential customers.<\/p>\n<p>📊 <strong>Comprehensive Metadata Collection<\/strong>: Go beyond basic form fields and gather detailed metadata about your leads. Our form builder allows you to capture additional contextual information, giving you valuable insights into user behavior. Understand your audience better with comprehensive metadata collection, helping you tailor your offerings to their needs.<\/p>\n<p>📈 <strong>Export Leads in Multiple Formats<\/strong>: Seamlessly export your leads in various formats to suit your needs. Choose from JSON, CSV, PDF, or even print the lead data directly. Our form builder gives you the flexibility to manage your lead data efficiently.<\/p>\n<p>🗄️ <strong>Store Leads in Database<\/strong>: Harness the power of data storage with our built-in database feature. Capture and store leads securely in database, enabling you to revisit and analyze your lead information whenever you need it. The database functionality ensures that you can use the leads for various purposes, whether it&#8217;s sending emails, analyzing trends, or fostering long-term relationships<\/p>\n<p>📄 <strong>Page Break<\/strong>: The &#8220;Page Break&#8221; field is used to create multi-step or multi-page forms. By adding page breaks between different sections, it allows the form to be organized into distinct pages, transforming a long and overwhelming form into a user-friendly, step-by-step process. This makes it easier for users to navigate through the form, enhancing the overall user experience.<\/p>\n<p>🛡️ <strong>Cloudflare Captcha<\/strong>: Integrates Cloudflare&#8217;s captcha feature into the form, providing an additional layer of security by verifying that the user is human. This helps prevent automated bots from submitting the form.<\/p>\n<p>🧮 <strong>Custom Captcha<\/strong>: Implements a custom captcha mechanism where users are required to perform specific arithmetic operations, such as addition, subtraction, multiplication, etc., to validate their submission. This adds an extra layer of human verification.<\/p>\n<p>📝 <strong>E-Signature<\/strong>: Introduces an electronic signature field in the form, allowing users to sign electronically. This is particularly useful for agreements, contracts, or any scenario where a user&#8217;s signature is required. Users can draw or upload their signature using the provided canvas.<\/p>\n<p>🚀 <strong>Slack Workspaces<\/strong>: Slack is a communication tool but now you can use it to collect leads. Unveiling a seamless integration that empowers users to harness the power of Slack webhooks for direct lead collection within their Slack workspace. Streamline your lead management process effortlessly with this innovative feature.<\/p>\n<h3>Here&#8217;s a list of several challenging and unique form fields you can create using &#8220;FormFlow: Intuitive Drag &amp; Drop builder&#8221;.<\/h3>\n<p>📄 <strong>Page Break:<\/strong><br \/>\n<em>Description<\/em>: Organize forms into steps or pages for a better user experience using FormFlow- Intuitive Drag &amp; Drop builder. Divide the form fields into multistep sections with the help of the Form Page Break.<\/p>\n<p>🤖 <strong>Cloudflare Captcha:<\/strong><br \/>\n<em>Description<\/em>: Add Cloudflare CAPTCHA to Your WordPress Forms, add an extra layer of protection to your simple form against bots. Get smooth CAPTCHA-free experiences to form.<\/p>\n<p>🧮 <strong>Custom Captcha:<\/strong><br \/>\n<em>Description<\/em>: Require users to perform simple operations for added human verification. Having a fast and secure form doesn&#8217;t have much complicated setup.<\/p>\n<p>🖋️ <strong>E-Signature:<\/strong><br \/>\n<em>Description<\/em>: FormFlow a simple form plugin that helps you to integrate Electronic Signature for agreements or contracts directly in floating or created form. This E-Signature is an affordable way to get the signatures you want in your form through WordPress.<\/p>\n<p>🕰️ <strong>Date-time Local Field:<\/strong><br \/>\n<em>Description<\/em>: A combined date and time input field without timezone information.<\/p>\n<p>🎨 <strong>Color Field:<\/strong><br \/>\n<em>Description<\/em>: Enables users to choose a color by interacting with a color picker, providing a visually intuitive way to select and display color preferences in the form.<\/p>\n<p>🔗 <strong>URL Input Field:<\/strong><br \/>\n<em>Description<\/em>: Allows users to input and submit URLs, ensuring the accurate capture of website addresses or other online resources in the form.<\/p>\n<p>📧 <strong>Email Input Field:<\/strong><br \/>\n<em>Description<\/em>: Provides a designated space for users to input and validate email addresses, ensuring the collection of accurate and properly formatted email information in the form.<\/p>\n<h3>FormFlow other fields<\/h3>\n<p>🔘 <strong>Toggle Switch<\/strong><br \/>\n📄 <strong>Heading<\/strong><br \/>\n🏷️ <strong>Label<\/strong><br \/>\n🔗 <strong>Links<\/strong><br \/>\n📹 <strong>Video<\/strong><br \/>\n🔊 <strong>Audio<\/strong><br \/>\n🔄 <strong>iFrame<\/strong><br \/>\n📝 <strong>Text Input Field<\/strong><br \/>\n🔢 <strong>Number Input Field<\/strong><br \/>\n🕵️‍♂️ <strong>Hidden Input Field<\/strong><br \/>\n📞 <strong>Telephone Input Field<\/strong><br \/>\n🚀 <strong>Submit Field<\/strong><br \/>\n🛠️ <strong>Button Field<\/strong><br \/>\n🎚️ <strong>Range Input Field<\/strong><br \/>\n🔒 <strong>Password Input Field<\/strong><br \/>\n📸 <strong>Image Field<\/strong><br \/>\n📄 <strong>Text Area Field<\/strong><br \/>\n☑️ <strong>Checkbox<\/strong><br \/>\n🔘 <strong>Radio Button<\/strong><br \/>\n🔄 <strong>Select Dropdown<\/strong><\/p>\n<p><em>Create all mentioned fields with Drag and Drop in a very short time, works across all operating systems including Android, iOS, and macOS. No complex settings are needed.<\/em><\/p>\n<p>Say goodbye to form-building frustrations and hello to FormFlow builder. Create, collect, and conquer with the ultimate form-building solution. Download now and see for yourself why &#8220;FormFlow&#8221; is the preferred choice for savvy website owners like you. Simplify, collect, and thrive with FormFlow<\/p>\n<p>👁️ <a href=\"https:\/\/youtu.be\/i1i3CIhV0B8\" rel=\"nofollow ugc\">View Tutorial<\/a> | | 👩🏼‍💻 <a href=\"https:\/\/wordpress.org\/support\/plugin\/simple-form\/\" rel=\"ugc\">Get Support<\/a><\/p>\n<h3>How to Use<\/h3>\n<p>After activating the plugin navigate to your Admin Dashboard &gt; FormFlow &gt; Form and from there build your required form using drag and drop. Next save it with any form name.<br \/>\nYou will then automatically be redirected to the &#8220;Data&#8221; page, from there you can edit your form or create a form on any of your pages or posts using the shortcode.<\/p>\n",
        "installation": "<ol>\n<li>Upload files to the <code>\/wp-content\/plugins\/simple-form<\/code> directory<\/li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress<\/li>\n<\/ol>\n",
        "changelog": "<h4>2.11.1 – 09 Apr 2024<\/h4>\n<ul>\n<li>Enhancement: Maintain PHPCS and WPCS <\/li>\n<\/ul>\n<h4>2.11.0 – 08 Apr 2024<\/h4>\n<ul>\n<li>Enhancement: Enhanced compatibility to support WordPress 6.5<\/li>\n<li>Fix: Fixed Cross-Site Scripting issues<\/li>\n<\/ul>\n<h4>2.10.0 – 02 Apr 2024<\/h4>\n<ul>\n<li>New: Introduces Contact Form 7 Integration<\/li>\n<li>New: Contact Forms 7 as floating widgets<\/li>\n<li>New: Contact Forms 7 forms for WhatsApp redirection<\/li>\n<li>New: CF7 form leads in Slack<\/li>\n<li>New: Store CF7 leads in Database<\/li>\n<li>New: CTA text and background color<\/li>\n<li>New: Custom widgets Icon<\/li>\n<li>New: Select Widgets Position<\/li>\n<li>New: Form Header text alignment<\/li>\n<li>New: Form Header Font size<\/li>\n<li>New: Form Behavior<\/li>\n<\/ul>\n<h4>2.9.3 – 20 Mar 2024<\/h4>\n<ul>\n<li>Enhancement: Drag and Drop auto updated all the field changes<\/li>\n<li>Enhancement: Shortcode UI and copy button<\/li>\n<\/ul>\n<h4>2.9.2 – 27 Feb 2024<\/h4>\n<ul>\n<li>Fix: Theme compatibility<\/li>\n<\/ul>\n<h4>2.9.1 – 21 Feb 2024<\/h4>\n<ul>\n<li>Fix: Upload Esignature data images to WP media. Previously, E-signature data was not stored as images but as raw data, causing potential complications.<\/li>\n<li>Fix: There were issues with the E-signature functionality, preventing smooth transmission via communication channels like WhatsApp, email, and Slack.<\/li>\n<li>Fix: Users encountered difficulties while attempting to print leads, impacting the overall usability of the system.<\/li>\n<li>Enhancement: To improve the visual appeal and usability of the form builder, we have added icons for different form builder fields.<\/li>\n<li>Enhancement: We have increased the width of the form builder to enhance the overall user experience. So the wider builder interface provides more space for designing and customizing forms, reducing the need for excessive scrolling.<\/li>\n<\/ul>\n<h4>2.9.0 – 20 Feb 2024<\/h4>\n<ul>\n<li>New: Introduces Heading, Label, Links, Video, Audio and iFrame fields <\/li>\n<li>New: Provide free support for Custom Captcha, Cloudflare Captcha, Page break and E-Signature<\/li>\n<li>Enhancement: Touch signature implemented in E-Signature<\/li>\n<\/ul>\n<h4>2.8.1 – 16 Feb 2024<\/h4>\n<ul>\n<li>Enhancement: The Settings UI has been revamped and transitioned to a tab-based structure for improved navigation and maintenance. Each setting now resides on a dedicated tab, streamlining accessibility and management.<\/li>\n<li>Enhancement: The Cloudflare Captcha UI has been seamlessly integrated into the Settings page. Users can now easily verify Captcha and manage other modifications effortlessly through the intuitive drag-and-drop form builder.<\/li>\n<\/ul>\n<h4>2.8.0 – 12 Feb 2024<\/h4>\n<ul>\n<li>New: Send leads to Slack<\/li>\n<\/ul>\n<h4>2.7.0 – 04 Feb 2024<\/h4>\n<ul>\n<li>New: New fields Introduces<\/li>\n<li>New: Multi-step\/Page break form<\/li>\n<li>New: Image support<\/li>\n<li>New: E-Signature <\/li>\n<li>New: Cloudflare Captcha<\/li>\n<li>New: Custom Captcha<\/li>\n<li>Improvement: Form Builder UI Improvement<\/li>\n<\/ul>\n<h4>2.6.0 – 28 JAN 2024<\/h4>\n<ul>\n<li>New: Control over storing leads in Database<\/li>\n<li>New: Collect leads in Mail<\/li>\n<li>New: Collect meta data<\/li>\n<\/ul>\n<h4>2.5.0 – 26 JAN 2024<\/h4>\n<ul>\n<li>New: Form customization preview <\/li>\n<li>New: Export Leads as JSON, CSV, PDF and new Print option<\/li>\n<li>New: Add freemius<\/li>\n<li>Improvement: Settings UI Improvement<\/li>\n<li>Improvement: Enhanced form responsive issues<\/li>\n<\/ul>\n<h4>2.4.5 – 06 JAN 2024<\/h4>\n<ul>\n<li>Fix: Fix widgets and form not submitting<\/li>\n<\/ul>\n<h4>2.4.4 – 05 JAN 2024<\/h4>\n<ul>\n<li>Fix: Missing file added <\/li>\n<\/ul>\n<h4>2.4.3 – 03 JAN 2024<\/h4>\n<ul>\n<li>Fix: Theme compatibility<\/li>\n<li>Fix: Settings page value update Issues<\/li>\n<\/ul>\n<h4>2.4.2 – 01 JAN 2024<\/h4>\n<ul>\n<li>Fix: Minor bug fixes for compatibility issues<\/li>\n<\/ul>\n<h4>2.4.1 – 26 NOV 2024<\/h4>\n<ul>\n<li>Fix: Fixed form not sending error<\/li>\n<\/ul>\n<h4>2.4.0 – 25 NOV 2024<\/h4>\n<ul>\n<li>New: Leads page UI improvement<\/li>\n<li>Fix: Fixed null value error not showing the form leads<\/li>\n<li>Fix: Fixed widgets form custom color issues<\/li>\n<\/ul>\n<h4>2.3.0 – 20 NOV 2024<\/h4>\n<ul>\n<li>New: Widgets more customization options add<\/li>\n<li>Fix: Fix widgets and form not loading without login bugs<\/li>\n<\/ul>\n<h4>2.2.6 – 17 NOV 2023<\/h4>\n<ul>\n<li>Fix: Fix minor bugs<\/li>\n<\/ul>\n<h4>2.2.5 – 10 NOV 2023<\/h4>\n<ul>\n<li>Improvement: Enhanced compatibility to support WordPress 6.4<\/li>\n<\/ul>\n<p>= 2.2.4 &#8211; 22 OCT 2023<br \/>\n* Fix: Minor bug fixes for compatibility issues<\/p>\n<h4>2.2.3 &#8211; 04 OCT 2023<\/h4>\n<ul>\n<li>Fix: Fix delete uniqueId error<\/li>\n<\/ul>\n<h4>2.2.2 &#8211; 03 OCT 2023<\/h4>\n<ul>\n<li>New: UI Improvement<\/li>\n<\/ul>\n<h4>2.2.1 &#8211; 03 OCT 2023<\/h4>\n<ul>\n<li>New: Improvement Canvas editor side panel<\/li>\n<\/ul>\n<h4>2.2.0 &#8211; 23 SEP 2023<\/h4>\n<ul>\n<li>New: Add design panel<\/li>\n<li>New: Form customization feature<\/li>\n<li>New: WPCS 3.0 compatibility<\/li>\n<\/ul>\n<h4>2.1.7 &#8211; 22 SEP 2023<\/h4>\n<ul>\n<li>Fix: Fix position of required text<\/li>\n<\/ul>\n<h4>2.1.6 &#8211; 21 SEP 2023<\/h4>\n<ul>\n<li>Fix: Add validation in form submission<\/li>\n<li>Fix: Minor UI improve<\/li>\n<li>Fix: Code clean and refactor<\/li>\n<\/ul>\n<h4>2.1.5 &#8211; 20 SEP 2023<\/h4>\n<ul>\n<li>Fix: Fix floating Widgets not working in testWP site<\/li>\n<\/ul>\n<h4>2.1.4 &#8211; 12 SEP 2023<\/h4>\n<ul>\n<li>Fix: Assets loading problem fix<\/li>\n<\/ul>\n<h4>2.1.3 &#8211; 28 AUG 2023<\/h4>\n<ul>\n<li>Fix: Desin update<\/li>\n<\/ul>\n<h4>2.1.2 &#8211; 27 AUG 2023<\/h4>\n<ul>\n<li>Fix: Console error fix with JS loading error<\/li>\n<\/ul>\n<h4>2.1.1 &#8211; 14 AUG 2023<\/h4>\n<ul>\n<li>Fix: Floating widgets design <\/li>\n<\/ul>\n<h4>2.1.0 &#8211; 20 AUG 2023<\/h4>\n<ul>\n<li>New: Improvement FormFlow settings panel<\/li>\n<li>New: Floating widgets<\/li>\n<li>New: WhatsApp redirection<\/li>\n<\/ul>\n<h4>2.0.4 &#8211; 15 AUG 2023<\/h4>\n<ul>\n<li>New: Add details view of modal<\/li>\n<li>Improvement: Leads page view<\/li>\n<li>Fix: leds break when field added<\/li>\n<\/ul>\n<h4>2.0.3 &#8211; 01 AUG 2023<\/h4>\n<ul>\n<li>New: Elementor support<\/li>\n<li>Improvement: Add required, toggle and form validation<\/li>\n<li>Fix: Form design<\/li>\n<\/ul>\n<h4>2.0.2 &#8211; 29 JULY 2023<\/h4>\n<ul>\n<li>Improvement: Add guide video<\/li>\n<\/ul>\n<h4>2.0.1 &#8211; 26 MAY 2023<\/h4>\n<ul>\n<li>Fix: Menu selection <\/li>\n<li>Improvement: WordPress 6.3 Compatible<\/li>\n<\/ul>\n<h4>2.0.0 &#8211; 31 MAR 2023<\/h4>\n<ul>\n<li>Improvement: Revamp version with latest technology<\/li>\n<\/ul>\n<h4>1.0.2 &#8211; 11 FEB 2023<\/h4>\n<ul>\n<li>Fix: Fix minor bugs.<\/li>\n<\/ul>\n<h4>1.0.1 &#8211; 28 JAN 2023<\/h4>\n<ul>\n<li>Fix: Minor bug fixes for compatibility issues.<\/li>\n<li>Fix: Icon update.<\/li>\n<\/ul>\n<h4>1.0.0 &#8211; 28 DEC 2022<\/h4>\n<ul>\n<li>Inital commit of plugin<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-1.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-1.png?rev=3055091\" alt=\"Form Dashboard\"><\/a><p>Form Dashboard<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-2.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-2.png?rev=3055091\" alt=\"Form Builder- Advance Drag &amp; Drop\"><\/a><p>Form Builder- Advance Drag &amp; Drop<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-3.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-3.png?rev=3055091\" alt=\"Leads view page\"><\/a><p>Leads view page<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-4.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-4.png?rev=3055091\" alt=\"Meta-data view page\"><\/a><p>Meta-data view page<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-5.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/screenshot-5.png?rev=3055091\" alt=\"Settings\/Customization Page\"><\/a><p>Settings\/Customization Page<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-6.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-6.png?rev=3055091\" alt=\"Floating Widgets\"><\/a><p>Floating Widgets<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-7.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-7.png?rev=3055091\" alt=\"Floating Form\"><\/a><p>Floating Form<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-8.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-8.png?rev=3055091\" alt=\"Form submission\"><\/a><p>Form submission<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-9.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-9.png?rev=3055091\" alt=\"Multi-step form\"><\/a><p>Multi-step form<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-10.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-10.png?rev=3055091\" alt=\"Collect leads into Mail\"><\/a><p>Collect leads into Mail<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-11.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-11.png?rev=3055091\" alt=\"WhatsApp redirection\"><\/a><p>WhatsApp redirection<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-12.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-12.png?rev=3055091\" alt=\"Form field preview\"><\/a><p>Form field preview<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-13.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-13.png?rev=3055091\" alt=\"Collect leads in Slack WorkSpace\"><\/a><p>Collect leads in Slack WorkSpace<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-14.png?rev=3055091\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-14.png?rev=3055091\" alt=\"Easy Cloudflare Captch setup\"><\/a><p>Easy Cloudflare Captch setup<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-15.png?rev=3062233\"><img src=\"https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-15.png?rev=3062233\" alt=\"Contact Form 7 setup\"><\/a><p>Contact Form 7 setup<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Efficient Form Building Made Simple!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/zalishmahmud6\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/33ba1ab96a8200f2d8aea406e0415271?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/33ba1ab96a8200f2d8aea406e0415271?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/zalishmahmud6\/\" class=\"reviewer-name\">zalish.shawon <small>(zalishmahmud6)<\/small><\/a> on <span class=\"review-date\">February 17, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Hey there! I recently came across the Simple Form Plugin and I just had to share my experience with you. It's an absolute lifesaver for anyone needing to create forms quickly and easily. The drag-and-drop interface is incredibly intuitive, making the whole process a breeze. Plus, the lead collection feature is seamless, helping me gather valuable contacts effortlessly. And let's not forget about the social media redirection after form submission – it's a fantastic way to drive engagement. Trust me, this plugin is a must-have!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">sending leads to slack making it comparable to some of the best plugins in the m<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/michaelbarnettii\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/c909d85d15b948462785629498a39b7b?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/c909d85d15b948462785629498a39b7b?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/michaelbarnettii\/\" class=\"reviewer-name\">michaelbarnettii<\/a> on <span class=\"review-date\">February 16, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">After a while, I tried another plugin from the same author and was impressed, particularly with the user-friendly floating widgets and leads send to slack features. Most of the features, including many fields, are available for free, making it a great choice.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "FormFlow- Experience revolutionize Form Building with intuitive drag-and-drop builder.",
    "description": "<h4>The #1 FormFlow comprehensive Drag &amp; Drop builder and form to social redirection, offering a seamless solution for effortless form building and efficient leads management, complete with social redirection capabilities. Simplify your lead distribution to email, WhatsApp, and Slack Workspaces with ease<\/h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/i1i3CIhV0B8?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p><a href=\"https:\/\/wpxperties.com\/simple-form\/\" rel=\"nofollow ugc\">Website<\/a> | <a href=\"https:\/\/wpxperties.com\/docs-category\/simple-form\" rel=\"nofollow ugc\">Documentations<\/a> | <a href=\"https:\/\/www.youtube.com\/playlist?list=PL4m92NgWQaq5uwDLsGxQ9IiCA_Q7bGx7l\" rel=\"nofollow ugc\">Tutorials<\/a><\/p>\n<p>Visit to observe how the floating form appears on the website. 👁️ <a href=\"https:\/\/wpxperties.com\/simple-form\/\" rel=\"nofollow ugc\">View<\/a><\/p>\n<p>Are you looking for an affordable, simple way to create and manage contact\/lead forms on your WordPress website? There&#8217;s nowhere else to look!<\/p>\n<p>Introducing FormFlow- Simple Intuitive Drag &amp; Drop Form Builder with Advanced Lead Magic is intended to expedite your data collection process and make form creation easier for you. It is the most powerful WordPress form plugin. In addition to contact forms, our drag-and-drop form builder allows you to construct any type of form. Unleash the power of 30+ fields features with easy form creation panel. FormFlow provides an easy-to-use drag-and-drop form designer that allows users to automate forms throughout their WordPress sites.<\/p>\n<p>Dive into FormFlow builder now and seize the opportunity to unlock over 30 premium fields at no cost! These exclusive features, usually requiring purchases on other plugins, are now available to you for free. Enhance your experience, tap into the power of advanced fields without any financial commitment. Elevate your capabilities without straining your budget – it&#8217;s the ultimate way to get more value for less!<\/p>\n<p>It&#8217;s a advanced contact form that lets you easily create forms via the drag-and-drop feature. You can use this form using a shortcode or floating widgets anywhere on your website. Get the leads directly in Slack workspace, even in Mail or store in Database. Its upto you.<\/p>\n<h3>FormFlow Features<\/h3>\n<p>🛠️ <strong>Drag and Drop Form Builder<\/strong> –Creating forms has never been this intuitive. With our drag and drop form builder, you can effortlessly design and customize forms to your heart&#8217;s content. Say goodbye to coding hassles and hello to a seamless form-building experience. Simply drag and drop elements to craft the perfect form that suits your needs.<\/p>\n<p>📋 <strong>Seamless Lead Collection<\/strong> – Gathering leads should be a breeze, and that&#8217;s precisely what we offer. Our plugin allows you to effortlessly collect leads by placing forms anywhere on your website using a simple shortcode or floating widgets. No more struggling with complicated integrations or worrying about where to put your forms – it&#8217;s as easy as copy and paste.<\/p>\n<p>📱 <strong>Redirection to WhatsApp<\/strong> – Now, you can offer your users the convenience of initiating a WhatsApp chat directly from your forms. Whether it&#8217;s for inquiries, support, or quick questions, this feature takes user engagement to a whole new level.<\/p>\n<p>🪄 <strong>Shortcode Magic<\/strong> &#8211; Our simple shortcode integration makes it effortless to place forms wherever you need them on your website. It&#8217;s like magic, but better!<\/p>\n<p>🔗 <strong>Floating Widgets<\/strong>: We understand the importance of user experience, and that&#8217;s why we&#8217;ve added Floating Widgets. These sleek and customizable widgets can be placed anywhere on your website, ensuring that your forms are easily accessible to your visitors at all times. Float your forms strategically to capture leads, gather feedback, or facilitate engagement without disrupting your website&#8217;s flow.<\/p>\n<p>📄 <strong>Contact Form 7 Integration<\/strong>: Experience seamless integration with Contact Form 7, enhancing your outreach capabilities and user engagement like never before. Now, harness the power of Contact Form 7 as a versatile floating form, effortlessly accessible to your users across your website.<\/p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/CEPKakCbf6s?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span>\n<p>You have the flexibility to customize your forms to align perfectly with your brand identity and specific requirements. Whether it&#8217;s tweaking the design, or tailoring the user experience, the possibilities are endless.<\/p>\n<p>By integrating Contact Form 7 with our FormFlow system, you unlock a wealth of functionalities designed to supercharge your lead generation efforts. Seamlessly collect leads, capture vital user data, WhatsApp redirection, and automated lead management. Capture rich metadata to inform targeted marketing strategies.<\/p>\n<p>🎨 <strong>Easy-Peasy Customization for Stylish Forms<\/strong>: Let your imagination run wild with our super-friendly customization panel. Make your forms truly yours by playing with cool colors, funky designs, and even tweak the header and button text. It&#8217;s like giving your forms a makeover without breaking a sweat!<\/p>\n<p>📧 <strong>Effortless Lead Management via Email Notifications<\/strong>: Receive instant lead notifications directly in your mailbox! Our form builder lets you stay on top of your leads by configuring email notifications. Get real-time updates, making it easy for you to respond promptly to your potential customers.<\/p>\n<p>📊 <strong>Comprehensive Metadata Collection<\/strong>: Go beyond basic form fields and gather detailed metadata about your leads. Our form builder allows you to capture additional contextual information, giving you valuable insights into user behavior. Understand your audience better with comprehensive metadata collection, helping you tailor your offerings to their needs.<\/p>\n<p>📈 <strong>Export Leads in Multiple Formats<\/strong>: Seamlessly export your leads in various formats to suit your needs. Choose from JSON, CSV, PDF, or even print the lead data directly. Our form builder gives you the flexibility to manage your lead data efficiently.<\/p>\n<p>🗄️ <strong>Store Leads in Database<\/strong>: Harness the power of data storage with our built-in database feature. Capture and store leads securely in database, enabling you to revisit and analyze your lead information whenever you need it. The database functionality ensures that you can use the leads for various purposes, whether it&#8217;s sending emails, analyzing trends, or fostering long-term relationships<\/p>\n<p>📄 <strong>Page Break<\/strong>: The &#8220;Page Break&#8221; field is used to create multi-step or multi-page forms. By adding page breaks between different sections, it allows the form to be organized into distinct pages, transforming a long and overwhelming form into a user-friendly, step-by-step process. This makes it easier for users to navigate through the form, enhancing the overall user experience.<\/p>\n<p>🛡️ <strong>Cloudflare Captcha<\/strong>: Integrates Cloudflare&#8217;s captcha feature into the form, providing an additional layer of security by verifying that the user is human. This helps prevent automated bots from submitting the form.<\/p>\n<p>🧮 <strong>Custom Captcha<\/strong>: Implements a custom captcha mechanism where users are required to perform specific arithmetic operations, such as addition, subtraction, multiplication, etc., to validate their submission. This adds an extra layer of human verification.<\/p>\n<p>📝 <strong>E-Signature<\/strong>: Introduces an electronic signature field in the form, allowing users to sign electronically. This is particularly useful for agreements, contracts, or any scenario where a user&#8217;s signature is required. Users can draw or upload their signature using the provided canvas.<\/p>\n<p>🚀 <strong>Slack Workspaces<\/strong>: Slack is a communication tool but now you can use it to collect leads. Unveiling a seamless integration that empowers users to harness the power of Slack webhooks for direct lead collection within their Slack workspace. Streamline your lead management process effortlessly with this innovative feature.<\/p>\n<h3>Here&#8217;s a list of several challenging and unique form fields you can create using &#8220;FormFlow: Intuitive Drag &amp; Drop builder&#8221;.<\/h3>\n<p>📄 <strong>Page Break:<\/strong><br \/>\n<em>Description<\/em>: Organize forms into steps or pages for a better user experience using FormFlow- Intuitive Drag &amp; Drop builder. Divide the form fields into multistep sections with the help of the Form Page Break.<\/p>\n<p>🤖 <strong>Cloudflare Captcha:<\/strong><br \/>\n<em>Description<\/em>: Add Cloudflare CAPTCHA to Your WordPress Forms, add an extra layer of protection to your simple form against bots. Get smooth CAPTCHA-free experiences to form.<\/p>\n<p>🧮 <strong>Custom Captcha:<\/strong><br \/>\n<em>Description<\/em>: Require users to perform simple operations for added human verification. Having a fast and secure form doesn&#8217;t have much complicated setup.<\/p>\n<p>🖋️ <strong>E-Signature:<\/strong><br \/>\n<em>Description<\/em>: FormFlow a simple form plugin that helps you to integrate Electronic Signature for agreements or contracts directly in floating or created form. This E-Signature is an affordable way to get the signatures you want in your form through WordPress.<\/p>\n<p>🕰️ <strong>Date-time Local Field:<\/strong><br \/>\n<em>Description<\/em>: A combined date and time input field without timezone information.<\/p>\n<p>🎨 <strong>Color Field:<\/strong><br \/>\n<em>Description<\/em>: Enables users to choose a color by interacting with a color picker, providing a visually intuitive way to select and display color preferences in the form.<\/p>\n<p>🔗 <strong>URL Input Field:<\/strong><br \/>\n<em>Description<\/em>: Allows users to input and submit URLs, ensuring the accurate capture of website addresses or other online resources in the form.<\/p>\n<p>📧 <strong>Email Input Field:<\/strong><br \/>\n<em>Description<\/em>: Provides a designated space for users to input and validate email addresses, ensuring the collection of accurate and properly formatted email information in the form.<\/p>\n<h3>FormFlow other fields<\/h3>\n<p>🔘 <strong>Toggle Switch<\/strong><br \/>\n📄 <strong>Heading<\/strong><br \/>\n🏷️ <strong>Label<\/strong><br \/>\n🔗 <strong>Links<\/strong><br \/>\n📹 <strong>Video<\/strong><br \/>\n🔊 <strong>Audio<\/strong><br \/>\n🔄 <strong>iFrame<\/strong><br \/>\n📝 <strong>Text Input Field<\/strong><br \/>\n🔢 <strong>Number Input Field<\/strong><br \/>\n🕵️‍♂️ <strong>Hidden Input Field<\/strong><br \/>\n📞 <strong>Telephone Input Field<\/strong><br \/>\n🚀 <strong>Submit Field<\/strong><br \/>\n🛠️ <strong>Button Field<\/strong><br \/>\n🎚️ <strong>Range Input Field<\/strong><br \/>\n🔒 <strong>Password Input Field<\/strong><br \/>\n📸 <strong>Image Field<\/strong><br \/>\n📄 <strong>Text Area Field<\/strong><br \/>\n☑️ <strong>Checkbox<\/strong><br \/>\n🔘 <strong>Radio Button<\/strong><br \/>\n🔄 <strong>Select Dropdown<\/strong><\/p>\n<p><em>Create all mentioned fields with Drag and Drop in a very short time, works across all operating systems including Android, iOS, and macOS. No complex settings are needed.<\/em><\/p>\n<p>Say goodbye to form-building frustrations and hello to FormFlow builder. Create, collect, and conquer with the ultimate form-building solution. Download now and see for yourself why &#8220;FormFlow&#8221; is the preferred choice for savvy website owners like you. Simplify, collect, and thrive with FormFlow<\/p>\n<p>👁️ <a href=\"https:\/\/youtu.be\/i1i3CIhV0B8\" rel=\"nofollow ugc\">View Tutorial<\/a> | | 👩🏼‍💻 <a href=\"https:\/\/wordpress.org\/support\/plugin\/simple-form\/\" rel=\"ugc\">Get Support<\/a><\/p>\n<h3>How to Use<\/h3>\n<p>After activating the plugin navigate to your Admin Dashboard &gt; FormFlow &gt; Form and from there build your required form using drag and drop. Next save it with any form name.<br \/>\nYou will then automatically be redirected to the &#8220;Data&#8221; page, from there you can edit your form or create a form on any of your pages or posts using the shortcode.<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.11.1.zip",
    "upgrade_notice": [],
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/screenshot-1.png?rev=3055091",
            "caption": "Form Dashboard"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/screenshot-2.png?rev=3055091",
            "caption": "Form Builder- Advance Drag &amp; Drop"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/screenshot-3.png?rev=3055091",
            "caption": "Leads view page"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/screenshot-4.png?rev=3055091",
            "caption": "Meta-data view page"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/screenshot-5.png?rev=3055091",
            "caption": "Settings\/Customization Page"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-6.png?rev=3055091",
            "caption": "Floating Widgets"
        },
        "7": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-7.png?rev=3055091",
            "caption": "Floating Form"
        },
        "8": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-8.png?rev=3055091",
            "caption": "Form submission"
        },
        "9": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-9.png?rev=3055091",
            "caption": "Multi-step form"
        },
        "10": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-10.png?rev=3055091",
            "caption": "Collect leads into Mail"
        },
        "11": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-11.png?rev=3055091",
            "caption": "WhatsApp redirection"
        },
        "12": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-12.png?rev=3055091",
            "caption": "Form field preview"
        },
        "13": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-13.png?rev=3055091",
            "caption": "Collect leads in Slack WorkSpace"
        },
        "14": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-14.png?rev=3055091",
            "caption": "Easy Cloudflare Captch setup"
        },
        "15": {
            "src": "https:\/\/ps.w.org\/simple-form\/assets\/Screenshot-15.png?rev=3062233",
            "caption": "Contact Form 7 setup"
        }
    },
    "tags": {
        "captcha": "captcha",
        "cf7": "cf7",
        "esignature": "esignature",
        "form-builder": "form builder",
        "formflow": "formflow"
    },
    "stable_tag": "2.11.1",
    "versions": {
        "1.0.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.1.0.0.zip",
        "2.0.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.0.0.zip",
        "2.10.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.10.0.zip",
        "2.11.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.11.0.zip",
        "2.11.1": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.11.1.zip",
        "2.4.1": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.4.1.zip",
        "2.4.2": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.4.2.zip",
        "2.4.3": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.4.3.zip",
        "2.4.4": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.4.4.zip",
        "2.4.5": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.4.5.zip",
        "2.5.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.5.0.zip",
        "2.6.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.6.0.zip",
        "2.7.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.7.0.zip",
        "2.8.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.8.0.zip",
        "2.8.1": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.8.1.zip",
        "2.9.0": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.9.0.zip",
        "2.9.1": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.9.1.zip",
        "2.9.2": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.9.2.zip",
        "2.9.3": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.2.9.3.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/simple-form.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https:\/\/ps.w.org\/simple-form\/assets\/banner-772x250.png?rev=3055091",
        "high": "https:\/\/ps.w.org\/simple-form\/assets\/banner-1544x500.png?rev=3055091"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/simple-form\/assets\/icon-128x128.gif?rev=3055091",
        "2x": "https:\/\/ps.w.org\/simple-form\/assets\/icon-256x256.gif?rev=3055091"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}