{
    "name": "HuCommerce | Magyar WooCommerce kiegészítések",
    "slug": "surbma-magyar-woocommerce",
    "version": "2023.3.1",
    "author": "<a href=\"https:\/\/www.hucommerce.hu\/\">HuCommerce.hu<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/surbma\/",
    "contributors": {
        "surbma": {
            "profile": "https:\/\/profiles.wordpress.org\/surbma\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/c2c7e691f75759e242ad268e0db85d0a?s=96&d=monsterid&r=g",
            "display_name": "Surbma"
        },
        "xnagyg": {
            "profile": "https:\/\/profiles.wordpress.org\/xnagyg\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/29e47dd8393415dbb56bf6b4e65d0a4d?s=96&d=monsterid&r=g",
            "display_name": "xnagyg"
        }
    },
    "requires": "5.3",
    "tested": "6.4.4",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 29,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 29,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/surbma-magyar-woocommerce\/",
    "support_threads": 2,
    "support_threads_resolved": 1,
    "active_installs": 10000,
    "downloaded": 136542,
    "last_updated": "2024-02-12 8:27am GMT",
    "added": "2017-10-11",
    "homepage": "https:\/\/www.hucommerce.hu\/",
    "sections": {
        "description": "<blockquote>\n<p>Hasznos javítások a magyar WooCommerce webáruházakhoz.<\/p>\n<\/blockquote>\n<p>A WooCommerce a világ és most már Magyarország legnépszerűbb webáruház platformja is. A HuCommerce kiegészítővel könnyebben és gyorsabban indíthatod a webáruházad, mert a legtöbb fontos funkciót és fejlesztést egy gombnyomással helyettesítheted.<\/p>\n<p>A HuCommerce bővítmény ingyenes változata most már évek óta a magyar WooCommerce webáruház tulajdonosok kedvenc kiegészítője. Több, mint 10000 webáruházban megtalálható és a letöltések száma folyamatosan nő.<\/p>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.<\/p>\n<p>A HuCommerce ingyenes verziója rengeteg olyan apró, hasznos vagy akár jogilag kötelező funkciót tartalmaz, ami hiányzik a WooCommerce bővítményből. Többek között rendbe teszi a vezetéknév és keresztnév sorrendjét és az adószám mezőt is hozzáadja a pénztárhoz, de folyamatosan bővül hasonló praktikus, hasznos vagy kötelező funkciókkal.<\/p>\n<p>A HuCommerce Pro előfizetés éves díja egy kezdő magyar fejlesztő pár órás munkadíja, miközben neked napokat vagy akár hónapokat spórol meg fejlesztési és kutatási oldalon. Ez a kiegészítő a leghasznosabb és nélkülözhetetlen funkciókkal egészíti ki a webáruházad. A fizetős konstrukció biztosítja, hogy folyamatosan bővüljön újabb hasznos funkciókkal.<\/p>\n<p>A funkciók folyamatosan bővülnek, de mindenki megírhatja a véleményét, ötletét, hogyan tudjuk egyre jobbá tenni ezt a bővítményt.<\/p>\n<h4>HuCommerce támogatói Facebook csoport<\/h4>\n<p>Csatlakozzatok a HuCommerce hivatalos támogatói Facebook csoportjához, ahol lehet a bővítménnyel kapcsolatban kérdezni, beszélgetni, ötletelni. Mindenkit szívesen látunk: <a href=\"https:\/\/www.facebook.com\/groups\/HuCommerce.hu\/\" rel=\"nofollow ugc\">HuCommerce Facebook csoport<\/a><\/p>\n<h3>HuCommerce (ingyenes)<\/h3>\n<p>Több, mint 10000 webáruház tulajdonos választása Magyarországon. Rengeteg hasznos funkció, kötelező választás minden magyar WooCommerce webáruházhoz.<\/p>\n<p><a href=\"https:\/\/www.hucommerce.hu\/bovitmenyek\/hucommerce\/\" rel=\"nofollow ugc\">Bővebben a HuCommerce bővítményről →<\/a><\/p>\n<p><strong>HuCommerce ingyenes funkciói:<\/strong><\/p>\n<ul>\n<li>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)<\/li>\n<li>Adószám bekérése vásárlásnál<\/li>\n<li>Megye mező elrejtése<\/li>\n<li>Város automatikus kitöltése az irányítószám alapján<\/li>\n<li>Pénztár oldal módosítások<\/li>\n<li>Kupon mező módosítások<\/li>\n<li>Plusz\/minusz mennyiségi gombok a termékekhez<\/li>\n<li>Automatikus frissítés a Kosár oldalon<\/li>\n<li>Egy termék vásárlásonként<\/li>\n<li>Kosár átirányítása a Pénztár oldalra<\/li>\n<li>Vásárlás folytatása gomb megjelenítése a Kosár és\/vagy a Pénztár oldalakon<\/li>\n<li>Belépés és regisztráció utáni átirányítás<\/li>\n<li>Szállítási módok elrejtése<\/li>\n<li>Egyedi “Kosárba teszem” gombok<\/li>\n<li>Termék extra beállítások<\/li>\n<li>SMTP szolgáltatás beállítása<\/li>\n<li>Katalógus mód<\/li>\n<li>Fordítási hiányosságok javítása<\/li>\n<li>WPML és Polylang kompatibilitás<\/li>\n<li>Alap ügyfélszolgálat és támogatás<\/li>\n<li>További funkciók hamarosan…<\/li>\n<\/ul>\n<h3>HuCommerce Pro (fizetős)<\/h3>\n<p>A HuCommerce kibővített kiadása, további hasznos és folyamatosan bővülő funkciókkal. Támogatói verzió, amivel te is hozzájárulsz a további fejlesztésekhez.<\/p>\n<p><a href=\"https:\/\/www.hucommerce.hu\/bovitmenyek\/hucommerce\/\" rel=\"nofollow ugc\">Bővebben a HuCommerce Pro bővítményről →<\/a><\/p>\n<blockquote>\n<p><a href=\"https:\/\/www.hucommerce.hu\/hc\/hirlevel-feliratkozas\/\" rel=\"nofollow ugc\">Iratkozz fel a HuCommerce hírlevélre<\/a> és cserébe kapsz tőlünk egy 5.000 Ft értékű kupont, amit a HuCommerce Pro előfizetésnél beválthatsz.<\/p>\n<\/blockquote>\n<p><strong>HuCommerce Pro további funkciói:<\/strong><\/p>\n<ul>\n<li>Pénztár mezők ellenőrzése<\/li>\n<li>Ingyenes szállítás értesítés<\/li>\n<li>Kosár ürítése gomb<\/li>\n<li>Termék ár történet (új Fogyasztóvédelemi rendelet)<\/li>\n<li>Termék ár kiegészítések<\/li>\n<li>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)<\/li>\n<li>Fizetési módok korlátozása<\/li>\n<li>Globális adatok, amiket shortcode-dal lehet bárhol megjeleníteni<\/li>\n<li>Kiemelt ügyfélszolgálat és támogatás<\/li>\n<li>További funkciók hamarosan…<\/li>\n<\/ul>\n<p><strong>HuCommerce tudásbázis<\/strong><\/p>\n<p>A bővítmény használatáról, a Pro verzió aktiválásáról és az egyes modulokról részletesen a <a href=\"https:\/\/www.hucommerce.hu\/tudasbazis\/\" rel=\"nofollow ugc\">HuCommerce tudásbázisunkban<\/a> olvashatsz.<\/p>\n<h4>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)<\/h4>\n<p>A keresztnév és vezetéknév sorrendjének a megfordítása, ha a webáruház magyar nyelvre van állítva. Ahogy mi szeretjük. 🙂 Mindezt úgy, hogy reszponzív nézetben is jó legyen és a CRM, számlázó programok is tudják értelmezni.<\/p>\n<p>A megjelenítés kompatibilis a WPML bővítménnyel, így többnyelvű webáruháznál is magyar sorrendben jelenik meg a név, ha magyar nyelven nézik a webáruházat a látogatók.<\/p>\n<p>A név sorrendje a megrendelés visszaigazolásánál, a vásárló fiókjában és az értesítő levelekben is jól jelenik meg.<\/p>\n<h4>Adószám bekérése vásárlásnál<\/h4>\n<p>A Pénztár oldalon a Cégnév mező alatt már Adószámot is be lehet kérni. Az Adószám mező csak akkor jelenik meg, ha a Cégnév mezőbe lett írva. Az adószám ebben az esetben kötelező mező. Az adószám a rendelésen kívül az adott felhasználó profil adatainál is elmentésre kerül. Az adószám megjelenik mind a visszaigazoláson, mind a rendelés szerkesztésénél, valamint az értesítő levelekben is.<\/p>\n<p>Már maszkolás és validálás is beállítható az Adószám mezőhöz és placeholder megjelenítése is bekapcsolható, ami azoknál a sablonoknál nagyon jól jön, amiknél nem jelennek meg a mezők címkéi.<\/p>\n<h4>Megye mező elrejtése<\/h4>\n<p>Mert ezt nálunk nem szokás használni, így csak plusz felesleges lépés. De ha valakinek nagyon kell, akkor visszaállítható.<\/p>\n<h4>Pénztár mezők ellenőrzése<\/h4>\n<p>Beállítható, hogy a Pénztár oldalon a Számlázási adatoknál az Adószám, Irányítószám és Telefonszám mezőket, a Szállítási adatoknál pedig az Irányítószámot maszkolja, azaz formai szempontból validálja, illetve a megadott beviteli értéket ellenőrizze. Így a következő értékek lesznek érvényben:<\/p>\n<ul>\n<li>Számlázási Adószám: 00000000-0-00 (13 karakter), 00000000000 (11 szám), HU00000000 (HU előtag és 8 szám)<\/li>\n<li>Számlázási és Szállítási Irányítószám: 0000 (4 karakter)<\/li>\n<li>Számlázási Telefonszám: +36000000000 (11-12 karakter)<\/li>\n<\/ul>\n<h4>Város automatikus kitöltése az irányítószám alapján<\/h4>\n<p>A Pénztár oldalon az irányítószám mező kitöltése után automatikusan megjeleníti a várost. Ha már manuálisan lett módosítva a város, akkor nem módosítja az irányítószám alapján.<\/p>\n<p>Vannak olyan irányítószámok, amikkel nem működik, mert vagy még hiányzik az indexből vagy egy irányítószám több településhez is tartozik. Igyekszem az ilyen hiányosságokat javítani.<\/p>\n<h4>Fordítási hiányosságok javítása<\/h4>\n<p>Ideiglenes fordítási hiányosságok javítása a WooCommerce bővítményhez és a legnépszerűbb sablonokhoz (Divi, Storefront), amíg a hivatalos fordításban esetleg nem jelenik meg vagy nem frissíti a rendszer. Én hivatalos szerkesztője is vagyok a magyar WooCommerce fordítási csapatának, ezért ott sokmindent megcsinálok, de néha szükség van erre a kis trükkre.<\/p>\n<h4>Alap ügyfélszolgálat és támogatás<\/h4>\n<p>Ügyfélszolgálati kérdésekkel kapcsolatban a <a href=\"https:\/\/www.facebook.com\/groups\/HuCommerce.hu\/\" rel=\"nofollow ugc\">Facebook csoportban<\/a> és itt, a <a href=\"https:\/\/wordpress.org\/support\/plugin\/surbma-magyar-woocommerce\/\" rel=\"ugc\">WordPress.org saját fórum felületén<\/a> van lehetőség írni nekünk.<\/p>\n<h4>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)<\/h4>\n<p>Lehetőség van az Általános Szerződési Feltételek és az Adatkezelési tájékoztató aktív cselekvésen alapuló elfogadtatására, azaz ki kell pipálnia a vásárlónak ezek elfogadását, mielőtt a rendelést leadhatná. Az adatok a rendeléseknél kerülnek elmentésre és a rendelés szerkesztése oldalon megjelenik az elfogadott státusz. Ebben az esetben a vásárló profil adatainál nem kerül elmentésre az elfogadás, így azt bejelentkezve is minden vásárlás alkalmával el kell fogadnia.<\/p>\n<p>Opcionális a két mező használata, így ha valakinek csak az egyik elfogadtatására és megerősítésére van szüksége, akkor egyik vagy másik kikapcsolható.<\/p>\n<p>További két extra mező is hozzáadható, amihez teljesen szabadon lehet szöveget, linket megadni. Ezekre további jogi megfelelés céljából lehet szükség, ha az adott webáruház megköveteli ezt. Amennyiben bármelyik mező aktiválva lett, azok mindenképpen kötelezőek.<\/p>\n<p>A Pénztár oldalon a Megrendelés gomb fölött és\/vagy alatt közvetlenül elhelyezhető jogi szöveg, ami esetleg fontos vagy kötelező eleme a vásárlási folyamatnak. Ilyen például a távollévők közötti szerződéshez szükséges tudomásulvétel vagy a &#8220;fizetési kötelezettséggel járó megrendelés&#8221; kötelező megjelenítése a megrendelés során.<\/p>\n<p>A regisztrációs űrlapnál is kérhető az Adatkezelési Tájékoztató kötelező elfogadtatása. Ez az adat már elmentésre kerül a felhasználó profil adatainál. Külön beállítható, hogy a felhasználó IP címét is elmentse a rendszer. A regisztrációs adatokat (elfogadás ténye, regisztráció dátuma, IP cím) mind az admin felületen, mind pedig a felhasználó fiókadatainál megjeleníti, de ezek a mezők nem módosíthatók sem a felhasználók, sem az adminisztrátorok részéről.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.<\/p>\n<\/blockquote>\n<h4>Termék ár történet (új Fogyasztóvédelemi rendelet: 4\/2009. (I. 30.) NFGM-SZMM együttes rendelet 2\/A. §)<\/h4>\n<p>Ez a modul nincs minden körülmény között tesztelve és nem tudja 100%-ban teljesíteni a funkcionális és\/vagy jogi igényeket, feltételeket. Ezért a használata esetén fokozott figyelmet igényel.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A HuCommerce ügyfélszolgálatára beküldött visszajelzések és javaslatok jelentősen gyorsítják a modul fejlesztését, ezért szívesen várjuk az ilyen témájú megkereséseket. Köszönjük!<\/p>\n<\/blockquote>\n<p>Az Európai Unió területén, így Magyarországon is 2022. május 28-tól egységes szabályok vonatkoznak az árcsökkentésre.<\/p>\n<p>Az új szabályozás célja annak megakadályozása, hogy a kereskedők megtévesztő árcsökkentéseket alkalmazzanak azzal, hogy az akciók előtt megemeljék a korábbi árat és ezáltal megtévesszék a fogyasztókat az árengedmény mértékével kapcsolatban.<\/p>\n<blockquote>\n<p>A 93\/13\/EGK tanácsi irányelvnek, valamint a 98\/6\/EK, a 2005\/29\/EK és a 2011\/83\/EU európai parlamenti és tanácsi irányelvnek az uniós fogyasztóvédelmi szabályok hatékonyabb végrehajtása és korszerűsítése tekintetében történő módosításáról szóló, 2019. november 27-i (EU) 2019\/2161 európai parlamenti és tanácsi irányelv érintett rendelkezései a termékek eladási ára és egységára, továbbá a szolgáltatások díja feltüntetésének részletes szabályairól szóló 4\/2009. (I. 30.) NFGM-SZMM együttes rendelet (a továbbiakban: Árrendelet) 2\/A. §-ában kerültek átültetésére.<\/p>\n<\/blockquote>\n<p>Ez a modul biztosítja a rendeletnek való megfelelést. A termékhez kapcsolódó árak folyamatos mentésével és annak statisztikai megjelenítésével egy átfogó képet ad a webáruház tulajdonosnak az árváltozás és az aktuális kedvezmény rendelet alapján történő meghatározásáról. A modul minden termékhez létrehoz egy adatlapot, ahol táblázatban és vonal diagramon is mutatja az adatokat. A teljes adatbázis itt JSON és CSV formátumban kimásolható.<\/p>\n<p>A termék végoldalon pedig automatikusan létrehozott és számolt vagy manuálisan megadott szöveg is megadható, ami biztosítja a látogatók megfelelő információval való ellátását. Ezáltal tud megfelelni a webáruház a Fogyasztóvédelmi elvárásoknak.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.<\/p>\n<\/blockquote>\n<h4>Pénztár oldal módosítások<\/h4>\n<p>Céges számlázási adatok feltételes megjelenítése. Ebben az esetben egy checkbox jelenik meg és ha a látogató bepipálja, akkor jelennek csak meg a céges számlázás mezői, mint például a Cégnév és Adószám.<\/p>\n<p>A Cégnév és Adószám mezők feltételes megjelenítése csak akkor, ha a számlázási cím Magyarország. Minden más ország esetében elrejti ezeket a mezőket.<\/p>\n<p>A Cégnév és Adószám, az Irányítószám és Város, valamint a Telefonszám és Email cím mezőket nagy monitoron be lehet állítani, hogy egymás mellé kerüljenek. Az Irányítószám és Város mezők az Ország mező alatt jelennek meg közvetlenül, hogy logikusabb legyen a megjelenési sorrend.<\/p>\n<p>Az Ország és a Rendelés jegyzetek mezőket akár ki is lehet kapcsolni, ha ezek a mezők nem relevánsak a te webáruházadnál. Ha az Ország mezőt elrejted, akkor a Bolt beállításainál kiválasztott ország lesz alapértelmezettként beállítva megrendelésnél.<\/p>\n<h4>Kupon mező módosítások<\/h4>\n<p>A Pénztár oldalon megjelenő kupon mező áthelyezése, elrejtése vagy éppen mindig láthatóvá tétele lehetséges ezzel a modullal.<\/p>\n<h4>Plusz\/mínusz mennyiségi gombok a termékekhez<\/h4>\n<p>A WooCommerce alapból csak egy szám típusú mezőt használ a termékek mennyiségénél, de ez felhasználói szemmel nézve nem elég. Ez a funkció a mennyiségi mező elé és után betesz egy plusz\/minusz gombot, amivel a felhasználók könnyedén tudják változtatni a mennyiséget mind a termék végoldalon, mind pedig a kosár összegzés oldalán.<\/p>\n<p>FIGYELEM! A gombok a különböző sablonoknál esetleg másképp vagy nem megfelelően jelenhetnek meg. Ez minden esetben javítható egy kis CSS segítségével. Én azon vagyok, hogy a lehető legnépszerűbb sablonoknál már automatikusan jól nézzen ki, illetve kap egy alap formázást is, hogy a legtöbb esetben megfelelő legyen, de biztosan lesznek olyan sablonok, ahol ez még így is igényel majd további CSS formázást. A bővítmény támogatás fórumában lehet ezeket jelezni, de nem tudom vállalni, hogy mindenkinek, gyorsan tudok segíteni.<\/p>\n<p>Jelenleg ezeket a sablonokat biztosan támogatja alapból a bővítmény:<\/p>\n<ul>\n<li>Storefront<\/li>\n<li>Divi<\/li>\n<li>Avada<\/li>\n<\/ul>\n<h4>Automatikus frissítés a Kosár oldalon<\/h4>\n<p>A Kosár oldalon a termékek mennyiségének a módosításakor nincs szükség a &#8220;Kosár frissítése&#8221; gomb megnyomására a darabszám módosítása után, mert így automatikusan frissül a Kosár tartalma.<\/p>\n<h4>Egy termék vásárlásonként<\/h4>\n<p>A modul bekapcsolásával a látogatók egy adott vásárlási folyamatban csak egy terméket tudnak a kosárba tenni és megvásárolni. További vásárláshoz újabb rendelést kell leadniuk.<\/p>\n<h4>Kosár átirányítása a Pénztár oldalra<\/h4>\n<p>A modul lehetővé teszi, hogy a Kosár oldal automatikusan a Pénztár oldalra legyen irányítva, ezzel is gyorsítva a vásárlási folyamatot. Mindegy, hogy melyik oldalt használod Kosár oldalként vagy Pénztár oldalként, az átirányítás mindig működni fog.<\/p>\n<h4>Vásárlás folytatása gomb megjelenítése a Kosár és\/vagy a Pénztár oldalakon<\/h4>\n<p>A Kosár és a Pénztár oldalakon megjeleníthető egy plusz Vásárlás folytatása gomb, ami az üzlet oldalra viszi a látogatókat, hogy esetleg még tovább válogassanak a termékek között. Sokszor csak kíváncsiságból kattintanak a látogatók a Kosár gombra, de még nem fejezték be a vásárlásukat.<\/p>\n<p>A gombok pozíciója mind a Kosár, mind a Pénztár oldalon beállítható, valamint van lehetőség egyedi üzenet megjelenítésére is bizonyos pozíciókban.<\/p>\n<h4>Belépés és regisztráció utáni átirányítás<\/h4>\n<p>Beállítható, hogy a látogatók a belépés és regisztráció után a meghatározott oldalra legyenek automatikusan átirányítva. A belépéshez és regisztrációhoz külön-külön állítható be a cél URL. A Pénztár oldalon nem veszi figyelembe az egyedi beállítást, hogy ott ne zavarja a vásárlás befejezését.<\/p>\n<h4>Ingyenes szállítás értesítés<\/h4>\n<p>A termék listaoldalakon, illetve a Kosár és Pénztár oldalakon jeleníthető meg az értesítés, hogy mennyi vásárlási összeg hiányzik még az ingyenes szállításhoz. A szöveg módosítható és többnyelvűsíthető.<\/p>\n<h4>Szállítási módok elrejtése<\/h4>\n<p>Ingyenes szállítás esetén ezzel a modullal elrejtheted az összes nem releváns szállítási módot. Lehetőséged van a személyes átvétel és a “pont” szállítási módok megtartására is.<\/p>\n<h4>Egyedi &#8220;Kosárba teszem&#8221; gombok<\/h4>\n<p>Lehetőséged van teljesen egyedi szövegek megadására a “Kosárba teszem” szöveg helyett. Sőt a különböző termék típusok (egyszerű, előfizetés, tagság, stb.) esetén különböző szövegeket is megadhatsz.<\/p>\n<h4>Kosár ürítése gomb<\/h4>\n<p>A Kosár és Pénztár oldalakon elhelyezhető gombbal a vásárló egy kattintásra tudja törölni az összes kosárban lévő terméket. A gomb csak akkor jelenik meg, ha minimum 2 termék van a kosárban. A véletlen törlés elkerülése végett a teljes törlést meg kell erősítenie a vásárlónak.<\/p>\n<h4>Termék ár kiegészítések<\/h4>\n<p>A Termékek árához lehet beállítani elő- és utótagokat. Előtag lehet például a &#8220;Csak ma&#8221;, &#8220;Nettó&#8221; stb., utótag pedig lehet a &#8220;\/ pár&#8221;, &#8220;\/ kg&#8221;, &#8220;(darabár)&#8221; vagy bármi, ami az adott termék árára jellemző. Az előtagot és utótagot a HuCommerce beállításainál globálisan lehet beállítani, azaz az ott megadott értékek minden terméknél meg fognak jelenni. Ezt a globális beállítást minden terméknél egyesével felül lehet írni, ahol egyedi elő- és utótagok is megadhatók vagy éppen letilthatók adott terméknél. Az előtagokat és utótagokat külön lehet meghatározni a gyüjtő (archívum) oldalakhoz és a termék végoldalakhoz.<\/p>\n<h4>Termék extra beállítások<\/h4>\n<p>Új lehetőségekkel bővülnek a Termékekhez kapcsolódó beállítások. Ez a funkció folyamatosan fog bővülni.<\/p>\n<p><strong>Jelenleg ezek a lehetőségek lettek beépítve:<\/strong><\/p>\n<ul>\n<li>Kosárba tesz gomb – A termék lista oldalakon az egyes termékekhez hozzá lehet adni a Kosárba tesz gombot.<\/li>\n<li>Termék alcím hozzáadása – Egyedi alcímek adhatók a Termékekhez, melyek a listaoldalon és a Termék végoldalon is megjelennek. Az alcím a cím heading HTML kódjába lesz illesztve külön, szemantikus megjelöléssel. Ezt fontos figyelembe venni keresőoptimalizálási (SEO) szempontból is!<\/li>\n<li>Kapcsolódó termékek kikapcsolása a termék végoldalakon<\/li>\n<li>Termék lista oldal: termékek számának beállítása oldalanként<\/li>\n<li>Termék lista oldal: oszlopok számának beállítása<\/li>\n<li>Upsell termékek száma a termék végoldalakon<\/li>\n<li>Upsell termékek száma soronként a termék végoldalakon<\/li>\n<li>Kapcsolódó termékek száma a termék végoldalakon<\/li>\n<li>Kapcsolódó termékek száma soronként a termék végoldalakon<\/li>\n<\/ul>\n<h4>Fizetési módok korlátozása<\/h4>\n<p>Minden vásárlónál külön állíthatod be, hogy milyen fizetési módot választhat a Pénztár oldalon. Így könnyedén kikapcsolhatsz egy-egy fizetési módot mondjuk azoknál a vásárlóknál, akiknél rendszeres volt az utánvétes rendelés esetén a nem fizetés és elállás. De bármilyen más okból is kikapcsolhatsz bizonyos fizetési módokat adott vásárlóknál.<\/p>\n<h4>Globális adatok<\/h4>\n<p>Előre beállítható adatok, amiket rövidkódokkal a webáruház bármely részén megjeleníthetsz. Például a webáruház telefonszáma, ami ha egyszer változik, csak itt kell módosítanod és minden helyen egyszerre a jó telefonszám fog megjelenni. Egyes adatok aktívan jelennek meg, így a telefonszám egy kattintással hívható lesz és az email cím is kattintható formában és titkosítva jelenik meg, hogy a botok ne tudják kiolvasni a kódból.<\/p>\n<p>Ezek az adatok állíthatók be:<\/p>\n<ul>\n<li>Név<\/li>\n<li>Cégnév<\/li>\n<li>Székhely<\/li>\n<li>Adószám<\/li>\n<li>Cégjegyzékszám<\/li>\n<li>Cím<\/li>\n<li>Bankszámlaszám<\/li>\n<li>Mobiltelefon<\/li>\n<li>Telefon<\/li>\n<li>Email cím<\/li>\n<li>Rólunk szöveg<\/li>\n<\/ul>\n<h4>SMTP szolgáltatás beállítása<\/h4>\n<p>Minden webáruházban fontos a kommunikáció az érdeklődővel és vásárlóval mind a vásárlás előtt, mind pedig a megrendelés leadása után. Ezért nagyon fontos, hogy a levelek kézbesítése biztonságos és megbízható legyen. Ezt a külső SMTP szolgáltatók tudják biztosítani, mint például a Mailgun vagy Sendgrid.<\/p>\n<p>A HuCommerce Pro SMTP beállításával összekapcsolhatod a webáruházad levelezését az SMTP szolgáltatóval.<\/p>\n<h4>Katalógus mód<\/h4>\n<p>Ezzel a modullal az értékesítéshez kapcsolódó funkciók és oldalak kapcsolhatók ki. Tehát a termékeket nem lehet kosárba tenni, nincs Pénztár oldal vagy fiók kezelés. A weboldal és a WooCommerce így katalógusként használható.<\/p>\n<h4>WPML és Polylang kompatibilitás<\/h4>\n<p>A szöveges mezők kompatibilisek a WPML, Polylang bővítményekkel, így azok beállíthatók a különböző nyelveken is.<\/p>\n<h4>Kiemelt ügyfélszolgálat és támogatás<\/h4>\n<p>A HuCommerce Pro ügyfelek számára email és live chat csatornákon is biztosítjuk az ügyfélszolgálati ügyek intézését és a támogatást a bővítményhez.<\/p>\n<blockquote>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.<\/p>\n<\/blockquote>\n<h3>Szeretnél többet tudni rólunk és a szolgáltatásainkról?<\/h3>\n<p>Nézd meg a weboldalunkat: <a href=\"https:\/\/www.hucommerce.hu\/\" rel=\"nofollow ugc\">HuCommerce.hu →<\/a><\/p>\n",
        "installation": "<h3>Automatikus telepítés<\/h3>\n<ol>\n<li>A &#8220;Bővítmények -&gt; Új hozzáadása&#8221; menüpont alatt keress rá a <em>HuCommerce | Magyar WooCommerce kiegészítések<\/em> bővítményre.<\/li>\n<li>A bővítmény dobozában kattints a &#8220;Telepítés most&#8221; gombra.<\/li>\n<li>Telepítés után ugyanebben a dobozban kattints a &#8220;Bekapcsol&#8221; gombra, hogy aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések<\/em> bővítményt.<\/li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.<\/li>\n<li>Ennyi az egész. 🙂<\/li>\n<\/ol>\n<h3>Manuális telepítés az admin felületen<\/h3>\n<ol>\n<li>Töltsd le a bővítményt: <a href=\"https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.zip\" rel=\"nofollow ugc\">HuCommerce | Magyar WooCommerce kiegészítések<\/a><\/li>\n<li>Töltsd fel a <code>surbma-magyar-woocommerce.zip<\/code> fájlt a &#8220;Bővítmények -&gt; Új hozzáadása&#8221; menüpont alatt a &#8220;Bővítmény feltöltése&#8221; gombra kattintva.<\/li>\n<li>Aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések<\/em> bővítményt a feltöltés után.<\/li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.<\/li>\n<li>Ennyi az egész. 🙂<\/li>\n<\/ol>\n<h3>Manuális telepítés FTP használatával<\/h3>\n<ol>\n<li>Töltsd le a bővítményt: <a href=\"https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.zip\" rel=\"nofollow ugc\">HuCommerce | Magyar WooCommerce kiegészítések<\/a><\/li>\n<li>Tömörítsd ki a zip fájlt a számítógépeden.<\/li>\n<li>Töltsd fel a <code>surbma-magyar-woocommerce<\/code> mappát a <code>\/wp-content\/plugins\/<\/code> mappába.<\/li>\n<li>Aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések<\/em> bővítményt a &#8220;Bővítmények&#8221; menüpont alatt a WordPress admin felületen.<\/li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.<\/li>\n<li>Ennyi az egész. 🙂<\/li>\n<\/ol>\n",
        "faq": "\n<dt id='hol%20tal%C3%A1lom%20a%20b%C5%91v%C3%ADtm%C3%A9ny%20be%C3%A1ll%C3%ADt%C3%A1sait%3F'>\nHol találom a bővítmény beállításait?\n<\/h4>\n<p>\n<p>A <em>HuCommerce | Magyar WooCommerce kiegészítések<\/em> bővítmény beállításait a &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt éred el.<\/p>\n<\/p>\n<dt id='nem%20cser%C3%A9l%C5%91dtek%20meg%20a%20nevek%20a%20p%C3%A9nzt%C3%A1r%20oldalon.'>\nNem cserélődtek meg a nevek a Pénztár oldalon.\n<\/h4>\n<p>\n<p>Először töröld a szerver oldali és a böngésző gyorsítótárát és frissítsd az oldalt! Győződj meg róla, hogy esetleg más bővítmény nem okoz-e konfliktust! Ha a fordítást módosítottad, az is lehet probléma. Illetve a sablonok is tartalmazhatnak olyan egyedi kódokat, amivel ez a funkció felülírható.<\/p>\n<p>Figyelem! A nevek cseréje csak akkor történik meg, ha magyar nyelvre van állítva a webáruház.<\/p>\n<\/p>\n<dt id='mit%20jelent%20az%2C%20hogy%20surbma%3F'>\nMit jelent az, hogy Surbma?\n<\/h4>\n<p>\n<p>A vezetéknevem visszafelé. 😉<\/p>\n<\/p>\n\n",
        "changelog": "<h4>2023.3.1<\/h4>\n<p><strong>Kiadás dátuma: 2024-02-12<\/strong><\/p>\n<p>JAVÍTÁS<\/p>\n<ul>\n<li>A Plusz\/mínusz mennyiségi gombok modulnál egy karakter hiba javítása.<\/li>\n<\/ul>\n<h4>2023.3.0<\/h4>\n<p><strong>Kiadás dátuma: 2023-12-31<\/strong><\/p>\n<p>FIZETÉSI MÓDOK KORLÁTOZÁSA<\/p>\n<ul>\n<li>Új Pro modul, amivel korlátozni lehet minden egyes felhasználónál az elérhető fizetési módokat.<\/li>\n<\/ul>\n<h4>2023.2.5<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-30<\/strong><\/p>\n<p>JAVÍTÁS<\/p>\n<ul>\n<li>A Plusz\/mínusz mennyiségi gombok modul ellenőrzésének a javítása a Kosár oldalon.<\/li>\n<\/ul>\n<h4>2023.2.4<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-29<\/strong><\/p>\n<p>JAVÍTÁS<\/p>\n<ul>\n<li>A Plusz\/mínusz mennyiségi gombok modul ellenőrzésének a kibővítése a Kosár oldalon.<\/li>\n<\/ul>\n<h4>2023.2.3<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-29<\/strong><\/p>\n<p>JAVÍTÁS<\/p>\n<ul>\n<li>A Plusz\/mínusz mennyiségi gombok modul javítása a Kosár oldalon.<\/li>\n<\/ul>\n<h4>2023.2.2<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-28<\/strong><\/p>\n<p>JAVÍTÁS<\/p>\n<ul>\n<li>A Plusz\/mínusz mennyiségi gombok modul javítása, hogy 1 darabos rendelésnél ne jelenjenek meg.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WooCommerce 8.3 verzióval.<\/li>\n<\/ul>\n<h4>2023.2.1<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-08<\/strong><\/p>\n<p>Kisebb javítások és a kódok optimalizálása. Nincs új funkció, a frissítés biztonságos és mindenképpen ajánlott.<\/p>\n<p>ADÓSZÁM MEGJELENÍTÉSE<\/p>\n<ul>\n<li>Kód optimalizálás.<\/li>\n<\/ul>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>JavaScript kódok sorrendjének módosítása.<\/li>\n<li>Kód optimalizálás.<\/li>\n<li>Cégnév és Adószám mezők elrejtése opció javítása a Céges számlázási adatok feltételes megjelenítése esetén.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Fordítások javítása az admin felületen.<\/li>\n<li>Bővítmény leírás javítása.<\/li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.4 verzióval.<\/li>\n<\/ul>\n<h4>2023.2.0<\/h4>\n<p><strong>Kiadás dátuma: 2023-11-06<\/strong><\/p>\n<p>Újabb nagy kiadás több új funkcióval és rengeteg javítással. Új ingyenes modullal bővült a kínálat, amivel a katalógus mód aktiválható, ha az értékesítéshez kapcsolódó funkciókat ki szeretnéd kapcsolni. A Pénztár oldalon pedig egy új opcióval a Cégnév és Adószám mezőket elrejtheted a nem magyarországi számlázási cím esetén.<\/p>\n<p>Figyelem! A HuCommerce Kosár és Pénztár oldalakhoz kapcsolódó moduljai közül nem mind kompatibilis az új blokkokkal.<\/p>\n<ul>\n<li>Új modul: Katalógus mód<\/li>\n<\/ul>\n<p>LICENSZ KEZELÉS<\/p>\n<ul>\n<li>Az API kulcs kezelésének a módosítása.<\/li>\n<li>Kódok optimalizálása.<\/li>\n<\/ul>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Új opció: Cégnév és Adószám mezők elrejtése, ha a számlázási ország nem Magyarország<\/li>\n<\/ul>\n<p>TERMÉK ÁR TÖRTÉNET<\/p>\n<ul>\n<li>Kód optimalizálása.<\/li>\n<li>Hibaüzenet hozzáadása a termék azonosító hiánya esetén.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>HuCommerce beállítások megjelenésének a finomításai.<\/li>\n<li>Hiányzó fordítások hozzáadása.<\/li>\n<li>Megjelenítés igazítása a Licensz kezelés oldalon.<\/li>\n<li>Ikon módosítása az admin felületen.<\/li>\n<li>HS Beacon kiegészítése további adatokkal.<\/li>\n<li>CPS SDK frissítése a 8.14.0 verzióra.<\/li>\n<li>WooCommerce inkompatibilitás meghatározása: Kosár és Pénztár blokkok.<\/li>\n<\/ul>\n<h4>2023.1.0<\/h4>\n<p><strong>Kiadás dátuma: 2023-07-24<\/strong><\/p>\n<p>Ez egy nagy kiadás lett, rengeteg kisebb és nagyobb módosítással. A legfontosabb változás, hogy most már HPOS\/COT kompatibilis lett a HuCommerce is. Az admin felületen új főmenüpontot kapott a bővítmény, így a beállítások és az egyéb menüpontok könnyebben elérhetők. A kezelő felület is teljesen megváltozott, új, modernebb megjelenést kapott, amivel a kezelés is egyszerűbb lesz. Vannak új opciók is a modulokhoz, most új modul nem került bele ebbe a verzióba. A fókusz a kódok optimalizálásán és az új fejlesztések előkészítésén volt. Kérlek olvasd el a részleteket is, biztosan találsz számodra is hasznos funkciót, változtatást.<\/p>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Új opció: egyedi Megrendelés gomb szöveg megadása.<\/li>\n<\/ul>\n<p>TERMÉK ÁR KIEGÉSZÍTÉSEK<\/p>\n<ul>\n<li><a href=\"https:\/\/woocommerce.com\/document\/high-performance-order-storage\/\" rel=\"nofollow ugc\">HPOS\/COT<\/a> kompatibilitás bevezetése.<\/li>\n<\/ul>\n<p>JOGI MEGFELELÉS<\/p>\n<ul>\n<li><a href=\"https:\/\/woocommerce.com\/document\/high-performance-order-storage\/\" rel=\"nofollow ugc\">HPOS\/COT<\/a> kompatibilitás bevezetése.<\/li>\n<\/ul>\n<p>ADÓSZÁM MEGJELENÍTÉSE<\/p>\n<ul>\n<li>Kódok átrendezése logikailag.<\/li>\n<li>Minden kódhoz leírás hozzáadása vagy módosítása.<\/li>\n<\/ul>\n<p>SZÁLLÍTÁSI MÓDOK ELREJTÉSE<\/p>\n<ul>\n<li>Új opciót kapott a Szállítási módok elrejtése, amivel ez a funkció kikapcsolható, mivel van már más funkció is a modulhoz.<\/li>\n<li>Új funkció: szállítási módok elrejtése a kosár oldalon.<\/li>\n<\/ul>\n<p>TERMÉK ÁR TÖRTÉNET<\/p>\n<ul>\n<li>Shortcode paraméter értékének ellenőrzése és hibás adat esetén visszajelzés kiírása.<\/li>\n<li>Shortcode logika átírása, hogy variálható termékek esetén is működjön.<\/li>\n<li>Variálható termék esetén külön wrapper, hogy a dinamikus megjelenést specifikusabban lehessen célozni.<\/li>\n<li>A termék végoldalakon megjelenítendő kódok módosítása, hogy azok kódolással felülírhatók legyenek, ha egyedi megjelenítésre van esetleg szükség.<\/li>\n<li>A kód indent-álása a helyes szintaxis miatt.<\/li>\n<li>A kódban a változók elnevezésének az egységesítése.<\/li>\n<li>A &#8220;Termék ár történet&#8221; log-olása kikapcsolt modul esetén is az ingyenes változatban is.<\/li>\n<li>Kód dokumentálásának a javításai.<\/li>\n<li>iThemes Security bővítmény PHP Execution beállításának a felülírása, hogy a product-price-history-display.php fájl futtatható legyen.<\/li>\n<li>Termék ár történet mentése első alkalommal, amikor egy terméket szerkesztünk.<\/li>\n<li>Részletes statisztika link megjelenítésének a beállítása globálisan és termékenként is, akár variációnként is.<\/li>\n<li>Külön szövegek megadása akkor, ha az aktuális kedvezményes ár a legalacsonyabb ár.<\/li>\n<li>Logika optimalizálása a termék azonosító meghatározására.<\/li>\n<li>Logika optimalizálása az akció meghatározására.<\/li>\n<li>Kód optimalizálása a feltételek jobb alkalmazásával.<\/li>\n<li>Aktuális kedvezmény számítása és használata.<\/li>\n<li>A részletes statisztika oldalon új feltétel megadása, hogy csak megfelelő jogosultsággal lehessen törlési műveletet végrehajtani.<\/li>\n<li>Kis módosítás a szövegezésben.<\/li>\n<\/ul>\n<p>MEZŐK ÉRTÉKÉNEK ELLENŐRZÉSE<\/p>\n<ul>\n<li>A “Szállítás másik címre” opció ellenőrzése, hogy egyáltalán létezik-e?<\/li>\n<\/ul>\n<p>TERMÉK MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Új opció: Kép nagyítás kikapcsolása.<\/li>\n<\/ul>\n<p>LICENSZ KEZELÉS<\/p>\n<ul>\n<li>Whitelist bevezetése a saját és a Prémium WordPress weboldalakhoz.<\/li>\n<li>A whitelist feltétel kibővítése, hogy lehessen szabályozni fejlesztésnél.<\/li>\n<li>Kódok sorrendjének módosítása az optimális működés érdekében.<\/li>\n<li>Új logika bevezetése a sikertelen lekérés esetén, hogy maradjon az előző státusz, amíg sikeres nem lesz a licensz státusz lekérése.<\/li>\n<li>A Licensz kezeléshez kapcsolódó manuális műveletek csak a Licensz kezelés oldalon futnak le.<\/li>\n<li>A globális változók értékeinek meghatározása új logikával.<\/li>\n<li>Kódok általános optimalizálása.<\/li>\n<li>Az API kezelés link módosítása, hogy egyből az API kulcsok kezelésére mutasson.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Ügyfélszolgálati link módosítása Pro előfizetőknél, hogy a Help Scout Beacon-t nyissa meg közvetlenül.<\/li>\n<li>A HuCommerce új főmenüpontba költözött és az egyes menüpontok almenüpontként közvetlenül is elérhetőek.<\/li>\n<li>A teljes admin UI átdolgozása.<\/li>\n<li>Új HuCommerce logó.<\/li>\n<li>Az egyes menüpontok külön oldalra kerültek.<\/li>\n<li>Egységes kinézet a listázásokhoz, elemekhez.<\/li>\n<li>A modulokhoz szűrők bevezetése.<\/li>\n<li>Modul beállítások feltételes megjelenítése.<\/li>\n<li>Ideiglenesen a Hírek és Ajánlatok menüpontok törlése.<\/li>\n<li>Ajánlatok és Hírek loop-ok törlése az admin Vezérlőpult alól.<\/li>\n<li><a href=\"https:\/\/woocommerce.com\/document\/high-performance-order-storage\/\" rel=\"nofollow ugc\">HPOS\/COT<\/a> kompatibilitás.<\/li>\n<li>Új &#8220;HuCommerce Pro megvásárlása&#8221; gomb a HuCommerce beállítások oldalon a navigációnál.<\/li>\n<li>A hucommerce.hu oldalra mutató linkek javítása.<\/li>\n<li>A Beacon kód generálása dinamikus lett.<\/li>\n<li>Különböző feltételek megadása az egyes Beacon-ökhöz.<\/li>\n<li>Changelog szintaxis módosítása.<\/li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.3 verzióval.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 8.0 verzióval.<\/li>\n<li>CPS SDK frissítése a 8.13.0 verzióra.<\/li>\n<\/ul>\n<h4>2022.4.1<\/h4>\n<p><strong>Kiadás dátuma: 2022-10-24<\/strong><\/p>\n<p>KOSÁR ÜRÍTÉSE GOMB<\/p>\n<ul>\n<li>A Kosár oldalon megjelenő gomb szövegének a beállítási lehetősége.<\/li>\n<li>Pénztár oldalon is csak akkor jelenik meg, ha több termék van a kosárban.<\/li>\n<li>Fordítások javítása.<\/li>\n<\/ul>\n<h4>2022.4.0<\/h4>\n<p><strong>Kiadás dátuma: 2022-10-22<\/strong><\/p>\n<ul>\n<li>Új Pro modul: Kosár ürítése gomb<\/li>\n<li>Új Pro modul: Termék ár kiegészítések<\/li>\n<\/ul>\n<p>TERMÉK ÁR TÖRTÉNET<\/p>\n<ul>\n<li>Megjelenítés shortcode használatával, hogy egyéb helyeken is meg lehessen jeleníteni.<\/li>\n<li>Algoritmus kisebb módosítása.<\/li>\n<li>Kedvezmény megjelenítésének a kisebb javítása, optimalizálása.<\/li>\n<li>Kiegészítés egy lehetséges ellenőrzéssel, ami egyelőre ki lett kapcsolva.<\/li>\n<li>További fordítás hozzáadása.<\/li>\n<li>Bizonyos funcióknál biztosítani kellett, hogy csak az egyszerű termékeknél fussanak le.<\/li>\n<li>Már a variálható termékeknél is menthetőek az egyedi mezők.<\/li>\n<li>Termék szerkesztés oldalon a megjelenítés javítása.<\/li>\n<li>Minden termék típus esetén jól jelenik meg: Egyszerű, Külső\/Partner, Variálható, Csoportosított<\/li>\n<li>Variálható termékekkel is kompatibilis lett.<\/li>\n<li>Pro licensz nélkül is menti az adatokat.<\/li>\n<li>WPML kompatibilitás a szöveges mezőkhöz.<\/li>\n<\/ul>\n<p>JOGI MEGFELELÉS (FOGYASZTÓVÉDELEM, GDPR, EPRIVACY, STB.)<\/p>\n<ul>\n<li>Az egyedi checkbox-ok opcionális beállítási lehetősége.<\/li>\n<li>Az egyedi checkbox-ok értékeit is megjeleníti a rendelésnél.<\/li>\n<\/ul>\n<p>VÁSÁRLÁS FOLYTATÁSA GOMBOK<\/p>\n<ul>\n<li>Új opciót kapott, így a Kosár oldalon is elrejthető a gomb, nem csak a Pénztár oldalon.<\/li>\n<\/ul>\n<p>KOSÁR ÁTIRÁNYÍTÁSA A PÉNZTÁR OLDALRA<\/p>\n<ul>\n<li>Javítva lett az átirányítás, ha a Kosár üres.<\/li>\n<\/ul>\n<p>SMTP SZOLGÁLTATÁS<\/p>\n<ul>\n<li>Teszt üzenet küldésének a javítása.<\/li>\n<\/ul>\n<p>INGYENES SZÁLLÍTÁS ÉRTESÍTÉS<\/p>\n<ul>\n<li>Átkerült a Pro verzióba.<\/li>\n<li>Kiegészítés egyedi beállításokkal, amivel minden szállítási móddal kompatibilis lesz ezentúl.<\/li>\n<li>Kisebb javítás, hogy ellenőrizze az ingyenes szállítás bekapcsolt állapotát.<\/li>\n<li>Csak akkor jelenik meg, ha van termék a kosárban.<\/li>\n<\/ul>\n<p>MEZŐK FORMÁTUMÁNAK ELLENŐRZÉSE (MASZKOLÁS)<\/p>\n<ul>\n<li>Átkerült a Pro verzióba.<\/li>\n<\/ul>\n<p>MEZŐK ÉRTÉKÉNEK ELLENŐRZÉSE<\/p>\n<ul>\n<li>Átkerült a Pro verzióba.<\/li>\n<\/ul>\n<p>MAGYAR FORMÁTUM JAVÍTÁSOK<\/p>\n<ul>\n<li>Kódok optimalizálása.<\/li>\n<li>Rendelés szerkesztésnél is helyesen jelenik meg a név mezők sorrendje.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>A Licensz aktiválásnál az egyedi termék azonosítót veszi figyelembe, ha az meg lett adva az url paraméterben.<\/li>\n<li>Modul fő mező megjelenítésének a módosítása, optimalizálása.<\/li>\n<li>Pro modulok ki-bekapcsolt állapotának a javítása, hogy licensz nélkül kikapcsolhatóak legyenek.<\/li>\n<li>Kisebb módosítás a kód elrendezésében.<\/li>\n<li>HuCommerce beállítások felület módosítása és új beviteli mező típus (number) hozzáadása.<\/li>\n<li>Kisebb módosítás a text mező funkciónál.<\/li>\n<li>CPS SDK frissítése a 8.11.2 verzióra.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 7.0 verzióval.<\/li>\n<\/ul>\n<h4>2022.3.5<\/h4>\n<p>****Kiadás dátuma: 2022-06-19****<\/p>\n<ul>\n<li>A Szállítási módok elrejtése modul további javítása, hogy minden beállításnál a megfelelő szállítási módokat mutassa.<\/li>\n<\/ul>\n<h4>2022.3.4<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-19<\/strong><\/p>\n<ul>\n<li>SMTP szolgáltatás kiegészítése teszt email küldéssel.<\/li>\n<li>Új értesítés a teszt email küldés után.<\/li>\n<li>Új értesítés az API szinkronizálás után.<\/li>\n<\/ul>\n<h4>2022.3.3<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-19<\/strong><\/p>\n<ul>\n<li>A Szállítási módok elrejtése modul javítása, hogy minden beállításnál a megfelelő szállítási módokat mutassa.<\/li>\n<\/ul>\n<h4>2022.3.2<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-13<\/strong><\/p>\n<ul>\n<li>A Jogi megfelelés pozíció értékének a validálása kiszűri az esetlegesen rosszul elmentett értéket az adatbázisban.<\/li>\n<\/ul>\n<h4>2022.3.1<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-13<\/strong><\/p>\n<ul>\n<li>A Pénztár oldali checkbox mezők kódjának a javítása, hogy minden WooCommerce natív jelölést megkapjanak.<\/li>\n<li>A Beállítások oldalon az Adószám mező megjelenítésének a javítása.<\/li>\n<li>A Jogi megfelelés egyik opciójának az alapértelmezett értékét kellett javítani.<\/li>\n<\/ul>\n<h4>2022.3.0<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-11<\/strong><\/p>\n<p>Ebben a verzióban a Termék ár történet modul lett továbbfejlesztve. Megbízhatóbb ár mentéssel és egy új opcióval érkezik, hogy a termék ár statisztikát a látogatók számára is meg lehessen jeleníteni.<\/p>\n<ul>\n<li>Új opció a Termék ár történet statisztika megjelenítésére a látogatók számára.<\/li>\n<li>Régi felhasználóknak kiírt figyelmeztetés törlése.<\/li>\n<li>Egyedi előfizetés azonosító megadási lehetősége a licensz kezelésnél.<\/li>\n<li>Információknál a weboldal információk másolásánál a figyelmeztetés módosítása natív böngésző kisablakra.<\/li>\n<li>Termék ár történet kód optimalizálás és biztonsági feltételek hozzáadása.<\/li>\n<li>Termék ár történet algoritmusának a jelentős javítása.<\/li>\n<li>Termék ár történet most már a WooCommerce importálással és a WP All Import bővítmény importálásával is kompatibilis.<\/li>\n<li>Termék ár történet korlátozott statisztika megjelenítése a látogatók számára.<\/li>\n<li>Termék ár történet statisztika megjelenítésének a módosítása.<\/li>\n<li>Termék ár történet statisztika kiegészítése CSV formátummal.<\/li>\n<\/ul>\n<h4>2022.2.1<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-08<\/strong><\/p>\n<ul>\n<li>Az SMTP szolgáltatás modul is átkerült az ingyenes modulok közé. 🙂<\/li>\n<\/ul>\n<h4>2022.2.0<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-07<\/strong><\/p>\n<p>Ez a verzió újra elérhetővé teszi a régi modulokat az ingyenes verzióban, sőt, több fizetős modul is ingyenes lett. 🙂 A frissítése éppen ezért ajánlott és biztonságos.<\/p>\n<ul>\n<li>Leírás kisebb módosítása.<\/li>\n<li>A kisebb funkcióval rendelkező modulok mostantól ingyenesek újra. A legtöbb új funkció is mind ingyenes lett.<\/li>\n<li>A régi HuCommerce felhasználóknak szóló értesítések törlése, illetve áthelyezése, hogy ne legyen zavaró.<\/li>\n<li>A beállítások oldalon az ajánlat banner törlése, hogy ne legyen zavaró.<\/li>\n<li>Kisebb javítás a productpricehistory-discounttext mező mentésénél.<\/li>\n<li>A legacyuser mentése, hogy lehessen feltételeket megadni a régi felhasználókra.<\/li>\n<li>A Pro modulok vizuális különválasztása a beállítások oldalon.<\/li>\n<li>A Jogi megfelelés modul korlátlan ideig használható az ingyenes verzióval is, csak nem módosítható.<\/li>\n<\/ul>\n<h4>2022.1.5<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-01<\/strong><\/p>\n<ul>\n<li>Hiányzó fájlok javítása.<\/li>\n<\/ul>\n<h4>2022.1.1<\/h4>\n<p><strong>Kiadás dátuma: 2022-06-01<\/strong><\/p>\n<ul>\n<li>Fordítások javítása az admin felületen.<\/li>\n<li>Kisebb módosítások a leírásban.<\/li>\n<\/ul>\n<h4>2022.1.0<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-31<\/strong><\/p>\n<ul>\n<li>A HuCommerce és a HuCommerce Pro első éles kiadása.<\/li>\n<li>Minden változás a következő verziókban olvasható: 2022.0.0.1 &#8211; 2022.0.35<\/li>\n<li>Boldog születésnapot Dorina! 🙂<\/li>\n<\/ul>\n<h4>2022.0.35<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-31<\/strong><\/p>\n<ul>\n<li>A termék ár történet figyelt időszakának javítása, hogy az aktuális akciós árhoz képest megtalálja az előző 30 nap legalacsonyabb aktív árát.<\/li>\n<li>HuCommerce beállítások oldalon a moduloknál kisebb igazítások, hogy helyesen jelöljék az új modulokat és az opcióikat.<\/li>\n<li>HuCommerce beállítások oldalon a modulok kaptak egy &#8220;Bővebben&#8221; linket a leírásnál.<\/li>\n<li>Leírás aktualizálása, kiegészítése.<\/li>\n<\/ul>\n<h4>2022.0.34<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-30<\/strong><\/p>\n<ul>\n<li>Pro modulok feltételeinek a pontosítása.<\/li>\n<li>Termék ár történet modul értékeinek megőrzése akkor is, ha nem aktív az előfizetés.<\/li>\n<\/ul>\n<h4>2022.0.33<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-30<\/strong><\/p>\n<ul>\n<li>Új opció hozzáadása a termékekhez, amivel a termék oldalon el lehet rejteni a legalacsonyabb ár szöveget.<\/li>\n<\/ul>\n<h4>2022.0.32<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-30<\/strong><\/p>\n<ul>\n<li>CPS SDK frissítése a 8.9.0 verzióra.<\/li>\n<\/ul>\n<h4>2022.0.31<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-30<\/strong><\/p>\n<ul>\n<li>Pénztár mezők kompatibilitásának a javítása az Oxygen sablonnal.<\/li>\n<\/ul>\n<h4>2022.0.30<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-30<\/strong><\/p>\n<ul>\n<li>Új modul: Termék ár történet<\/li>\n<li>Új badge a modulokhoz: Beta<\/li>\n<li>Az Adószám megjelenítése modul megjelenítésének kisebb igazítása.<\/li>\n<li>Disclaimer szöveg hozzáadása több modulhoz.<\/li>\n<\/ul>\n<h4>2022.0.20<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-26<\/strong><\/p>\n<ul>\n<li>CPS SDK frissítése a 8.8.0 verzióra.<\/li>\n<li>Feed cache beállítása 24 órára.<\/li>\n<li>A manuális API kérések kiegészítése a status lekéréssel.<\/li>\n<li>A licensz kezelő menüpont kiegészítése a Pro promo-val.<\/li>\n<li>API instance lecserélése a domainre. Így a későbbi újraaktiválás is egyszerűbb, mert weboldalhoz kötött.<\/li>\n<li>Aktiválás és deaktiválás folyamat egyszerűsítése két gombra.<\/li>\n<li>API szinkronizálás és API kezelés linkek hozzáadása.<\/li>\n<li>A régi felhasználók értesítés feltételének a javítása.<\/li>\n<li>A HuCommerce Pro promo banner törlése a beállítások oldalról.<\/li>\n<li>A HuCommerce főmenüpont is kapott címet. A szűrők pedig eltüntek.<\/li>\n<li>Hírlevél feliratkozás átadott paramétereinek a leegyszerűsítése.<\/li>\n<li>A HuCommerce beállítások teljes UI módosítása.<\/li>\n<\/ul>\n<h4>2022.0.19<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-25<\/strong><\/p>\n<ul>\n<li>Felhasználói jogosultság ellenőrzésének a kikapcsolása a license.php fájlban.<\/li>\n<\/ul>\n<h4>2022.0.18<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-24<\/strong><\/p>\n<ul>\n<li>API kulcs kezelés teljeskörű átdolgozása. Most minden feltétel esetén megfelelően frissül és a státusz lekérés is jobb és optimálisabb lett.<\/li>\n<\/ul>\n<h4>2022.0.17<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-24<\/strong><\/p>\n<ul>\n<li>CPS SDK frissítése a 8.7.2 verzióra.<\/li>\n<\/ul>\n<h4>2022.0.16<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-22<\/strong><\/p>\n<ul>\n<li>Admin értesítés &#8211; ami a régi felhasználóknak jelenik meg &#8211; feltételeinek és szövegének a módosítása.<\/li>\n<li>API státusz lekérés feltétel hozzáadása, hogy naponta csak egyszer fusson le.<\/li>\n<\/ul>\n<h4>2022.0.15<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-19<\/strong><\/p>\n<ul>\n<li>Manuális API hívásnál az URL paraméter törlése a lekérés után, hogy az esetleges oldalfrissítés ne okozzon konfliktust.<\/li>\n<li>Az instancebackup és a licensekeybackup értékek feltételes mentése.<\/li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.0 verzióval.<\/li>\n<\/ul>\n<h4>2022.0.14<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-18<\/strong><\/p>\n<ul>\n<li>A product ID változó elnevezésének a módosítása.<\/li>\n<\/ul>\n<h4>2022.0.13<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-18<\/strong><\/p>\n<ul>\n<li>Licensz kezelésnél a product_id is kapott mezőt, hogy lehessen más terméket is tesztelni.<\/li>\n<li>Fix product_id lecserélése dinamikusra.<\/li>\n<li>A licensz kezelő menüpont alatt a mezők placeholder-t kaptak.<\/li>\n<\/ul>\n<h4>2022.0.12<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-17<\/strong><\/p>\n<ul>\n<li>Mezők formátumának ellenőrzése modul kiegészítése a mezőnkénti aktiválás lehetőségével.<\/li>\n<li>Mezők értékének ellenőrzése modul kiegészítése a mezőnkénti aktiválás lehetőségével.<\/li>\n<\/ul>\n<h4>2022.0.11<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-17<\/strong><\/p>\n<ul>\n<li>Admin értesítésnél licensz állapottól függő szövegezés.<\/li>\n<li>A license.php fájlban a feltételes kód javítása.<\/li>\n<li>Katalógus szűrő ideiglenes elrejtése, amíg nem lesz több elem a katalógusban.<\/li>\n<li>A licensz kezelő menüpont alatt a licensz átírása API-ra.<\/li>\n<li>A licensz kezelő menüpont alatt debug módban több információ jelenik meg.<\/li>\n<li>A HuCommerce menüpont alatt az eddigi debug rész törlése, mert arra már nincs szükség.<\/li>\n<\/ul>\n<h4>2022.0.10<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-15<\/strong><\/p>\n<ul>\n<li>Help Scout Beacon feltételek módosítása, hogy azoknak is megjelenjen, akiknek lejárt vagy nem érvényes a licensz kulcsuk.<\/li>\n<li>HuCommerce admin sidebar törlése, mert már nincs rá szükség az új UI miatt.<\/li>\n<li>Admin értesítések feltételeinek a finomításai.<\/li>\n<li>Admin értesítések átszövegezése.<\/li>\n<li>Admin widget kisebb módosítása.<\/li>\n<li>A licensz kezelés átrakása külön fájlba a \/lib\/start.php fájlból.<\/li>\n<li>Modul aktiválások feltételeinek a módosítása, hogy a licensz aktiválást és a régi HuCommerce felhasználók beállításait is megfelelően kezelje.<\/li>\n<li>A \/lib\/license.php fájl kitisztítása.<\/li>\n<li>Manuális lekérések hozzáadása a licensz kezeléshez. Ezeket most a külön aktiváláshoz és deaktiváláshoz használjuk egyelőre.<\/li>\n<li>Az API lekéréshez a wp_error feltétel beállítása, hogy hiba esetén se legyen végzetes hiba.<\/li>\n<li>API válasz mentése az adatbázisba későbbi felhasználási lehetőségekhez.<\/li>\n<li>Licensz állapotokhoz kapcsolódó értesítések hozzáadása.<\/li>\n<li>A kupon modul fájljának átnevezése.<\/li>\n<li>ÚJ &#8211; Kupon megjelenítése nagybetűkkel az admin és a látogatói felületen is.<\/li>\n<li>A kosár automatikus frissítése modul javítása, hogy több sablonnal is kompatibilis legyen.<\/li>\n<li>HuCommerce beállításoknál az Információk fül kibővítése pár hasznos adattal.<\/li>\n<li>A licensz kezelés fül teljes átszabása. Igazítás minden körülményhez és licensz állapothoz.<\/li>\n<li>A licensz kezelés fül alatt megjelennek a licensz adatok.<\/li>\n<li>A modulok mentésénél figyelmeztető szöveg hozzáadása a régi HuCommerce felhasználóknál.<\/li>\n<li>A modulok mentését követő validálások kiegészítése az összes mezőre.<\/li>\n<li>A modulok beállításait megörző logika kialakítása, hogy a régi felhasználóknál vagy lejárt licensz esetén is megmaradjanak a felhasználók beállításai.<\/li>\n<li>Új brandnewuser mező mentése, amivel ellenőrizhető, hogy mióta használja a felhasználó a HuCommerce bővítményt.<\/li>\n<li>Licensz kezeléshez kapcsolódó mezők validálása.<\/li>\n<li>Licensz kezelő menüpont ikonjának módosítása dinamikusra, hogy a licensz állapottól függően legyen zárva vagy nyitva a lakat.<\/li>\n<li>Licenszhez kapcsolódó értesítések beállítása a HuCommerce beállítások oldalon is.<\/li>\n<\/ul>\n<h4>2022.0.9<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-15<\/strong><\/p>\n<ul>\n<li>CPS SDK frissítése a 8.7.1 verzióra.<\/li>\n<li>Kisebb módosítás a leírásban.<\/li>\n<li>Hírlevél feliratkozás hozzáadása a leíráshoz.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 6.5 verzióval.<\/li>\n<\/ul>\n<h4>2022.0.8<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-06<\/strong><\/p>\n<ul>\n<li>Licensz kezelés első verziója. Az API lekérés még nem működik, de a licensz kulcs elmenthető és az érvényesség alapján kezeli a modulokat, egyéb megjelenéseket, illetve a licensz kezelő űrlapot.<\/li>\n<li>A demo licensz kezelés kódja a license.php fájlba került. További módosítás szükséges a működéséhez.<\/li>\n<li>Új licensz menü.<\/li>\n<li>Licensz mező validálása hozzáadva.<\/li>\n<\/ul>\n<h4>2022.0.7<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-06<\/strong><\/p>\n<ul>\n<li>Az uninstall folyamat kiegészítése további opciókkal.<\/li>\n<\/ul>\n<h4>2022.0.6<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-06<\/strong><\/p>\n<ul>\n<li>CPS SDK frissítése a 8.4.0 verzióra.<\/li>\n<\/ul>\n<h4>2022.0.5<\/h4>\n<p><strong>Kiadás dátuma: 2022-05-06<\/strong><\/p>\n<ul>\n<li>HuCommerce beállítások menüpontjai külön fájlokba lettek kiszervezve.<\/li>\n<li>A social links sorrendjének a módosítása.<\/li>\n<li>HuCommerce beállítások oldalon a footer kiegészítése és kisebb módosítása.<\/li>\n<li>A settings-options.php fájl törlése, mert már nincs rá szükség.<\/li>\n<li>A settings-nav-modules.php fájlba átkerültek a globális változók a beállításokhoz.<\/li>\n<\/ul>\n<h4>2022.0.4<\/h4>\n<p><strong>Kiadás dátuma: 2022-04-18<\/strong><\/p>\n<ul>\n<li>HuCommerce Modulok menüpont kiszervezése külön fájlba. Idővel az összes menüpont külön fájlba kerül.<\/li>\n<li>HuCommerce Extensions törlése, egyelőre nem lesz.<\/li>\n<li>Az Ajánlatok, Katalógus és Hírek visszaállítása.<\/li>\n<li>A settings.php fájlba visszakerül a beállítások oldal szerkezete, de minden menüpont külön fájlba lesz kiszervezve. Egyelőre a settings-options.php fájlt megtartottam, hogy most látszódjanak a különbségek, de már nem kell, a következő verzióban ki lesz törölve.<\/li>\n<\/ul>\n<h4>2022.0.3<\/h4>\n<p><strong>Kiadás dátuma: 2022-04-18<\/strong><\/p>\n<ul>\n<li>Kisebb kód optimalizálás.<\/li>\n<li>HuCommerce Beállítások oldal teljeskörű átszabása, új struktúra, új elrendezés, új menüpontok.<\/li>\n<li>Az új beállítások oldal egyes elemeinek a kiszervezése külön fájlokba a könnyebb áttekinthetőség érdekében.<\/li>\n<li>Az új modulok beállításainak a megjelenítése az új UI-ban.<\/li>\n<\/ul>\n<h4>2022.0.2<\/h4>\n<p><strong>Kiadás dátuma: 2022-04-17<\/strong><\/p>\n<ul>\n<li>Törölve lett a HuCommerce beállítások oldalról a 2022.0.0 verzió búcsú üzenete.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 6.4 verzióval.<\/li>\n<li>CPS SDK frissítése a 8.3.0 verzióra.<\/li>\n<\/ul>\n<h4>2022.0.1<\/h4>\n<p><strong>Kiadás dátuma: 2022-04-09<\/strong><\/p>\n<ul>\n<li>HuCommerce Pro link a bővítmények oldalon csak akkor jelenik meg, ha az ingyenes verzió van használatban.<\/li>\n<li>Help Scout Beacon visszaállítása. Van külön az ingyenes és a Pro verzióhoz is beállítva.<\/li>\n<li>A HuCommerce beállítások oldalon is be lettek állítva a megfelelő feltételek a Pro és az ingyenes verziókhoz.<\/li>\n<li>A tervezett funkciók visszakerültek az oldalsávba.<\/li>\n<li>A Welcome notice visszaállítása az első aktiváláskor.<\/li>\n<li>A Pro verzió ellenőrzésének az első verziója. Még nem végleges.<\/li>\n<li>Új modulok kezelésének a hozzáadása. Egyelőre kezelőfelület nélkül, mert azok már az új UI részei lesznek.<\/li>\n<li>Új modul: Kupon mező módosítások<\/li>\n<li>Új modul: Egyedi &#8220;Kosárba teszem&#8221; gombok<\/li>\n<li>Új modul: Szállítási módok elrejtése<\/li>\n<li>Új modul: &#8220;Egy termék egyszerre&#8221; korlátozás<\/li>\n<li>Új modul: Kosár oldal átugrása<\/li>\n<li>Mezők maszkolásának a továbbfejlesztése: az adószám mező már több formátumot is tud engedélyezni, ráadásul dinamikusan.<\/li>\n<li>Mezők validálásának a továbbfejlesztése: új adószám formátumok, dinamikus érvényesítéssel kitöltéskor.<\/li>\n<li>Új opció a Pénztár oldal módosításokhoz: már a További információk rész is kikapcsolható.<\/li>\n<li>Az ingyenes szállítás értesítőnél már beállítható, hogy hol jelenjen meg: termék listaoldalakon, kosár és pénztár oldalon.<\/li>\n<li>Globális adatok modul visszaállítása.<\/li>\n<li>Termék extra beállítások modul visszaállítása.<\/li>\n<li>SMTP modul visszaállítása.<\/li>\n<li>Adószám megjelenítése a Fiókom oldalon is.<\/li>\n<li>A kosár automatikus frissítésének a javítása az Astra sablonnál.<\/li>\n<li>Az uninstall műveletből is törölve lett a Freemius funkció.<\/li>\n<li>A readme.txt frissítése az új modulokkal és leírásokkal.<\/li>\n<\/ul>\n<h4>2022.0.0<\/h4>\n<p>Ez a HuCommerce legutolsó nem fizetős verziója, amiben az összes eddigi modul és funkció elérhető. Amennyiben újabb verzióra frissítesz, bizonyos funkciók nem lesznek elérhetők mentés után. Ez egy stabil és biztonságos verzió, ami további fejlesztéseket nem kap, maximum biztonsági frissítéseket. Minden további fejlesztés a HuCommerce Pro verziójában kap helyet, amire mindenképpen érdemes előfizetni, hiszen nem csak javításokat tartalmaz, hanem rengeteg új és hasznos funkcióval bővül szinte minden hónapban.<\/p>\n<ul>\n<li>A HuCommerce Pro vásárlás linkek cseréje ugrólinkekre, hogy mindig működjön.<\/li>\n<li>A HuCommerce beállítások oldalon a HuCommerce Pro banner szövegének módosítása.<\/li>\n<\/ul>\n<p><strong>2022.0.0.4<\/strong><\/p>\n<ul>\n<li>A HuCommerce beállítások oldalon külön blokkba került a HuCommerce Pro banner.<\/li>\n<li>A HuCommerce beállítások oldalaon az ajánlat banner módosítása.<\/li>\n<li>Kisebb szöveg javítás.<\/li>\n<\/ul>\n<p><strong>2022.0.0.3<\/strong><\/p>\n<ul>\n<li>Tervezett funkciók rész törlése.<\/li>\n<li>Kisebb megjelenítés igazítás az értékelésnél.<\/li>\n<\/ul>\n<p><strong>2022.0.0.2<\/strong><\/p>\n<ul>\n<li>Admin értesítések szövegének a módosítása.<\/li>\n<li>Termék módosítások modul törlése.<\/li>\n<li>Kisebb szöveg módosítások.<\/li>\n<\/ul>\n<p><strong>2022.0.0.1<\/strong><\/p>\n<ul>\n<li>Freemius törlése.<\/li>\n<li>HS Beacon kódok törlése.<\/li>\n<li>Üdvözlő üzenet törlése.<\/li>\n<li>A Globális adatok és az SMTP szolgáltatás modulok törlése.<\/li>\n<li>A Termék alcím opció törlése.<\/li>\n<li>Beállítások oldal letisztítása, hogy ne jelenjenek meg felesleges információk, opciók.<\/li>\n<li>Engedélyezett html tagok listájának a generálása.<\/li>\n<li>A változók átnevezése, hogy tükrözzék a modulok logikáját.<\/li>\n<\/ul>\n<h4>30.3.0<\/h4>\n<p><strong>Kiadás dátuma: 2022-03-04<\/strong><\/p>\n<p>Kisebb hibajavítások a HuCommerce bővítményben és a Freemius frissítése a sebezhetőség miatt. A frissítés biztonságos és mindenképpen ajánlott.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Ingyenes szállítás értesítés javítása, hogy üresen ne jelenjen meg.<\/li>\n<li>A Jogi megfelelés modul szöveg mezők megjelenítésének a javításai, hogy html tagokat is lehessen használni.<\/li>\n<li>A Fiók oldal javítása, hogy alapértelmezettként ne módosítson rajta semmit.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Linkek elhelyezése a Bővítmények menüpont alatt a HuCommerce bővítménynél.<\/li>\n<\/ul>\n<h4>30.2.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-10-25<\/strong><\/p>\n<p>További apró finomítások és javítások a kódban. A frissítés biztonságos és ajánlott!<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kódok optimalizálása.<\/li>\n<li>Kosár automatikus frissítése script optimalizálása.<\/li>\n<li>Kosár automatikus frissítése kompatibilis a Blocksy sablonnal.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítás a beállításoknál.<\/li>\n<li>Mezők hozzáadása a WPML konfigurációhoz.<\/li>\n<\/ul>\n<h4>30.1.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-10-17<\/strong><\/p>\n<p>Ebben a verzióban semmi új funkció nincs, de sok fontos javítás történt. A frissítése biztonságos és mindenképpen ajánlott!<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az Ingyenes szállítás értesítés modul javítása, hogy nettó árak megjelenítése esetén is jó összeget írjon ki.<\/li>\n<li>A Jogi megfelelés modulnál az egyik hibaüzenet módosítása, hogy igazodjon a többi üzenet formátumához.<\/li>\n<li>Adószám mező prioritásának a javítása, hogy az mindenképpen a Cégnév után jelenjen meg.<\/li>\n<li>A Beállítások oldalon az alapértelmezett állapotok javítása, hogy minden ki legyen kapcsolva.<\/li>\n<li>PRÉMIUM &#8211; SMTP Port beállítás javítása, hogy elmentse a választott értéket.<\/li>\n<li>PRÉMIUM &#8211; Az uninstall funkciók ideiglenes törlése, hogy a HuCommerce Pro verzióra váltásnál ne törölje a beállításokat.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Az új verziós értesítés végleges törlése.<\/li>\n<li>A Magyar formátum javítások modul is ki van kapcsolva alapértelmezettként.<\/li>\n<li>Kompatibilitás ellenőrzése a WordPress 5.8 verzióval.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 5.8 verzióval.<\/li>\n<\/ul>\n<h4>30.0.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-06-02<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Pénztár oldali nonce ellenőrzés kisebb javítása.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WordPress 5.7 verzióval.<\/li>\n<\/ul>\n<h4>30.0.0 (29.6 → 30.0)<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-31<\/strong><\/p>\n<p>Új korszak kezdődik a HuCommerce életében. Az ingyenes verzió mellett megjelent a bővítmény fizetős verziója is: a HuCommerce Pro további fantasztikus funkciókat ad az ingyenes HuCommerce Start bővítményhez:<\/p>\n<ul>\n<li>Globális adatok, amiket shortcode-dal lehet bárhol megjeleníteni.<\/li>\n<li>SMTP szolgáltatás beállítása.<\/li>\n<li>Termék extra beállítások &#8211; egyelőre a termékekhez lehet alcímet hozzáadni.<\/li>\n<\/ul>\n<p>A mostani kiadás az ingyenes változathoz is hozott új funkciókat és fejlesztéseket:<\/p>\n<ul>\n<li>Lényegében a teljes kódbázis át lett írva a legszigorúbb biztonsági és kódolási szabványok alapján.<\/li>\n<li>Pénztár oldalon a céges megrendelés checkbox javítása, hogy kompatibilis legyen más sablonok egyedi stílusaival.<\/li>\n<li>A regiszrtációs checkbox validálása csak a front-end-en, hogy manuális regisztráció esetén ne zavarjon be.<\/li>\n<li>Az adószám már az admin felületen a megrendelésnél is módosítható.<\/li>\n<li>Új funkció hozzáadása: Kosárba teszem gomb a termék listaoldalakon.<\/li>\n<li>Új funkció: város mező validálása. Csak betűket és szóközt tartalmazhat.<\/li>\n<li>Új funkció: cím mező validálása. Mindenképpen kell tartalmaznia betűt, szóközt és számot.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Admin értesítések további rendberakása.<\/li>\n<li>\n<p>Uninstall kiegészítése az új admin értesítésekkel.<\/p>\n<\/li>\n<li>\n<p>Boldog születésnapot Dorina! 🙂<\/p>\n<\/li>\n<\/ul>\n<h4>29.15.3<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-28<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Welcome admin értesítés módosítása.<\/li>\n<\/ul>\n<h4>29.15.2<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-26<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Admin értesítések javítása, módosítása és kibővítése.<\/li>\n<li>Admin dasboard widget kiegészítése.<\/li>\n<\/ul>\n<p>=#### Changelog=<\/p>\n<h4>29.15.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-26<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>HuCommerce ikon hozzáadása a Freemius installációs folyamatához.<\/li>\n<\/ul>\n<h4>29.15.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-26<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Freemius aktiválási logika bevezetése, hogy az ingyenes és fizetős bővítmények ne legyenek konfliktusban.<\/li>\n<\/ul>\n<h4>29.14.2<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-25<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Pénztár oldali megjelenítés javítása, hogy a html kódot ne kiírja, hanem feldolgozza.<\/li>\n<\/ul>\n<h4>29.14.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-25<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>PRÉMIUM &#8211; Help Scout Beacon kód javítása, boztonság növelése.<\/li>\n<\/ul>\n<h4>29.14.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-25<\/strong><\/p>\n<p>Új funkcióként mostantól globális adatok is megadhatók, melyeket shortcode segítségével lehet megjeleníteni bárhol a weboldalon. Így ha változik egy adat, például a telefonszám, akkor azt elég egyszer módosítani és mindenhol az új adat jelenik meg.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>PRÉMIUM &#8211; Új modul: Globális adatok.<\/li>\n<\/ul>\n<h4>29.13.6<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-24<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>SMTP beállítások külön blokkba került a könnyebb áttekinthetőség miatt.<\/li>\n<li>Az SMTP beállításoknál ikonokat kaptak a fiók azonosító mezők.<\/li>\n<li>Az SMTP beállításoknál a jelszó mező típusa módosítva lett, hogy a jelszó ne látszódjon.<\/li>\n<\/ul>\n<h4>29.13.5<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-24<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A prémium verzió konfigurálásának kisebb módosítása.<\/li>\n<\/ul>\n<h4>29.13.4<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-23<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A prémium kódok ellenőrzése, hogy aktív-e az előfizetés.<\/li>\n<li>Prémium beállítások engedélyezése csak aktív előfizetés mellett.<\/li>\n<li>SMTP beállítás validálásának javítása, hogy az alapértelmezett beállítás a megfelelő legyen.<\/li>\n<li>A prémium beállítások megőrzése akkor is, ha lejár a licensz vagy ingyenesre vált a felhasználó.<\/li>\n<\/ul>\n<h4>29.13.3<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-23<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítások a kódban a WPCS és WCCS szabvány alapján.<\/li>\n<\/ul>\n<h4>29.13.2<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-23<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>PRÉMIUM &#8211; A termék alcím függvény módosítása, hogy a Freemius megfelelően kezelje a prémium kódot.<\/li>\n<\/ul>\n<h4>29.13.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-23<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Az érkező funkciókból ki lett véve egy, ami bekerül a prémium verzióba.<\/li>\n<\/ul>\n<h4>29.13.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-23<\/strong><\/p>\n<p>Mostantól külsős SMTP szolgáltatót is beállíthatsz a weboldaladhoz, hogy az értesítők kézbesítése még biztosabb legyen. Ez minden webáruház tulajdonosnak ajánlott funkció!<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>PRÉMIUM &#8211; Új modul: SMTP szolgáltatás beállítása.<\/li>\n<\/ul>\n<h4>29.12.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-22<\/strong><\/p>\n<p>Újabb validálások a Pénztár oldalon. Most már a város és cím mezőket is validálja.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Új funkció: város mező validálása. Csak betűket és szóközt tartalmazhat.<\/li>\n<li>Új funkció: cím mező validálása. Mindenképpen kell tartalmaznia betűt, szóközt és számot.<\/li>\n<\/ul>\n<h4>29.11.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-22<\/strong><\/p>\n<p>Új lehetőségként a &#8220;Kosárba teszem&#8221; gomb megjeleníthető a termék lista oldalakon (Üzlet, kategóriák, stb.).<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Új funkció hozzáadása: Kosárba teszem gomb a termék listaoldalakon.<\/li>\n<\/ul>\n<h4>29.10.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-21<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítás a dashboard widget megjelenítésében.<\/li>\n<\/ul>\n<h4>29.10.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-20<\/strong><\/p>\n<p>Új lehetőségként a termékekhez alcím adható, ami megjelenik a termékek végoldalain és a gyüjtőoldalakon. Az alcím a címsor része, ami külön szemantikus kódként van beillesztve.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Új modul hozzáadása: Termék extra beállítások<\/li>\n<li>PRÉMIUM &#8211; Új funkció hozzáadása: Termék alcím<\/li>\n<\/ul>\n<h4>29.9.3<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-17<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Link javítása az egyik admin értesítésnél.<\/li>\n<\/ul>\n<h4>29.9.2<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-17<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Feed frissítés idejének a javítása.<\/li>\n<\/ul>\n<h4>29.9.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-17<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A bővítmény törlése esetén az adatbázis további tisztítása.<\/li>\n<\/ul>\n<h4>29.9.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-17<\/strong><\/p>\n<p>A HuCommerce bővítmény előkészítése a prémium verzió kiadásához.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Freemius SDK hozzáadása.<\/li>\n<li>Freemius script-ek hozzáadása, hogy admin felületen lehessen megvásárolni a prémium verziót.<\/li>\n<li>HuCommerce Pro banner-ek hozzáadása.<\/li>\n<li>HuCommerce feed-ek hozzáadása.<\/li>\n<li>Admin értesítések feltételeinek a módosítása, hogy csak a megadott helyeken jelenjenek meg.<\/li>\n<li>Új admin értesítés a legújabb verzióhoz.<\/li>\n<li>Új HuCommerce dashboard widget hozzáadása.<\/li>\n<\/ul>\n<h4>29.8.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-16<\/strong><\/p>\n<p>A bővítmény teljes kódbázisa újra lett írva a legszigorúbb szintaktikai és biztonsági szempontok alapján.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A teljes kódbázis átírása a WPCS és WCCS kódolási szabványok alapján.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Az újnak jelölt moduloknál az &#8220;ÚJ&#8221; címke eltávolítása.<\/li>\n<\/ul>\n<h4>29.7.0<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-10<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Pénztár oldalon a céges megrendelés checkbox javítása, hogy kompatibilis legyen más sablonok egyedi stílusaival.<\/li>\n<li>A regiszrtációs checkbox validálása csak a front-end-en, hogy manuális regisztráció esetén ne zavarjon be.<\/li>\n<li>Az adószám már az admin felületen a megrendelésnél is módosítható.<\/li>\n<li>Admin CSS kisebb javítása.<\/li>\n<li>Admin CSS előkészítése az új menühöz.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WooCommerce 5.2 verzióval.<\/li>\n<\/ul>\n<h4>29.6.3<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-09<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Új ignore szabály bevezetése a .gitignore fájlban, hogy könnyen lehessen fájlokat kivonni a verziókövetés alól.<\/li>\n<li>A new-settings.php fájl átnevezése, hogy az már megfeleljen a fenti szabálynak.<\/li>\n<\/ul>\n<h4>29.6.2<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-09<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK hozzáadása submodule-ként. Emiatt az SDK útvonala is változott.<\/li>\n<\/ul>\n<h4>29.6.1<\/h4>\n<p><strong>Kiadás dátuma: 2021-05-09<\/strong><\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>WCCS ellenörző hozzáadása és a .gitignore módosítása ennek alapján.<\/li>\n<\/ul>\n<h4>29.6<\/h4>\n<p><strong>Kiadás dátuma: 2020-11-27<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Jogi megfelelés checkbox-ok kisebb módosítása, hogy ne legyen konfliktusban másik stílusokkal.<\/li>\n<\/ul>\n<h4>29.5<\/h4>\n<p><strong>Kiadás dátuma: 2020-11-27<\/strong><\/p>\n<p>HTML struktúra kisebb módosítása a Pénztár oldalon. A frissítés biztonságos.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Jogi megfelelés checkbox-ok HTML struktúrájának a kisebb módosítása, hogy CSS-sel könnyebben lehessen formázni.<\/li>\n<\/ul>\n<h4>29.4<\/h4>\n<p><strong>Kiadás dátuma: 2020-11-22<\/strong><\/p>\n<p>Admin üzenet javítása. Egyéb kisebb optimalizálás a kódban. A frissítés biztonságos.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A kód kisebb javításai, hogy a kimenetek is biztonságosak legyenek.<\/li>\n<li>Kód szintaktika optimalizálása.<\/li>\n<li>CPS SDK módosítása, előkészítése a következő verzióhoz.<\/li>\n<li>PAnD kód javítása.<\/li>\n<\/ul>\n<h4>29.3<\/h4>\n<p><strong>Kiadás dátuma: 2020-10-28<\/strong><\/p>\n<p>Kisebb karbantartás. A frissítés biztonságos.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése a 7.2 verzióra.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Elírás javítása.<\/li>\n<\/ul>\n<h4>29.2<\/h4>\n<p><strong>Kiadás dátuma: 2020-10-26<\/strong><\/p>\n<p>A Pénztár modul aktív állapotának ellenőrzése, hogy ne legyen semmilyen beállítás mellett sem konfliktusban az Adószámmal. A frissítése biztonságos és mindenképpen ajánlott!<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár modul aktív állapotának ellenőrzése az Adószám modulnál.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WooCommerce 4.6 verzióval.<\/li>\n<\/ul>\n<h4>29.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-10-01<\/strong><\/p>\n<p>Ez csak egy karbantartási frissítés. A Vásárlás folytatása gombok modul kódja lett módosítva. A frissítése biztonságos.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>A Vásárlás folytatása gombok kódjának újraírása.<\/li>\n<\/ul>\n<h4>29.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-09-30<\/strong><\/p>\n<p>A Jogi megfeleléshez kapcsolódó checkbox mezők pozíciója választható. Most már a Megrendelés gomb fölött is megjeleníthetők ezek a mezők, sőt ez az alapértelmezett beállítás. További két extra checkbox mezőt is hozzá lehet adni, amennyiben további megerősítések is szükségesek az oldalnál.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Beállítható lett a Jogi megfeleléshez kapcsolódó checkbox mezők pozíciója.<\/li>\n<li>Két extra checkbox mező hozzáadási lehetősége a Jogi megfeleléshez.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Szövegek kiírásának a validálásánál kisebb javítások.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kisebb módosítások a szövegben.<\/li>\n<li>Bővítmény leírásának a kibővítése.<\/li>\n<\/ul>\n<h4>28.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-09-17<\/strong><\/p>\n<p>A HuCommerce mostantól bármilyen nyelvre fordítható. Minden szöveg angol a kódban, a magyar is egy fordítás, amit frissítés után külön kell letölteni. A Magyar formátum javítások kompatibilisek a legújabb és a régebbi verziókkal is.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>WooCommerce verzió ellenőrzéshez külön függvény. Lehetőséget ad a különböző verziók támogatására funkcionális szinten.<\/li>\n<\/ul>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>A HuCommerce előkészítése a többnyelvűsítésre. Minden szöveg át lett írva angolra a kódban.<\/li>\n<li>Beállítások oldal kinézetének módosítása: saját márkás fejléc lecserélése a WooCommerce saját fejlécére.<\/li>\n<li>Az admin oldalon megjelenő üdvözlő üzenet megjelenésének a módosítása, illetve szöveg javítása.<\/li>\n<li>A Magyar formátum javítások modul átalakítása: kompatibilitás a régebbi verziókkal, illetve a továbbra is szükséges javítások megtartása. Ez azért kell, mert a WooCommerce 4.4 verzió sem javít ki minden esetet.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kisebb kód optimalizálások.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 4.5 verzióval.<\/li>\n<\/ul>\n<h4>27.2<\/h4>\n<p><strong>Kiadás dátuma: 2020-08-16<\/strong><\/p>\n<p>Egy kis módosítás a Pénztár oldalon, hogy a Céges adatok checkbox több sablonnal is kompatibilis legyen.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár oldali Céges adatok checkbox-hoz új class-ek lettek hozzáadva.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WordPress 5.5 verzióval.<\/li>\n<li>Minimum WordPress verzió növelése 5.3 verzióra.<\/li>\n<\/ul>\n<h4>27.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-08-11<\/strong><\/p>\n<p>A bővítmény aktiválásának ellenőrzése már Multisite környezetben is jól működik. Ezen kívül kisebb javítás történt a telefonszám maszkolásnál, hogy kevesebb hibalehetőség legyen. A frissítése biztonságos és mindenképpen ajánlott.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A &#8220;WooCommerce aktiválásának ellenőrzése&#8221; már Multisite kompatibilis.<\/li>\n<li>A telefonszám maszkolás javítása, hogy kevesebb elütéses hiba lehessen.<\/li>\n<\/ul>\n<h4>27.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-08-02<\/strong><\/p>\n<p>Nincs új funkció, de kód szinten nagy változtatások vannak ebben az új főverzióban. Mind biztonsági, mind logikai szinten történtek fejlesztések. Frissítése biztonságos.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Kód módosítások és optimalizálás a WordPress és WooCommerce kódolási ajánlatai alapján.<\/li>\n<li>Licensz módosítása GPLv2-ről GPLv3-ra.<\/li>\n<li>Direkt elérés megakadályozása az összes php fájlhoz a biztonság növelése érdekében.<\/li>\n<li>A &#8220;WooCommerce aktiválásának ellenőrzése&#8221; folyamat módosítása a WooCommerce ajánlása alapján.<\/li>\n<li>A kifejezetten HuCommerce specifikus kódok külön szintaxissal való jelölése és még jobb elkülönítése.<\/li>\n<li>Start folyamatok újragondolása.<\/li>\n<li>A Pénztár oldal címek átrendezése átkerült a hu-format-fix.php fájlba.<\/li>\n<li>A Jogi megfelelés modulhoz tartozó admin adatok megjelenítésének módosítása.<\/li>\n<\/ul>\n<h4>26.7<\/h4>\n<p><strong>Kiadás dátuma: 2020-07-31<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A plusz-minusz gombok további igazítása.<\/li>\n<\/ul>\n<h4>26.6<\/h4>\n<p><strong>Kiadás dátuma: 2020-07-31<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A plusz-minusz gombok kisebb igazítása.<\/li>\n<\/ul>\n<h4>26.5<\/h4>\n<p><strong>Kiadás dátuma: 2020-07-31<\/strong><\/p>\n<p>A magyar formátum javításnál ki lett véve az autofocus, mert már nem is releváns és így nem okoz konfliktust más bővítményekkel. A frissítés biztonságos.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár oldalon a név mezőknél az autofocus törlése.<\/li>\n<\/ul>\n<h4>26.4<\/h4>\n<p><strong>Kiadás dátuma: 2020-07-02<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az Adatkezelési Tájékoztató ellenőrzésének a javítása.<\/li>\n<\/ul>\n<h4>26.3<\/h4>\n<p><strong>Kiadás dátuma: 2020-07-02<\/strong><\/p>\n<p>Az irányítószámok listáját kicsit kibővítettem, így még több irányítószám esetén kitölti a várost. Frissítése biztonságos.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Irányítószám lista bővítése.<\/li>\n<li>Irányítószám mező automatikus kitöltésénél újabb JS event hozzáadása, hogy biztosabb legyen a kitöltés.<\/li>\n<li>Beállítások oldal kisebb módosítása.<\/li>\n<\/ul>\n<h4>26.2<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-29<\/strong><\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>&#8220;Mezők értékének ellenőrzése&#8221; opció már a telefonszám helyes formátumát is ellenőrzi.<\/li>\n<\/ul>\n<h4>26.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-29<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>&#8220;Mezők értékének ellenőrzése&#8221; opció aktiválásának a javítása.<\/li>\n<\/ul>\n<h4>26.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-25<\/strong><\/p>\n<p>Kisebb, de fontos módosítások. A maszkolásnál kikapcsolható a placeholder használata, így nem zavar be azoknál a sablonoknál, ahol csak a mezők jelennek meg. Illetve az Adószám mezőhöz is aktiválható a placeholder megjelenítése, ami szintén azoknál a sablonoknál fontos, ahol csak a mezők jelennek meg.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Maszkolásnál külön állítható a placeholder megjelenítése.<\/li>\n<li>Adószám mezőnél bekapcsolható a placeholder használata.<\/li>\n<\/ul>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Változtatások a leírásban.<\/li>\n<\/ul>\n<h4>25.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-25<\/strong><\/p>\n<p>A beállítások oldal menüpontja visszakerült a WooCommerce főmenüpont alá! Az admin felületen az egyes modulok és beállítások át lettek rendezve, hogy logikusabb legyen a megjelenés.<\/p>\n<p>Új funkcióként megjelent a Pénztár mezők értékének a validálása is, egyelőre a karakterek számát figyeli. Így az Adószám, Irányítószám és Telefonszám mezők a maszkolás funkció egyidejű használatával már elég jól kizárják a téves adatok megadását.<\/p>\n<p>További új funkció, hogy a Pénztár oldalon az Email mezőt be lehet állítani legfelülre, így kosárelhagyás esetén nagyobb valószínűséggel lesz meg a látogató email címe.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Pénztár oldali mezők validálási lehetősége.<\/li>\n<li>Email mező beállítása legfelülre a Pénztár oldalon.<\/li>\n<\/ul>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>A HuCommerce menüpont visszakerült a WooCommerce főmenüpont alá.<\/li>\n<li>CPS menüpont törlése.<\/li>\n<li>Kódok optimalizálása.<\/li>\n<li>Új mappa és fájlstruktúra a funkciók logikai elszeparálásához.<\/li>\n<\/ul>\n<h4>24.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-24<\/strong><\/p>\n<p>Mostantól beállítható a Pénztár oldalon a beviteli értékek validálása az Adószám, Irányítószám és Telefonszám mezőkhöz. FIGYELEM! Ez a beállítás esetleg konfliktusban lehet bizonyos számlázó és\/vagy szállítási kiegészítőkkel. Mindenképpen tesztelni kell, hogy a formátumok megfelelnek-e a számlázó és\/vagy szállíási kiegészítőknek! A bővítmény frissítése egyébként biztonságos, mivel az új funkció alapértelmezetten nem aktív.<\/p>\n<p>Visszajelzéseket, hibajalentést a Facebook csoportban várom: HuCommerce támogató csoport<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Pénztár oldali mezők maszkolási lehetősége.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése a 7.0 verzióra.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb szintű kódoptimalizálások.<\/li>\n<\/ul>\n<h4>23.11<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-24<\/strong><\/p>\n<p>További javítások a WooCommerce 4.1 verzióban megjelent hibákra, hogy minden beállítás mellett helyesen működjenek a Pénztár funkciók. Frissítése biztonságos és ajánlott.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Adószám mező kezelésének javítása.<\/li>\n<\/ul>\n<h4>23.10<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-24<\/strong><\/p>\n<p>További javítások a WooCommerce 4.1 verzióban megjelent hibákra, hogy minden beállítás mellett helyesen működjenek a Pénztár funkciók. Frissítése biztonságos és ajánlott.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Adószám mező kezelésének javítása.<\/li>\n<li>Kisebb logikai műveletek optimalizálása.<\/li>\n<\/ul>\n<h4>23.9<\/h4>\n<p><strong>Kiadás dátuma: 2020-06-11<\/strong><\/p>\n<p>A Pénztár oldalon javítja a céges adatok mezőinek a kezelését, hogy bizonyos szituációkban ne törölje a már beírt adatokat. A frissítés ajánlott és biztonságos.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár oldalon a céges adatok kezelésének a javítása. (Köszönet: @dosabalint)<\/li>\n<\/ul>\n<h4>23.8<\/h4>\n<p><strong>Kiadás dátuma: 2020-05-13<\/strong><\/p>\n<p>Kisebb javítás, ami a cím második sorát feltételesen jeleníti csak meg. Frissítése biztonságos.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár oldalon a második címsor feltételes módosítása.<\/li>\n<\/ul>\n<h4>23.7<\/h4>\n<p><strong>Kiadás dátuma: 2020-05-09<\/strong><\/p>\n<p>A WooCommerce 4.1 verzióban kijött WooCommerce beállítások kezelésének a hibáját javítja ez a verzió. Frissítése biztonságos.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WooCommerce 4.1 verzióval.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Pénztár oldalon a WooCommerce beállítások alternatív ellenőrzése.<\/li>\n<\/ul>\n<h4>23.6<\/h4>\n<p><strong>Kiadás dátuma: 2020-05-05<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítások a Pénztár oldal JavaScript kódjaiban.<\/li>\n<\/ul>\n<h4>23.5<\/h4>\n<p><strong>Kiadás dátuma: 2020-05-04<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítások a Pénztár oldal JavaScript kódjaiban.<\/li>\n<\/ul>\n<h4>23.4<\/h4>\n<p><strong>Kiadás dátuma: 2020-05-03<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítások a Pénztár oldal JavaScript kódjaiban.<\/li>\n<\/ul>\n<h4>23.3<\/h4>\n<p><strong>Kiadás dátuma: 2020-04-27<\/strong><\/p>\n<p>Céges adatok ideiglenes mentése a feltételes megjelenítés esetén, ha mégis kell a vásárlás során. További javítások a kódban az optimálisabb script kezelések érdekében. A frissítés biztonságos.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Céges adatok ideiglenes mentése a Pénztár oldalon.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az automatikus város kitöltés script-jeinek meghívása a megfelelő feltételekkel.<\/li>\n<li>Az Adószám kezeléséhez szükséges script meghívása a jQuery után.<\/li>\n<li>Felesleges js fájlok törlése.<\/li>\n<\/ul>\n<h4>23.2<\/h4>\n<p><strong>Kiadás dátuma: 2020-04-25<\/strong><\/p>\n<p>Apró javítás az inline script-ek kezelésével kapcsolatban. A frissítés biztonságos.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Inline script-ek betöltése a jQuery után. (Köszönet: Dovalovszki Tamás &#8211; @dovi42)<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése a 6.0 verzióra.<\/li>\n<\/ul>\n<h4>23.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-04-13<\/strong><\/p>\n<p>Kisebb módosítás, ami javítja az előző verziók üres Cégnév és Adószám mezőinek a felülírásait. A frissítés biztonságos és ajánlott.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az üres Cégnév és Adószám mezők az előző verziókban a &#8216;- N\/A -&#8216; értéket kapták alapértelmezettként. Ebben a verzióban ezeket törli a Pénztár oldalon, hogy az újabb megrendelésnél már ne zavarjon be.<\/li>\n<\/ul>\n<h4>23.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-04-13<\/strong><\/p>\n<p>Új funkció nincs a frissítéssel, de a Pénztár oldalon jelentős módosítások történtek, ami növeli a kompatibilitást más bővítményekkel, igazodik a WooCommerce és a HuCommerce különböző variációjú beállításaihoz és optimalizálja a kódokat, csökkenti a lekérések számát. Frissítése biztonságos.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Az Adószám mező kezelésének a teljeskörű újragondolása. Elvileg most már kompatibilis minden beállítási variációval és helyesen kezeli a feltételes kötelező jellegét.<\/li>\n<li>Az adószám mező kezeléséhez szükséges javascript kód inline beillesztése, amivel csökkent a lekérések száma, valamint a beállításoktól függően jelennek csak meg a kódok.<\/li>\n<li>A Pénztár oldal kódjainak jelentős optimalizálása a különböző beállításokkal való kompatibilitás érdekében.<\/li>\n<li>A Pénztár oldal kezeléséhez szükséges javascript kód inline beillesztése, amivel csökkent a lekérések száma, valamint a beállításoktól függően jelennek csak meg a kódok.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>További ellenőrzések a Pénztár mezők módosításainál, hogy kompatibilis legyen más bővítményekkel, amik szintén módosítják a Pénztár mezőket. (Köszönet: Viszt Péter &#8211; @passatgt)<\/li>\n<\/ul>\n<h4>22.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-03-30<\/strong><\/p>\n<p>Kicsi, de fontos javításokat tartalmazó frissítés. Mindenképpen ajánlott a frissítés, de minimum a WooCommerce 4.x főverzió esetén!<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Ország elrejtése esetén fontos javítás, hogy ne módosítsa a többi mezőt.<\/li>\n<li>Mezők sorrendjének a javítása, hogy minden ország esetén rendben legyen a megjelenés.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WordPress 5.4 főverzióval.<\/li>\n<li>CPS SDK frissítése az 5.10 verzióra.<\/li>\n<\/ul>\n<h4>22.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-03-12<\/strong><\/p>\n<p>FONTOS! Csak akkor frissíts erre a verzióra, ha a WooCommerce is frissítve lett legalább a 4.0 verzióra!<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>A quantity-input.php template fájl törölve lett, mivel a WooCommerce 4.0 verzióban új hook-ok lettek hozzáadva.<\/li>\n<li>A plusz\/minusz gombok az új hook-okkal lettek hozzáadva. Csak a WooCommerce 4.0 verziótól működik!<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kód optimalizálás.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 4.0 verzióval.<\/li>\n<li>A minimum PHP követelmény módosítása 7.0 verzióra.<\/li>\n<\/ul>\n<h4>21.6<\/h4>\n<p><strong>Kiadás dátuma: 2020-03-09<\/strong><\/p>\n<p>Kisebb módosításokat és hibajavítást tartalmaz ez a verzió. A frissítése biztonságos és mindenkinek ajánlott.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Kódok átírása.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Fordítás textdomain módosítása egy-két helyen.<\/li>\n<li>Beállítások globális változóinak a korai hívása, hogy betöltésnél már rendelkezésre álljanak a választások.<\/li>\n<\/ul>\n<h4>21.5<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-20<\/strong><\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Pénztár oldalon a város automatikus kitöltése esetén a mező validálása.<\/li>\n<\/ul>\n<h4>21.4<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-19<\/strong><\/p>\n<p>Kisebb módosítás, hogy a számlázási és a szállítási adatoknál az irányítószám megadása esetén frissüljön a Pénztár.<\/p>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Pénztár frissítése az irányítószám megadása után, az automatikus kitöltés esetén.<\/li>\n<\/ul>\n<h4>21.3<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-19<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Verziószám frissítés.<\/li>\n<\/ul>\n<h4>21.2<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-19<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Céges számlázás mezőnél a &#8220;Nem kötelező&#8221; szöveg törlése.<\/li>\n<li>Felesleges JS kódok törlése.<\/li>\n<li>Nyelvi mappa törlése, mivel már elérhető a hivatalos forrásból.<\/li>\n<\/ul>\n<h4>21.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-19<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az Adószám mező külön kötelezővé tétele már felesleges, mert alapból is kötelező.<\/li>\n<\/ul>\n<h4>21.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-18<\/strong><\/p>\n<p>Az előző verzióból kimaradt egy fontos fejlesztés, amit most bepótoltam. Ha nem feltételesen jelennek meg a céges számlázási mezők, akkor is csak a Cégnév látszik alapból és az Adószám csak akkor, ha kitölti a Cégnevet. Az Adószám innentől kezdve kötelező mező lett.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Adószám kötelező lett, illetve a Cégnév kitöltésétől függően jelenik meg alapból.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Kisebb javítás a leírásban.<\/li>\n<\/ul>\n<h4>20.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-18<\/strong><\/p>\n<p>A legújabb főverzió igazán nagy és régóta várt újításokat tartalmaz. Mostantól megjeleníthető egy &#8220;Céges számlázás&#8221; checkbox, ami elrejti vagy megjeleníti a céges számlázási adatokat (Cégnév, Adószám). Illetve egy régi &#8220;hibát&#8221; is javítottam: az Ország mező elrejtése esetén a megrendelés során alapértelmezettként a Bolt beállított országa lesz az aktuális Ország. Így nem lesz konfliktusban a szállítási és fizetési modulokkal.<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Céges számlázási adatok feltételes megjelenítése. Aktív állapotban a céges adatok kitöltése kötelező.<\/li>\n<li>Cégnév és Adószám mezők egymás mellé rendezése.<\/li>\n<\/ul>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Ha az &#8220;Ország mező elrejtése&#8221; opció aktív, akkor az ország mező csak rejtve van, nem törölve és alapértelmezettként megkapja a Bolt beállított országának az értékét.<\/li>\n<li>JS fájlok kiegészítése verziószámmal és a kód átmozgatása a footer-be.<\/li>\n<li>Kisebb kód igazítások.<\/li>\n<\/ul>\n<h4>19.1<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-15<\/strong><\/p>\n<p>Fontos javítások a fordítási lehetőségekkel kapcsolatban.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A text domain módosítása a bővítmény slug-jára, mert csak azzal működik együtt a wp.org.<\/li>\n<li>Két modul javascript hivatkozásának a későbbi meghívása, hogy lehetőleg ne legyen konfliktusban más optimalizáló bővítményekkel.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Ideiglenesen a bővítmény fordítását mellékeltem, amíg a hivatalos forrásból nem lesz elérhető.<\/li>\n<\/ul>\n<h4>19.0<\/h4>\n<p><strong>Kiadás dátuma: 2020-02-11<\/strong><\/p>\n<p>Az irányítószám automatikus kitöltése most már a szállítási címnél is működik. A bővítmény elő lett készítve a fordíthatóságra. Viszont emiatt mindent át kell majd írni angolra, aztán lefordítani magyarra. Ez biztos hosszabb folyamat lesz, de megéri. 🙂<\/p>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>A bővítmény fordíthatóságának előkészítése.<\/li>\n<\/ul>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Autofill beállítása a szállítási címhez.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WordPress 5.3 főverzióval.<\/li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 3.9 főverzióval.<\/li>\n<li>Új frissítési mód bevezetése, hogy automatikusan feltöltse a wp.org repo-ba.<\/li>\n<\/ul>\n<h4>18.7<\/h4>\n<p><strong>Kiadás dátuma: 2019-11-03<\/strong><\/p>\n<p>Mostantól megjelenít egy figyelmeztető szöveget az Adószám megjelenítése opciónál, ha a Viszt Péter által írt Szamlazz.hu vagy Billingo bővítményeknél is be van kapcsolva az adószám mező. Ebben az esetben két adószám mező jelenik meg, így az egyik bővítménynél ki kell ezt az opciót kapcsolni.<\/p>\n<p>EGYÉB<\/p>\n<ul>\n<li>Kompatibilitás javítása a Viszt Péter által írt Szamlazz.hu és Billingo bővítményekhez.<\/li>\n<\/ul>\n<h4>18.6<\/h4>\n<p><strong>Kiadás dátuma: 2019-11-03<\/strong><\/p>\n<p>Ez a frissítés az irányítószám adatbázis frissítését tartalmazza. Így most már Budapest és a nagyvárosok is szerepelnek az adatbázisban.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Irányítószámok frissítése.<\/li>\n<li>Apró javítás a leírásban, hogy az admin menüpontot helyesen írja le.<\/li>\n<\/ul>\n<h4>18.5<\/h4>\n<p><strong>Kiadás dátuma: 2019-08-08<\/strong><\/p>\n<p>Ebben a kiadásban a HuCommerce menüpont átkerült a CPS Plugins főmenüpont alá, illetve néhány apró javítás és fejlesztés található. A frissítése biztonságos éles oldalakon is.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>A Plusz\/minusz mennyiségi gombok új HTML kódot kaptak, hogy bizonyos bővítményekkel ne legyen konfliktusban a megjelenésük.<\/li>\n<li>A Product quantity inputs template frissítve lett a 3.6.0 verzióra.<\/li>\n<li>A Fiók oldalon javítva lett az új logika szerint a nevek megjelenítése, így ott is akkor cserélődik meg a keresztnév és vezetéknév sorrendje, ha magyar nyelven nézi a látogató a weboldalt.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése az 5.3 verzióra.<\/li>\n<li>A HuCommerce menüpont átkerült a CPS Plugins menüpont alá.<\/li>\n<\/ul>\n<h4>18.4<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-25<\/strong><\/p>\n<p>Semmi funkcionális változtatás most, csak egy kis rendrakás. Kompatibilitás javítása a többi CherryPick Studios bővítménnyel.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>Az új CPS SDK kompatibilitás javítása.<\/li>\n<li>Admin header filterek csak a HuCommerce admin oldalán futnak le.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése az 5.2 verzióra.<\/li>\n<li>Új assets mappa, hogy logikusabb legyen a mappa struktúra.<\/li>\n<\/ul>\n<h4>18.3<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-18<\/strong><\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>WooCommerce bővítmény aktív állapotának az ellenőrzése most már minden esetben jól működik.<\/li>\n<\/ul>\n<h4>18.2<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-18<\/strong><\/p>\n<p>Betettem egy ellenőrzést, hogy a WooCommerce bővítmény aktív-e. Ha nem, akkor a kódok nem futnak le, csak egy figyelmeztetés jelenik meg az admin felületen.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>WooCommerce bővítmény ellenőrzése, hogy be van-e kapcsolva.<\/li>\n<\/ul>\n<h4>18.1<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-16<\/strong><\/p>\n<p>Ebben a verzióban az Avada sablonhoz lett egyedi CSS rendelve, hogy a Pénztár oldalon működjenek a magyar formátum javítások.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>CSS hozzáadása az Avada sablon megjelenítésének a javításához.<\/li>\n<\/ul>\n<h4>18.0<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-09<\/strong><\/p>\n<p>A mostani verzióban külön modul lett hozzáadva a Pénztár oldali módosításokhoz. Itt lehet vezérelni, hogy az Irányítószám és Város, valamint a Telefonszám és Email mezők egymás mellé kerüljenek, illetve az Ország és Rendelés jegyzetek mezőket ki is lehet kapcsolni.<\/p>\n<p>ŰJDONSÁGOK<\/p>\n<ul>\n<li>Pénztár oldal modul.<\/li>\n<\/ul>\n<p>EGYÉB<\/p>\n<ul>\n<li>CPS SDK frissítése a 3.0 verzióra.<\/li>\n<li>Admin oldal módosítások a CPS SDK 3.0 alapján.<\/li>\n<\/ul>\n<h4>17.0<\/h4>\n<p><strong>Kiadás dátuma: 2019-07-01<\/strong><\/p>\n<p>Ez a frissítés javítja a WPML bővítmény kompatibilitást és gyorsabb is a betöltés WPML használata mellett. A magyar formátum javítások logikája is megváltozott, mert most bizonyos mezők akkor módosulnak, ha magyar nyelven nézi a látogató, nem pedig akkor, ha Magyarország a számlázási cím. A Divi és Storefront sablonok esetén kisebb fordítással kapcsolatos javításokat is tartalmaz. Admin felületen megjelenik egy üdvözlés, ami lezárás után nem jelenik meg újra.<\/p>\n<p>JAVÍTÁSOK<\/p>\n<ul>\n<li>WPML kompatibilitás és gyorsítás.<\/li>\n<\/ul>\n<p>MÓDOSÍTÁSOK<\/p>\n<ul>\n<li>Pénztár mezők feltételei módosultak a nyelvre a számlázási cím helyett.<\/li>\n<\/ul>\n<p>ÚJDONSÁGOK<\/p>\n<ul>\n<li>Admin üdvözlés a bővítmény első bekapcsolása után vagy a mostani frissítés után.<\/li>\n<li>A Divi és Storefront sablonok esetén javítja a kosár ikon melletti szöveget, hogy &#8220;elem&#8221; helyett &#8220;termék&#8221; jelenjen meg a megfelelő többesszám kezeléssel.<\/li>\n<\/ul>\n<h4>16.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-06-11<\/li>\n<li>ÚJ &#8211; HuCommerce hírlevél feliratkozási lehetőség a HuCommerce admin oldaláról.<\/li>\n<\/ul>\n<h4>15.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-05-07<\/li>\n<li>JAVÍTÁS &#8211; Új opció validálása.<\/li>\n<\/ul>\n<h4>15.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-05-07<\/li>\n<li>ÚJ &#8211; Automatikus frissítés a Kosár oldalon. (Köszönet: Nagy Gábor &#8211; @xnagyg)<\/li>\n<li>JAVÍTÁS &#8211; Irányítószámok kiegészítése a budapesti kerületekkel. (Köszönet: Nagy Gábor &#8211; @xnagyg)<\/li>\n<\/ul>\n<h4>14.4<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-05-02<\/li>\n<li>JAVÍTÁS &#8211; Változó alapértelmezett értékének beállítása. (Köszönet: Szépe Viktor &#8211; @szepeviktor)<\/li>\n<\/ul>\n<h4>14.3<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-04-22<\/li>\n<li>MÓDOSÍTÁS &#8211; Kisebb változtatások a leírásban.<\/li>\n<li>Tesztelve a WooCommerce 3.6 verziójával.<\/li>\n<\/ul>\n<h4>14.2<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-04-15<\/li>\n<li>JAVÍTÁS &#8211; Ingyenes szállítás értesítés link módosítása, hogy mindig az Üzlet oldalra mutasson.<\/li>\n<\/ul>\n<h4>14.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-04-08<\/li>\n<li>JAVÍTÁS &#8211; Admin stílusok betöltése csak a szükséges oldalakon.<\/li>\n<\/ul>\n<h4>14.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-04-07<\/li>\n<li>ÚJ &#8211; CPS SDK az egységes kinézethez és funkcionalitáshoz a többi bővítmény esetén is.<\/li>\n<li>CPS SDK 1.0<\/li>\n<li>MÓDOSÍTÁS &#8211; Leírásokban és a bővítmény jellemzőinél CherryPick Solutions megemlítése.<\/li>\n<li>MÓDOSÍTÁS &#8211; Prémium verzió kezelésének előkészítése.<\/li>\n<\/ul>\n<h4>13.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-04-02<\/li>\n<li>ÚJ &#8211; Adatkezelési tájékoztató elfogadásának rögzítése a regisztrációs folyamatban.<\/li>\n<li>ÚJ &#8211; IP cím opcionális rögzítése a regisztrációs folyamatban.<\/li>\n<li>ÚJ &#8211; Regisztrációs adatok megjelenítése mind az admin felületen, mind a fiókadatok oldalon.<\/li>\n<\/ul>\n<h4>12.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-03-11<\/li>\n<li>ÚJ &#8211; Adatkezelési Tájékoztató kötelező elfogadtatása a regisztrációs űrlapnál.<\/li>\n<li>FIGYELEM! Ha a Jogi megfelelés opció aktív, akkor a regisztrációs űrlapnál automatikusan megjelenik az Adatkezelési Tájékoztató elfogadtatása pipa. Kikapcsolásához törölni kell az alapértelmezett szöveget a mezőben.<\/li>\n<\/ul>\n<h4>11.3<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-03-06<\/li>\n<li>JAVÍTÁS &#8211; Kosár oldalon a becslés címének javítása az Adószám megjelenítése esetén.<\/li>\n<\/ul>\n<h4>11.2<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-28<\/li>\n<li>JAVÍTÁS &#8211; Admin felület nyelvi beállítása.<\/li>\n<\/ul>\n<h4>11.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-27<\/li>\n<li>JAVÍTÁS &#8211; WPML ellenőrzése csak a front-end felületen.<\/li>\n<\/ul>\n<h4>11.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-17<\/li>\n<li>ÚJ &#8211; Facebook támogatói csoport jelentkezési lehetőség az admin felületről.<\/li>\n<li>ÚJ &#8211; Jogi szövegek elhelyezése a Pénztár oldalon a Megrendelés gomb fölött és\/vagy alatt közvetlenül.<\/li>\n<li>MÓDOSÍTÁS &#8211; Kisebb változtatások az admin felület megjelenésén.<\/li>\n<\/ul>\n<h4>10.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-17<\/li>\n<li>JAVÍTÁS &#8211; WPML bővítmény ellenőrzése, hogy ne generáljon végzetes hibát.<\/li>\n<\/ul>\n<h4>10.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-10<\/li>\n<li>ÚJ &#8211; Város automatikus kitöltése az irányítószám alapján.<\/li>\n<li>JAVÍTÁS &#8211; Kisebb javítások az admin felület megjelenítésén.<\/li>\n<\/ul>\n<h4>9.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-09<\/li>\n<li>ÚJ &#8211; Adószám bekérése vásárlásnál<\/li>\n<li>ÚJ &#8211; Jogi megfelelés (GDPR, ePrivacy, stb.)<\/li>\n<li>MÓDOSÍTÁS &#8211; A magyar név sorrend mostantól nem akkor érvényes, ha a cím magyar, hanem minden esetben, ha magyar nyelvű a webáruház.<\/li>\n<li>JAVÍTÁS &#8211; A magyar név sorrend kompatibilis a WPML bővítménnyel, így többnyelvű webáruháznál igazodik a választott nyelvhez.<\/li>\n<li>MÓDOSÍTÁS &#8211; Kisebb változtatás az admin megjelenésén.<\/li>\n<\/ul>\n<h4>8.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-06<\/li>\n<li>ÚJ &#8211; Ingyenes szállítás értesítés.<\/li>\n<li>JAVÍTÁS &#8211; Mező értékek validálásának a javítása.<\/li>\n<\/ul>\n<h4>7.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-06<\/li>\n<li>JAVÍTÁS &#8211; Vásárlás folytatása gomb class meghatározásainak módosítása a könnyebb formázás érdekében.<\/li>\n<\/ul>\n<h4>7.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-06<\/li>\n<li>ÚJ &#8211; Belépés és regisztráció utáni átirányítás.<\/li>\n<li>ÚJ &#8211; WPML és Polylang kompatibilitás a szöveges mezőkhöz.<\/li>\n<\/ul>\n<h4>6.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-02-06<\/li>\n<li>ÚJ &#8211; Vásárlás folytatása gomb megjelenítése a Kosár és\/vagy a Pénztár oldalakon. A gomb pozíciója is beállítható.<\/li>\n<\/ul>\n<h4>5.2<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-01-12<\/li>\n<li>MÓDOSÍTÁS- Admin UIkit frissítése.<\/li>\n<\/ul>\n<h4>5.1<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-01-12<\/li>\n<li>JAVÍTÁS &#8211; Divi sablon egyedi formázások a plusz\/minusz gombokhoz.<\/li>\n<li>JAVÍTÁS &#8211; Kisebb kód optimalizálás a plusz\/minusz gombok CSS formázásánál.<\/li>\n<\/ul>\n<h4>5.0<\/h4>\n<ul>\n<li>FRISSÍTÉS &#8211; 2019-01-11<\/li>\n<li>ÚJ &#8211; Mennyiségi gombok a termékekhez.<\/li>\n<li>ÚJ &#8211; A bővítmény nevének módosítása: HuCommerce | Magyar WooCommerce kiegészítések<\/li>\n<li>ÚJ &#8211; Admin beállítások a bővítményhez. Minden modul ki- bekapcsolható.<\/li>\n<li>ÚJ &#8211; Moduláris felépítés első lépései, felkészítés további hasznos funkciók optimális implementálásához.<\/li>\n<li>JAVÍTÁS &#8211; A WooCommerce myaccount\/form-edit-account.php sablon frissítése a 3.5.0 verzióra.<\/li>\n<li>MÓDOSÍTÁS &#8211; A megye mező elrejtésének a kikapcsolása már nem működik az eddigi globális változó megadásával, ezt is az admin felületen lehet beállítani.<\/li>\n<li>MÓDOSÍTÁS &#8211; Kisebb javítások a leírásban.<\/li>\n<\/ul>\n<h4>4.5<\/h4>\n<ul>\n<li>Kis javítás a leírásban.<\/li>\n<li>Tesztelve a WooCommerce 3.5 verziójával.<\/li>\n<li>Tesztelve a WordPress 5.0 verziójával.<\/li>\n<\/ul>\n<h4>4.4<\/h4>\n<ul>\n<li>FIX &#8211; A form-edit-account template fájl frissítése a legújabb verzióra.<\/li>\n<\/ul>\n<h4>4.3<\/h4>\n<ul>\n<li>Autofocus beállítása a vezetéknévre. (Köszönet: @nagygabor) #1<\/li>\n<\/ul>\n<h4>4.2<\/h4>\n<ul>\n<li>A keresztnév mező autofocus törlése. #1<\/li>\n<\/ul>\n<h4>4.1<\/h4>\n<ul>\n<li>A szerződési feltételek szövegének a felülírása már nem kell, mert az új verzióban helyesen jelenik meg.<\/li>\n<li>Tesztelve a WooCommerce 3.3 verziójával.<\/li>\n<\/ul>\n<h4>4.0<\/h4>\n<ul>\n<li>A bővítmény most már felül tudja írni a WooCommerce template fájlokat.<\/li>\n<li>Fiók adatoknál is jól jelenik meg a nevek sorrendje, ha a számlázási cím Magyarország.<\/li>\n<li>Szállítási és számlázási címeknél is helyes a név megjelenítése magyarországi cím esetén.<\/li>\n<li>Kisebb kód javítások.<\/li>\n<\/ul>\n<h4>3.0<\/h4>\n<ul>\n<li>A WooCommerce 3.2 verziónál a szerződési feltételek elfogadása szöveg fordítása nem jelenik meg, erre van egy javítás, amíg nem lesz elérhető a hivatalos fordítás javított változata.<\/li>\n<\/ul>\n<h4>2.0<\/h4>\n<ul>\n<li>Az Irányítószám és Város mezők nagy monitoron egymás mellé kerültek és az Ország mező alatt jelennek meg közvetlenül, hogy logikusabb legyen a megjelenési sorrend.<\/li>\n<li>A Megye mező elrejtését most már WooCommerce filter kezeli. (Köszönet: Viszt Péter &#8211; @passatgt)<\/li>\n<li>További címkék a bővítményhez a jobb keresési találatok miatt.<\/li>\n<\/ul>\n<h4>1.1<\/h4>\n<ul>\n<li>Kód elírás javítása.<\/li>\n<li>Leírások hozzáadása a függvényekhez.<\/li>\n<\/ul>\n<h4>1.0.0<\/h4>\n<ul>\n<li>Első kiadás.<\/li>\n<\/ul>\n",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Remek plugin, kiváló support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/gaborpalko\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/0f8a85e57c3d86cf2bb625f89cbdedc1?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/0f8a85e57c3d86cf2bb625f89cbdedc1?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/gaborpalko\/\" class=\"reviewer-name\">paleszp <small>(gaborpalko)<\/small><\/a> on <span class=\"review-date\">December 1, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Megoldás a sok (főleg) magyar területen elvárt idegesítő apróságra, amit \"egy kattintással megold\". Nélkülözhetetlen.<br \/>Nagyon gyors és hatékony támogatással még a free verzióhoz is.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\"><br \/><\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Ha több bevételt szeretnél a webshopodnak, akkor ajánlom!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/tartalomdesign\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/5d051c6fc76b3b26310b4093f968fa47?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/5d051c6fc76b3b26310b4093f968fa47?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/tartalomdesign\/\" class=\"reviewer-name\">tartalomdesign<\/a> on <span class=\"review-date\">December 12, 2022<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Minden Woocommerce webáruház tulajdonosnak csak ajánlani tudom! Sokkal személyre szabottabbá teszi a vásárlási folyamatot, ezáltal jobban optimlizált lesz a webshop. Ez nagyban hozzájárul a vásárlások számához, tehát a cégek bevételéhez. Ha röviden akarnám összefoglalni: fejlesztést nem igénylő, praktikus és nélkülözhetetlen megoldások. Ez a HuCommerce.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Hiánypótló!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/manubaba\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/89ac92a5c210647efb29e6ee6e9c382a?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/89ac92a5c210647efb29e6ee6e9c382a?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/manubaba\/\" class=\"reviewer-name\">manubaba<\/a> on <span class=\"review-date\">October 10, 2022<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Nagyon hasznos, köszönjük!<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Nagyon hasznos kiegészítő<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/mrdarkside\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/ad9ee4345d2789c50cdf753a6165a0a0?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/ad9ee4345d2789c50cdf753a6165a0a0?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/mrdarkside\/\" class=\"reviewer-name\">Gergely Csécsey <small>(mrdarkside)<\/small><\/a> on <span class=\"review-date\">August 11, 2022<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Nagyon tetszik, hogy a kiegészítő tulajdonképpen sok apró hasznos script gyűjteménye, ezek együtt tényleg nagyban megkönnyítik a magyarországi webshop üzemeltetést. :) <\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Tökéletes<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/jocek\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/e3610271e84840c9d258596148467379?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/e3610271e84840c9d258596148467379?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/jocek\/\" class=\"reviewer-name\">jocek<\/a> on <span class=\"review-date\">April 6, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Magyar woocommerce webáruházaknak megkönnyíti az életét!<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Köszi<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/mahone\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/963ccaf0adb2a7f5b00b6ba481428d2a?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/963ccaf0adb2a7f5b00b6ba481428d2a?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/mahone\/\" class=\"reviewer-name\">mahone<\/a> on <span class=\"review-date\">February 19, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Köszönöm a bővítményt, szuper!<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Egyedülálló :)<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/papireper\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1b3e04139cf790d72006f38fdf436745?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1b3e04139cf790d72006f38fdf436745?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/papireper\/\" class=\"reviewer-name\">Betty Maszlay <small>(papireper)<\/small><\/a> on <span class=\"review-date\">January 14, 2021<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Fantasztikus, hiánypótló bővítmény, köszönjük a munkádat!<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Berill<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/berill\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/a4de5d4e01d0c705253afddb50e1eeaa?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/a4de5d4e01d0c705253afddb50e1eeaa?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/berill\/\" class=\"reviewer-name\">berill<\/a> on <span class=\"review-date\">November 13, 2020<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Szuper plugin! Sok problémát egy gombnyomásra megold<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Csodálatos!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/zocimike\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/b18c17eeaac1833a6a191b8d314a30ce?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/b18c17eeaac1833a6a191b8d314a30ce?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/zocimike\/\" class=\"reviewer-name\">zocimike<\/a> on <span class=\"review-date\">October 18, 2020<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Hiánypótló és magyar.<\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Szuper!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/devgreg\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/2c7cac69ec53562d343d3b9715aaff34?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/2c7cac69ec53562d343d3b9715aaff34?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/devgreg\/\" class=\"reviewer-name\">devgreg<\/a> on <span class=\"review-date\">October 13, 2020<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\">Egyszerű és hasznos bővítmény, <em>szinte<\/em> kötelező<\/div>\n<\/div>\n"
    },
    "short_description": "Hasznos javítások a magyar WooCommerce webáruházakhoz.",
    "description": "<blockquote>\n<p>Hasznos javítások a magyar WooCommerce webáruházakhoz.<\/p>\n<\/blockquote>\n<p>A WooCommerce a világ és most már Magyarország legnépszerűbb webáruház platformja is. A HuCommerce kiegészítővel könnyebben és gyorsabban indíthatod a webáruházad, mert a legtöbb fontos funkciót és fejlesztést egy gombnyomással helyettesítheted.<\/p>\n<p>A HuCommerce bővítmény ingyenes változata most már évek óta a magyar WooCommerce webáruház tulajdonosok kedvenc kiegészítője. Több, mint 10000 webáruházban megtalálható és a letöltések száma folyamatosan nő.<\/p>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.<\/p>\n<p>A HuCommerce ingyenes verziója rengeteg olyan apró, hasznos vagy akár jogilag kötelező funkciót tartalmaz, ami hiányzik a WooCommerce bővítményből. Többek között rendbe teszi a vezetéknév és keresztnév sorrendjét és az adószám mezőt is hozzáadja a pénztárhoz, de folyamatosan bővül hasonló praktikus, hasznos vagy kötelező funkciókkal.<\/p>\n<p>A HuCommerce Pro előfizetés éves díja egy kezdő magyar fejlesztő pár órás munkadíja, miközben neked napokat vagy akár hónapokat spórol meg fejlesztési és kutatási oldalon. Ez a kiegészítő a leghasznosabb és nélkülözhetetlen funkciókkal egészíti ki a webáruházad. A fizetős konstrukció biztosítja, hogy folyamatosan bővüljön újabb hasznos funkciókkal.<\/p>\n<p>A funkciók folyamatosan bővülnek, de mindenki megírhatja a véleményét, ötletét, hogyan tudjuk egyre jobbá tenni ezt a bővítményt.<\/p>\n<h4>HuCommerce támogatói Facebook csoport<\/h4>\n<p>Csatlakozzatok a HuCommerce hivatalos támogatói Facebook csoportjához, ahol lehet a bővítménnyel kapcsolatban kérdezni, beszélgetni, ötletelni. Mindenkit szívesen látunk: <a href=\"https:\/\/www.facebook.com\/groups\/HuCommerce.hu\/\" rel=\"nofollow ugc\">HuCommerce Facebook csoport<\/a><\/p>\n<h3>HuCommerce (ingyenes)<\/h3>\n<p>Több, mint 10000 webáruház tulajdonos választása Magyarországon. Rengeteg hasznos funkció, kötelező választás minden magyar WooCommerce webáruházhoz.<\/p>\n<p><a href=\"https:\/\/www.hucommerce.hu\/bovitmenyek\/hucommerce\/\" rel=\"nofollow ugc\">Bővebben a HuCommerce bővítményről →<\/a><\/p>\n<p><strong>HuCommerce ingyenes funkciói:<\/strong><\/p>\n<ul>\n<li>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)<\/li>\n<li>Adószám bekérése vásárlásnál<\/li>\n<li>Megye mező elrejtése<\/li>\n<li>Város automatikus kitöltése az irányítószám alapján<\/li>\n<li>Pénztár oldal módosítások<\/li>\n<li>Kupon mező módosítások<\/li>\n<li>Plusz\/minusz mennyiségi gombok a termékekhez<\/li>\n<li>Automatikus frissítés a Kosár oldalon<\/li>\n<li>Egy termék vásárlásonként<\/li>\n<li>Kosár átirányítása a Pénztár oldalra<\/li>\n<li>Vásárlás folytatása gomb megjelenítése a Kosár és\/vagy a Pénztár oldalakon<\/li>\n<li>Belépés és regisztráció utáni átirányítás<\/li>\n<li>Szállítási módok elrejtése<\/li>\n<li>Egyedi “Kosárba teszem” gombok<\/li>\n<li>Termék extra beállítások<\/li>\n<li>SMTP szolgáltatás beállítása<\/li>\n<li>Katalógus mód<\/li>\n<li>Fordítási hiányosságok javítása<\/li>\n<li>WPML és Polylang kompatibilitás<\/li>\n<li>Alap ügyfélszolgálat és támogatás<\/li>\n<li>További funkciók hamarosan…<\/li>\n<\/ul>\n<h3>HuCommerce Pro (fizetős)<\/h3>\n<p>A HuCommerce kibővített kiadása, további hasznos és folyamatosan bővülő funkciókkal. Támogatói verzió, amivel te is hozzájárulsz a további fejlesztésekhez.<\/p>\n<p><a href=\"https:\/\/www.hucommerce.hu\/bovitmenyek\/hucommerce\/\" rel=\"nofollow ugc\">Bővebben a HuCommerce Pro bővítményről →<\/a><\/p>\n<blockquote>\n<p><a href=\"https:\/\/www.hucommerce.hu\/hc\/hirlevel-feliratkozas\/\" rel=\"nofollow ugc\">Iratkozz fel a HuCommerce hírlevélre<\/a> és cserébe kapsz tőlünk egy 5.000 Ft értékű kupont, amit a HuCommerce Pro előfizetésnél beválthatsz.<\/p>\n<\/blockquote>\n<p><strong>HuCommerce Pro további funkciói:<\/strong><\/p>\n<ul>\n<li>Pénztár mezők ellenőrzése<\/li>\n<li>Ingyenes szállítás értesítés<\/li>\n<li>Kosár ürítése gomb<\/li>\n<li>Termék ár történet (új Fogyasztóvédelemi rendelet)<\/li>\n<li>Termék ár kiegészítések<\/li>\n<li>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)<\/li>\n<li>Fizetési módok korlátozása<\/li>\n<li>Globális adatok, amiket shortcode-dal lehet bárhol megjeleníteni<\/li>\n<li>Kiemelt ügyfélszolgálat és támogatás<\/li>\n<li>További funkciók hamarosan…<\/li>\n<\/ul>\n<p><strong>HuCommerce tudásbázis<\/strong><\/p>\n<p>A bővítmény használatáról, a Pro verzió aktiválásáról és az egyes modulokról részletesen a <a href=\"https:\/\/www.hucommerce.hu\/tudasbazis\/\" rel=\"nofollow ugc\">HuCommerce tudásbázisunkban<\/a> olvashatsz.<\/p>\n<h4>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)<\/h4>\n<p>A keresztnév és vezetéknév sorrendjének a megfordítása, ha a webáruház magyar nyelvre van állítva. Ahogy mi szeretjük. 🙂 Mindezt úgy, hogy reszponzív nézetben is jó legyen és a CRM, számlázó programok is tudják értelmezni.<\/p>\n<p>A megjelenítés kompatibilis a WPML bővítménnyel, így többnyelvű webáruháznál is magyar sorrendben jelenik meg a név, ha magyar nyelven nézik a webáruházat a látogatók.<\/p>\n<p>A név sorrendje a megrendelés visszaigazolásánál, a vásárló fiókjában és az értesítő levelekben is jól jelenik meg.<\/p>\n<h4>Adószám bekérése vásárlásnál<\/h4>\n<p>A Pénztár oldalon a Cégnév mező alatt már Adószámot is be lehet kérni. Az Adószám mező csak akkor jelenik meg, ha a Cégnév mezőbe lett írva. Az adószám ebben az esetben kötelező mező. Az adószám a rendelésen kívül az adott felhasználó profil adatainál is elmentésre kerül. Az adószám megjelenik mind a visszaigazoláson, mind a rendelés szerkesztésénél, valamint az értesítő levelekben is.<\/p>\n<p>Már maszkolás és validálás is beállítható az Adószám mezőhöz és placeholder megjelenítése is bekapcsolható, ami azoknál a sablonoknál nagyon jól jön, amiknél nem jelennek meg a mezők címkéi.<\/p>\n<h4>Megye mező elrejtése<\/h4>\n<p>Mert ezt nálunk nem szokás használni, így csak plusz felesleges lépés. De ha valakinek nagyon kell, akkor visszaállítható.<\/p>\n<h4>Pénztár mezők ellenőrzése<\/h4>\n<p>Beállítható, hogy a Pénztár oldalon a Számlázási adatoknál az Adószám, Irányítószám és Telefonszám mezőket, a Szállítási adatoknál pedig az Irányítószámot maszkolja, azaz formai szempontból validálja, illetve a megadott beviteli értéket ellenőrizze. Így a következő értékek lesznek érvényben:<\/p>\n<ul>\n<li>Számlázási Adószám: 00000000-0-00 (13 karakter), 00000000000 (11 szám), HU00000000 (HU előtag és 8 szám)<\/li>\n<li>Számlázási és Szállítási Irányítószám: 0000 (4 karakter)<\/li>\n<li>Számlázási Telefonszám: +36000000000 (11-12 karakter)<\/li>\n<\/ul>\n<h4>Város automatikus kitöltése az irányítószám alapján<\/h4>\n<p>A Pénztár oldalon az irányítószám mező kitöltése után automatikusan megjeleníti a várost. Ha már manuálisan lett módosítva a város, akkor nem módosítja az irányítószám alapján.<\/p>\n<p>Vannak olyan irányítószámok, amikkel nem működik, mert vagy még hiányzik az indexből vagy egy irányítószám több településhez is tartozik. Igyekszem az ilyen hiányosságokat javítani.<\/p>\n<h4>Fordítási hiányosságok javítása<\/h4>\n<p>Ideiglenes fordítási hiányosságok javítása a WooCommerce bővítményhez és a legnépszerűbb sablonokhoz (Divi, Storefront), amíg a hivatalos fordításban esetleg nem jelenik meg vagy nem frissíti a rendszer. Én hivatalos szerkesztője is vagyok a magyar WooCommerce fordítási csapatának, ezért ott sokmindent megcsinálok, de néha szükség van erre a kis trükkre.<\/p>\n<h4>Alap ügyfélszolgálat és támogatás<\/h4>\n<p>Ügyfélszolgálati kérdésekkel kapcsolatban a <a href=\"https:\/\/www.facebook.com\/groups\/HuCommerce.hu\/\" rel=\"nofollow ugc\">Facebook csoportban<\/a> és itt, a <a href=\"https:\/\/wordpress.org\/support\/plugin\/surbma-magyar-woocommerce\/\" rel=\"ugc\">WordPress.org saját fórum felületén<\/a> van lehetőség írni nekünk.<\/p>\n<h4>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)<\/h4>\n<p>Lehetőség van az Általános Szerződési Feltételek és az Adatkezelési tájékoztató aktív cselekvésen alapuló elfogadtatására, azaz ki kell pipálnia a vásárlónak ezek elfogadását, mielőtt a rendelést leadhatná. Az adatok a rendeléseknél kerülnek elmentésre és a rendelés szerkesztése oldalon megjelenik az elfogadott státusz. Ebben az esetben a vásárló profil adatainál nem kerül elmentésre az elfogadás, így azt bejelentkezve is minden vásárlás alkalmával el kell fogadnia.<\/p>\n<p>Opcionális a két mező használata, így ha valakinek csak az egyik elfogadtatására és megerősítésére van szüksége, akkor egyik vagy másik kikapcsolható.<\/p>\n<p>További két extra mező is hozzáadható, amihez teljesen szabadon lehet szöveget, linket megadni. Ezekre további jogi megfelelés céljából lehet szükség, ha az adott webáruház megköveteli ezt. Amennyiben bármelyik mező aktiválva lett, azok mindenképpen kötelezőek.<\/p>\n<p>A Pénztár oldalon a Megrendelés gomb fölött és\/vagy alatt közvetlenül elhelyezhető jogi szöveg, ami esetleg fontos vagy kötelező eleme a vásárlási folyamatnak. Ilyen például a távollévők közötti szerződéshez szükséges tudomásulvétel vagy a &#8220;fizetési kötelezettséggel járó megrendelés&#8221; kötelező megjelenítése a megrendelés során.<\/p>\n<p>A regisztrációs űrlapnál is kérhető az Adatkezelési Tájékoztató kötelező elfogadtatása. Ez az adat már elmentésre kerül a felhasználó profil adatainál. Külön beállítható, hogy a felhasználó IP címét is elmentse a rendszer. A regisztrációs adatokat (elfogadás ténye, regisztráció dátuma, IP cím) mind az admin felületen, mind pedig a felhasználó fiókadatainál megjeleníti, de ezek a mezők nem módosíthatók sem a felhasználók, sem az adminisztrátorok részéről.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.<\/p>\n<\/blockquote>\n<h4>Termék ár történet (új Fogyasztóvédelemi rendelet: 4\/2009. (I. 30.) NFGM-SZMM együttes rendelet 2\/A. §)<\/h4>\n<p>Ez a modul nincs minden körülmény között tesztelve és nem tudja 100%-ban teljesíteni a funkcionális és\/vagy jogi igényeket, feltételeket. Ezért a használata esetén fokozott figyelmet igényel.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A HuCommerce ügyfélszolgálatára beküldött visszajelzések és javaslatok jelentősen gyorsítják a modul fejlesztését, ezért szívesen várjuk az ilyen témájú megkereséseket. Köszönjük!<\/p>\n<\/blockquote>\n<p>Az Európai Unió területén, így Magyarországon is 2022. május 28-tól egységes szabályok vonatkoznak az árcsökkentésre.<\/p>\n<p>Az új szabályozás célja annak megakadályozása, hogy a kereskedők megtévesztő árcsökkentéseket alkalmazzanak azzal, hogy az akciók előtt megemeljék a korábbi árat és ezáltal megtévesszék a fogyasztókat az árengedmény mértékével kapcsolatban.<\/p>\n<blockquote>\n<p>A 93\/13\/EGK tanácsi irányelvnek, valamint a 98\/6\/EK, a 2005\/29\/EK és a 2011\/83\/EU európai parlamenti és tanácsi irányelvnek az uniós fogyasztóvédelmi szabályok hatékonyabb végrehajtása és korszerűsítése tekintetében történő módosításáról szóló, 2019. november 27-i (EU) 2019\/2161 európai parlamenti és tanácsi irányelv érintett rendelkezései a termékek eladási ára és egységára, továbbá a szolgáltatások díja feltüntetésének részletes szabályairól szóló 4\/2009. (I. 30.) NFGM-SZMM együttes rendelet (a továbbiakban: Árrendelet) 2\/A. §-ában kerültek átültetésére.<\/p>\n<\/blockquote>\n<p>Ez a modul biztosítja a rendeletnek való megfelelést. A termékhez kapcsolódó árak folyamatos mentésével és annak statisztikai megjelenítésével egy átfogó képet ad a webáruház tulajdonosnak az árváltozás és az aktuális kedvezmény rendelet alapján történő meghatározásáról. A modul minden termékhez létrehoz egy adatlapot, ahol táblázatban és vonal diagramon is mutatja az adatokat. A teljes adatbázis itt JSON és CSV formátumban kimásolható.<\/p>\n<p>A termék végoldalon pedig automatikusan létrehozott és számolt vagy manuálisan megadott szöveg is megadható, ami biztosítja a látogatók megfelelő információval való ellátását. Ezáltal tud megfelelni a webáruház a Fogyasztóvédelmi elvárásoknak.<\/p>\n<blockquote>\n<p><strong>FIGYELEM!<\/strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.<\/p>\n<\/blockquote>\n<h4>Pénztár oldal módosítások<\/h4>\n<p>Céges számlázási adatok feltételes megjelenítése. Ebben az esetben egy checkbox jelenik meg és ha a látogató bepipálja, akkor jelennek csak meg a céges számlázás mezői, mint például a Cégnév és Adószám.<\/p>\n<p>A Cégnév és Adószám mezők feltételes megjelenítése csak akkor, ha a számlázási cím Magyarország. Minden más ország esetében elrejti ezeket a mezőket.<\/p>\n<p>A Cégnév és Adószám, az Irányítószám és Város, valamint a Telefonszám és Email cím mezőket nagy monitoron be lehet állítani, hogy egymás mellé kerüljenek. Az Irányítószám és Város mezők az Ország mező alatt jelennek meg közvetlenül, hogy logikusabb legyen a megjelenési sorrend.<\/p>\n<p>Az Ország és a Rendelés jegyzetek mezőket akár ki is lehet kapcsolni, ha ezek a mezők nem relevánsak a te webáruházadnál. Ha az Ország mezőt elrejted, akkor a Bolt beállításainál kiválasztott ország lesz alapértelmezettként beállítva megrendelésnél.<\/p>\n<h4>Kupon mező módosítások<\/h4>\n<p>A Pénztár oldalon megjelenő kupon mező áthelyezése, elrejtése vagy éppen mindig láthatóvá tétele lehetséges ezzel a modullal.<\/p>\n<h4>Plusz\/mínusz mennyiségi gombok a termékekhez<\/h4>\n<p>A WooCommerce alapból csak egy szám típusú mezőt használ a termékek mennyiségénél, de ez felhasználói szemmel nézve nem elég. Ez a funkció a mennyiségi mező elé és után betesz egy plusz\/minusz gombot, amivel a felhasználók könnyedén tudják változtatni a mennyiséget mind a termék végoldalon, mind pedig a kosár összegzés oldalán.<\/p>\n<p>FIGYELEM! A gombok a különböző sablonoknál esetleg másképp vagy nem megfelelően jelenhetnek meg. Ez minden esetben javítható egy kis CSS segítségével. Én azon vagyok, hogy a lehető legnépszerűbb sablonoknál már automatikusan jól nézzen ki, illetve kap egy alap formázást is, hogy a legtöbb esetben megfelelő legyen, de biztosan lesznek olyan sablonok, ahol ez még így is igényel majd további CSS formázást. A bővítmény támogatás fórumában lehet ezeket jelezni, de nem tudom vállalni, hogy mindenkinek, gyorsan tudok segíteni.<\/p>\n<p>Jelenleg ezeket a sablonokat biztosan támogatja alapból a bővítmény:<\/p>\n<ul>\n<li>Storefront<\/li>\n<li>Divi<\/li>\n<li>Avada<\/li>\n<\/ul>\n<h4>Automatikus frissítés a Kosár oldalon<\/h4>\n<p>A Kosár oldalon a termékek mennyiségének a módosításakor nincs szükség a &#8220;Kosár frissítése&#8221; gomb megnyomására a darabszám módosítása után, mert így automatikusan frissül a Kosár tartalma.<\/p>\n<h4>Egy termék vásárlásonként<\/h4>\n<p>A modul bekapcsolásával a látogatók egy adott vásárlási folyamatban csak egy terméket tudnak a kosárba tenni és megvásárolni. További vásárláshoz újabb rendelést kell leadniuk.<\/p>\n<h4>Kosár átirányítása a Pénztár oldalra<\/h4>\n<p>A modul lehetővé teszi, hogy a Kosár oldal automatikusan a Pénztár oldalra legyen irányítva, ezzel is gyorsítva a vásárlási folyamatot. Mindegy, hogy melyik oldalt használod Kosár oldalként vagy Pénztár oldalként, az átirányítás mindig működni fog.<\/p>\n<h4>Vásárlás folytatása gomb megjelenítése a Kosár és\/vagy a Pénztár oldalakon<\/h4>\n<p>A Kosár és a Pénztár oldalakon megjeleníthető egy plusz Vásárlás folytatása gomb, ami az üzlet oldalra viszi a látogatókat, hogy esetleg még tovább válogassanak a termékek között. Sokszor csak kíváncsiságból kattintanak a látogatók a Kosár gombra, de még nem fejezték be a vásárlásukat.<\/p>\n<p>A gombok pozíciója mind a Kosár, mind a Pénztár oldalon beállítható, valamint van lehetőség egyedi üzenet megjelenítésére is bizonyos pozíciókban.<\/p>\n<h4>Belépés és regisztráció utáni átirányítás<\/h4>\n<p>Beállítható, hogy a látogatók a belépés és regisztráció után a meghatározott oldalra legyenek automatikusan átirányítva. A belépéshez és regisztrációhoz külön-külön állítható be a cél URL. A Pénztár oldalon nem veszi figyelembe az egyedi beállítást, hogy ott ne zavarja a vásárlás befejezését.<\/p>\n<h4>Ingyenes szállítás értesítés<\/h4>\n<p>A termék listaoldalakon, illetve a Kosár és Pénztár oldalakon jeleníthető meg az értesítés, hogy mennyi vásárlási összeg hiányzik még az ingyenes szállításhoz. A szöveg módosítható és többnyelvűsíthető.<\/p>\n<h4>Szállítási módok elrejtése<\/h4>\n<p>Ingyenes szállítás esetén ezzel a modullal elrejtheted az összes nem releváns szállítási módot. Lehetőséged van a személyes átvétel és a “pont” szállítási módok megtartására is.<\/p>\n<h4>Egyedi &#8220;Kosárba teszem&#8221; gombok<\/h4>\n<p>Lehetőséged van teljesen egyedi szövegek megadására a “Kosárba teszem” szöveg helyett. Sőt a különböző termék típusok (egyszerű, előfizetés, tagság, stb.) esetén különböző szövegeket is megadhatsz.<\/p>\n<h4>Kosár ürítése gomb<\/h4>\n<p>A Kosár és Pénztár oldalakon elhelyezhető gombbal a vásárló egy kattintásra tudja törölni az összes kosárban lévő terméket. A gomb csak akkor jelenik meg, ha minimum 2 termék van a kosárban. A véletlen törlés elkerülése végett a teljes törlést meg kell erősítenie a vásárlónak.<\/p>\n<h4>Termék ár kiegészítések<\/h4>\n<p>A Termékek árához lehet beállítani elő- és utótagokat. Előtag lehet például a &#8220;Csak ma&#8221;, &#8220;Nettó&#8221; stb., utótag pedig lehet a &#8220;\/ pár&#8221;, &#8220;\/ kg&#8221;, &#8220;(darabár)&#8221; vagy bármi, ami az adott termék árára jellemző. Az előtagot és utótagot a HuCommerce beállításainál globálisan lehet beállítani, azaz az ott megadott értékek minden terméknél meg fognak jelenni. Ezt a globális beállítást minden terméknél egyesével felül lehet írni, ahol egyedi elő- és utótagok is megadhatók vagy éppen letilthatók adott terméknél. Az előtagokat és utótagokat külön lehet meghatározni a gyüjtő (archívum) oldalakhoz és a termék végoldalakhoz.<\/p>\n<h4>Termék extra beállítások<\/h4>\n<p>Új lehetőségekkel bővülnek a Termékekhez kapcsolódó beállítások. Ez a funkció folyamatosan fog bővülni.<\/p>\n<p><strong>Jelenleg ezek a lehetőségek lettek beépítve:<\/strong><\/p>\n<ul>\n<li>Kosárba tesz gomb – A termék lista oldalakon az egyes termékekhez hozzá lehet adni a Kosárba tesz gombot.<\/li>\n<li>Termék alcím hozzáadása – Egyedi alcímek adhatók a Termékekhez, melyek a listaoldalon és a Termék végoldalon is megjelennek. Az alcím a cím heading HTML kódjába lesz illesztve külön, szemantikus megjelöléssel. Ezt fontos figyelembe venni keresőoptimalizálási (SEO) szempontból is!<\/li>\n<li>Kapcsolódó termékek kikapcsolása a termék végoldalakon<\/li>\n<li>Termék lista oldal: termékek számának beállítása oldalanként<\/li>\n<li>Termék lista oldal: oszlopok számának beállítása<\/li>\n<li>Upsell termékek száma a termék végoldalakon<\/li>\n<li>Upsell termékek száma soronként a termék végoldalakon<\/li>\n<li>Kapcsolódó termékek száma a termék végoldalakon<\/li>\n<li>Kapcsolódó termékek száma soronként a termék végoldalakon<\/li>\n<\/ul>\n<h4>Fizetési módok korlátozása<\/h4>\n<p>Minden vásárlónál külön állíthatod be, hogy milyen fizetési módot választhat a Pénztár oldalon. Így könnyedén kikapcsolhatsz egy-egy fizetési módot mondjuk azoknál a vásárlóknál, akiknél rendszeres volt az utánvétes rendelés esetén a nem fizetés és elállás. De bármilyen más okból is kikapcsolhatsz bizonyos fizetési módokat adott vásárlóknál.<\/p>\n<h4>Globális adatok<\/h4>\n<p>Előre beállítható adatok, amiket rövidkódokkal a webáruház bármely részén megjeleníthetsz. Például a webáruház telefonszáma, ami ha egyszer változik, csak itt kell módosítanod és minden helyen egyszerre a jó telefonszám fog megjelenni. Egyes adatok aktívan jelennek meg, így a telefonszám egy kattintással hívható lesz és az email cím is kattintható formában és titkosítva jelenik meg, hogy a botok ne tudják kiolvasni a kódból.<\/p>\n<p>Ezek az adatok állíthatók be:<\/p>\n<ul>\n<li>Név<\/li>\n<li>Cégnév<\/li>\n<li>Székhely<\/li>\n<li>Adószám<\/li>\n<li>Cégjegyzékszám<\/li>\n<li>Cím<\/li>\n<li>Bankszámlaszám<\/li>\n<li>Mobiltelefon<\/li>\n<li>Telefon<\/li>\n<li>Email cím<\/li>\n<li>Rólunk szöveg<\/li>\n<\/ul>\n<h4>SMTP szolgáltatás beállítása<\/h4>\n<p>Minden webáruházban fontos a kommunikáció az érdeklődővel és vásárlóval mind a vásárlás előtt, mind pedig a megrendelés leadása után. Ezért nagyon fontos, hogy a levelek kézbesítése biztonságos és megbízható legyen. Ezt a külső SMTP szolgáltatók tudják biztosítani, mint például a Mailgun vagy Sendgrid.<\/p>\n<p>A HuCommerce Pro SMTP beállításával összekapcsolhatod a webáruházad levelezését az SMTP szolgáltatóval.<\/p>\n<h4>Katalógus mód<\/h4>\n<p>Ezzel a modullal az értékesítéshez kapcsolódó funkciók és oldalak kapcsolhatók ki. Tehát a termékeket nem lehet kosárba tenni, nincs Pénztár oldal vagy fiók kezelés. A weboldal és a WooCommerce így katalógusként használható.<\/p>\n<h4>WPML és Polylang kompatibilitás<\/h4>\n<p>A szöveges mezők kompatibilisek a WPML, Polylang bővítményekkel, így azok beállíthatók a különböző nyelveken is.<\/p>\n<h4>Kiemelt ügyfélszolgálat és támogatás<\/h4>\n<p>A HuCommerce Pro ügyfelek számára email és live chat csatornákon is biztosítjuk az ügyfélszolgálati ügyek intézését és a támogatást a bővítményhez.<\/p>\n<blockquote>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.<\/p>\n<\/blockquote>\n<h3>Szeretnél többet tudni rólunk és a szolgáltatásainkról?<\/h3>\n<p>Nézd meg a weboldalunkat: <a href=\"https:\/\/www.hucommerce.hu\/\" rel=\"nofollow ugc\">HuCommerce.hu →<\/a><\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.3.1.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "hungarian": "hungarian",
        "magyar": "magyar",
        "magyarorszag": "magyarország",
        "webaruhaz": "webáruház",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "2023.3.1",
    "versions": {
        "1.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.1.1.zip",
        "10.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.10.0.zip",
        "10.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.10.1.zip",
        "11.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.11.0.zip",
        "11.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.11.1.zip",
        "11.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.11.2.zip",
        "11.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.11.3.zip",
        "12.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.12.0.zip",
        "13.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.13.0.zip",
        "14.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.14.0.zip",
        "14.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.14.1.zip",
        "14.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.14.2.zip",
        "14.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.14.3.zip",
        "14.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.14.4.zip",
        "15.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.15.1.zip",
        "16.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.16.0.zip",
        "17.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.17.0.zip",
        "18.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.0.zip",
        "18.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.1.zip",
        "18.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.2.zip",
        "18.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.3.zip",
        "18.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.4.zip",
        "18.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.5.zip",
        "18.7": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.18.7.zip",
        "19.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.19.0.zip",
        "19.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.19.1.zip",
        "2.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2.0.zip",
        "20.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.20.0.zip",
        "2022.0.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.0.3.zip",
        "2022.1.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.1.0.zip",
        "2022.1.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.1.1.zip",
        "2022.1.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.1.3.zip",
        "2022.1.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.1.5.zip",
        "2022.2.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.2.0.zip",
        "2022.2.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.2.1.zip",
        "2022.3.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.3.0.zip",
        "2022.3.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.3.1.zip",
        "2022.3.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.3.2.zip",
        "2022.3.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.3.4.zip",
        "2022.3.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.3.5.zip",
        "2022.4.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.4.0.zip",
        "2022.4.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2022.4.1.zip",
        "2023.1.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.1.0.zip",
        "2023.2.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.0.zip",
        "2023.2.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.1.zip",
        "2023.2.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.2.zip",
        "2023.2.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.3.zip",
        "2023.2.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.4.zip",
        "2023.2.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.2.5.zip",
        "2023.3.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.3.0.zip",
        "2023.3.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.2023.3.1.zip",
        "21.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.0.zip",
        "21.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.1.zip",
        "21.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.2.zip",
        "21.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.3.zip",
        "21.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.4.zip",
        "21.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.5.zip",
        "21.6": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.21.6.zip",
        "22.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.22.0.zip",
        "22.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.22.1.zip",
        "23.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.0.zip",
        "23.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.1.zip",
        "23.10": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.10.zip",
        "23.11": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.11.zip",
        "23.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.2.zip",
        "23.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.3.zip",
        "23.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.4.zip",
        "23.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.5.zip",
        "23.6": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.6.zip",
        "23.7": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.7.zip",
        "23.8": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.8.zip",
        "23.9": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.23.9.zip",
        "24.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.24.0.zip",
        "25.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.25.0.zip",
        "26.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.0.zip",
        "26.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.1.zip",
        "26.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.2.zip",
        "26.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.3.zip",
        "26.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.4.zip",
        "26.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.5.zip",
        "26.6": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.6.zip",
        "26.7": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.26.7.zip",
        "27.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.27.0.zip",
        "27.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.27.1.zip",
        "27.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.27.2.zip",
        "28.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.28.0.zip",
        "29.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.0.zip",
        "29.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.1.zip",
        "29.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.2.zip",
        "29.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.3.zip",
        "29.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.4.zip",
        "29.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.5.zip",
        "29.6": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.29.6.zip",
        "3.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.3.0.zip",
        "30.0.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.30.0.0.zip",
        "30.0.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.30.0.1.zip",
        "30.1.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.30.1.0.zip",
        "30.2.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.30.2.0.zip",
        "30.3.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.30.3.0.zip",
        "4.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.0.zip",
        "4.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.1.zip",
        "4.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.2.zip",
        "4.3": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.3.zip",
        "4.4": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.4.zip",
        "4.5": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.4.5.zip",
        "5.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.5.0.zip",
        "5.2": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.5.2.zip",
        "6.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.6.0.zip",
        "7.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.7.0.zip",
        "7.1": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.7.1.zip",
        "8.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.8.0.zip",
        "9.0": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.9.0.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/surbma-magyar-woocommerce.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https:\/\/www.hucommerce.hu\/ugyfelszolgalat\/",
    "donate_link": "",
    "banners": {
        "low": "https:\/\/ps.w.org\/surbma-magyar-woocommerce\/assets\/banner-772x250.jpg?rev=2541312",
        "high": "https:\/\/ps.w.org\/surbma-magyar-woocommerce\/assets\/banner-1544x500.jpg?rev=2541312"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/surbma-magyar-woocommerce\/assets\/icon-128x128.jpg?rev=2541312",
        "2x": "https:\/\/ps.w.org\/surbma-magyar-woocommerce\/assets\/icon-256x256.jpg?rev=2541312"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "surbma-magyar-woocommerce",
            "language": "hu_HU",
            "version": "2023.3.0",
            "updated": "2023-12-31 11:25:27",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/surbma-magyar-woocommerce\/2023.3.0\/hu_HU.zip"
        }
    ]
}