{
    "name": "Tagembed: Embed Twitter Feed, Google Reviews, YouTube Videos, TikTok, RSS Feed &amp; More Social Media Feeds",
    "slug": "tagembed-widget",
    "version": "5.1",
    "author": "<a href=\"https:\/\/tagembed.com\/\">Tagembed<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/tagembed\/",
    "contributors": {
        "tagembed": {
            "profile": "https:\/\/profiles.wordpress.org\/tagembed\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/08747b26698b3afe1c3174b9c3058e7a?s=96&d=monsterid&r=g",
            "display_name": "Tagembed"
        }
    },
    "requires": "3.0",
    "tested": "6.5.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 31,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 9
    },
    "num_ratings": 40,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/tagembed-widget\/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 8000,
    "downloaded": 91653,
    "last_updated": "2024-04-16 4:20am GMT",
    "added": "2020-12-01",
    "homepage": "https:\/\/tagembed.com\/",
    "sections": {
        "description": "<p>Tagembed is a leading <strong>social media aggregator<\/strong> tool that lets users to aggregate (hashtag feed, handle feed, page feed, album feed), curate and embed <a href=\"https:\/\/www.instagram.com\/\" rel=\"nofollow ugc\">Instagram<\/a> Feed, Twitter Feed, Facebook Feed, YouTube Video, Google Reviews, RSS Feed, Linkedin Feed and 15+ more social feed networks. The plugin is extremely easy to use and has a no-complex structure. Users can enhance the overall look and efficiency of the widget by using a wide variety of customization &amp; personalization options offered by Tagembed &#8211; Social Media Feeds.<\/p>\n<p>Creating UGC Galleries or displaying social media feeds on websites is every brand’s best bet due to the amazing benefits like social connectivity, engagement and more that comes along with it. Join along and enjoy the advantages simply by installing the Tagembed <a href=\"https:\/\/tagembed.com\/wordpress-widget\/\" rel=\"nofollow ugc\">Best Social Media Widget WordPress Plugin<\/a><\/p>\n<h4>Update v4.7<\/h4>\n<p><strong>Instagram Handle Feed<\/strong> &#8211; Now you can collect public Instagram Profile posts and then <a href=\"https:\/\/tagembed.com\/blog\/embed-instagram-feed-on-website-for-free\/\" rel=\"nofollow ugc\">embed Instagram Feed on website<\/a>.<br \/>\n<strong>Facebook Page Feed<\/strong> &#8211; Now you can collect public Facebook Page posts and then embed Facebook Page Feed on website.<br \/>\n<strong>New Theme<\/strong> &#8211; Introducing New Vivid Theme to showcase your social media feed in colorful variations.<\/p>\n<h4>Update v4.6:<\/h4>\n<p><strong>Airbnb Experiences Review<\/strong> &#8211; New connection method to collect Airbnb reviews<br \/>\n<strong>Slack Widget<\/strong> &#8211; Introducing a new network Slack Feed for your website.<br \/>\n<strong>Vimeo Widget<\/strong> &#8211; Introducing a new network Vimeo Video Widget for your website.<br \/>\n<strong>Amazon Review Widget<\/strong> &#8211; Introducing new network Amazon Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-amazon-reviews-on-website\/\" rel=\"nofollow ugc\">embed Amazon reviews<\/a> to your website directly.<br \/>\n<strong>Tripadvisor Review Widget<\/strong> &#8211; Introducing new network Tripadvisor Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-tripadvisor-reviews-on-website\/\" rel=\"nofollow ugc\">add Tripadvisor reviews<\/a> to your WordPress website directly.<br \/>\n<strong>Aliexpress Review Widget<\/strong> &#8211; Introducing new network Aliexpress Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-aliexpress-reviews-on-website\/\" rel=\"nofollow ugc\">embed Aliexpress reviews<\/a> to your WordPress website directly.<br \/>\n<strong>Analytics 2.0<\/strong><\/p>\n<h3>Note:<\/h3>\n<p>We provide shortcodes in JS for SEO Friendly widget for your website.<br \/>\nNew: Introducing TikTok Video, LinkedIn Hashtag Feed, Flickr Album, VK Feed and Instagram Stories in Tagembed social media feed WordPress Plugin.<\/p>\n<h3>How to Embed Social Media Feeds on WordPress using Tagembed WP Plugin<\/h3>\n<p>= Watch Full Video to understand the plugin better =<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4FI2A5aoaL8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>Aggregate Content From Various Sources<\/h3>\n<ul>\n<li><strong>Embed Instagram Feed<\/strong>: Seamlessly collect content from one of the most super vibrant platforms with the <a href=\"https:\/\/tagembed.com\/instagram-widget\/wordpress\/\" rel=\"nofollow ugc\">Instagram Feed Widget WordPress<\/a> plugin. Aggregate the content using specific hashtags, usernames, mentions, etc.<\/li>\n<li><strong>Embed Facebook Feed<\/strong>: Collect content from one of the most popular and highly used social feed platforms in the world with the <a href=\"https:\/\/tagembed.com\/facebook-widget\/wordpress\/\" rel=\"nofollow ugc\">Facebook Feed Widget WordPress<\/a> plugin. Fetch content from specific profiles, usernames, mentions, etc.<\/li>\n<li><strong>Embed Twitter Feed<\/strong>: Social media users leverage Twitter as a microblogging platform to express their views and opinions openly. Integrate their Twitter Feed tweets into your marketing campaign using the <a href=\"https:\/\/tagembed.com\/twitter-widget\/wordpress\/\" rel=\"nofollow ugc\">Twitter Feed Widget WordPress<\/a> plugin.<\/li>\n<li><strong>Embed Google Reviews<\/strong>: Does your customers love your products and leave Google reviews? Extract their opinion and integrate Google Reviews into your WordPress website using the <a href=\"https:\/\/tagembed.com\/google-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Google Reviews Widget WordPress<\/a> plugin to win over the trust and confidence of your potential customers!<\/li>\n<li><strong>Embed YouTube Videos<\/strong>: YouTube Videos add liveliness and engagement elements to the website, doesn’t it? Embed Youtube videos hassle-free and without affecting the website speed using the <a href=\"https:\/\/tagembed.com\/youtube-widget\/wordpress\/\" rel=\"nofollow ugc\">YouTube Feed Widget WordPress<\/a> plugin.<\/li>\n<li><strong>Embed Linkedin Feeds<\/strong>: LinkedIn has that professional vibe that everyone loves. Now bring the same vibe to your website using the <a href=\"https:\/\/tagembed.com\/linkedin-widget\/wordpress\/\" rel=\"nofollow ugc\">Linkedin Feed Widget WordPress<\/a> plugin. Display company updates, latest information related to your brand, share expert insights, and more on your website with ease.<\/li>\n<li><strong>Embed RSS Feed<\/strong>: Now showcase blogs, articles, and more from your favorite website. Add RSS feed using <a href=\"https:\/\/tagembed.com\/rss-widget\/wordpress\/\" rel=\"nofollow ugc\">RSS Feed Widget WordPress<\/a> plugin. Hence, make your website more informative and engaging.<\/li>\n<li><strong>Embed Pinterest Feed<\/strong>: Add colorful content and ideas to your website, use Tagembed <a href=\"https:\/\/tagembed.com\/pinterest-widget\/wordpress\/\" rel=\"nofollow ugc\">Pinterest Feed Widget WordPress<\/a> plugin and create an everlasting impression with ideas in front of your visitors.<\/li>\n<li><strong>Embed Airbnb Reviews<\/strong>: Add authenticity of your Airbnb business to your website, using Tagembed <a href=\"https:\/\/tagembed.com\/airbnb-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Airbnb Reviews Widget WordPress<\/a> plugin and build trust among your visitors to grow business.<\/li>\n<li><strong>Embed Yelp Reviews<\/strong>: Win the trust of your potential customers and build trustful relationships with the new &amp; existing ones by opting to embed <a href=\"https:\/\/tagembed.com\/yelp-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Yelp review Widget WordPress<\/a> Plugin.<\/li>\n<li><strong>Embed Facebook Reviews<\/strong>: Utilize the power of Facebook’s huge user base. Display the consumer reviews from Facebook Page, as Tagembed lets you to embed <a href=\"https:\/\/tagembed.com\/facebook-reviews-widgets\/wordpress\/\" rel=\"nofollow ugc\">Facebook reviews Widget WordPress<\/a> Plugin with ease.<\/li>\n<li><strong>Embed From Other Platforms<\/strong>: Apart from these, collect content from social media platforms like Pinterest, RSS, Airbnb, Yelp reviews, TikTok, Etsy reviews, Tumblr, etc.<\/li>\n<\/ul>\n<h3>Simple Steps to Embed Social Media Feed on WordPress Website<\/h3>\n<h4>Install Tagembed WordPress Plugin<\/h4>\n<ul>\n<li>Go to the Plugin Section on your WordPress dashboard and click on &#8220;Add New&#8221;.<\/li>\n<li><strong>Search Tagembed<\/strong> then <strong>Install &amp; Activate<\/strong> the plugin to get started.<\/li>\n<li>or You can Download the .zip file &amp; Upload the Tagembed Plugin then click &#8220;Activate&#8221; the Tagembed Widget.<\/li>\n<li>Register or Sign Up on Tagembed WordPress plugin.<\/li>\n<\/ul>\n<h4>Steps to Embed Instagram Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram<\/strong> or <strong>Instagram Business<\/strong> to collect Instagram feeds.<\/li>\n<li>Select your Instagram feed filter connection type from: Instagram handle, Instagram hashtag, Instagram mention, Instagram profile, Instagram stories, Instagram Reels, IGTV etc. to fetch Instagram feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Instagram feed style and filter Instagram feeds as per your requirement to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-instagram-feed-on-wordpress\/\" rel=\"nofollow ugc\">Embed Instagram Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Feed Widget successfully.<\/li>\n<\/ul>\n<p>Note: In Instagram Widget &#8211; Instagram Reels &amp; Instagram Stories are only available on Paid Plans.<\/p>\n<h4>Steps to Embed Facebook Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Facebook<\/strong> to collect Facebook feeds.<\/li>\n<li>Select your Facebook feed filter connection type from: Facebook Page, Facebook Page Reviews, Facebook Album etc to fetch Facebook feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Facebook feed style and filter Facebook feeds as per your requirement to display only relevant and genuine Facebook Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Facebook Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-facebook-feed-on-wordpress-website\/\" rel=\"nofollow ugc\">Embed Facebook Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Facebook Feed Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Twitter Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Twitter<\/strong> to collect Twitter feeds.<\/li>\n<li>Select your Twitter feed filter connection type from: Twitter handle, Twitter hashtag, Twitter List, Twitter Favorites, Twitter Advanced (Query), etc. to fetch Twitter feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Twitter feed style and filter Twitter feeds as per your requirement to display only relevant and genuine Twitter Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Twitter Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/add-twitter-feeds-on-wordpress\/\" rel=\"nofollow ugc\">Embed Twitter Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to get it updated on <a href=\"https:\/\/tagembed.com\/twitter-widget\/\" rel=\"nofollow ugc\">Twitter Widget<\/a> and then embed Twitter Feed Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Google Reviews on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Google Review<\/strong> to collect Google Reviews in other words user reviews.<\/li>\n<li>Select your Google Reviews feed filter connection type from: My Places, Places, etc. to fetch Google Reviews as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize <a href=\"https:\/\/tagembed.com\/google-review-widget\/\" rel=\"nofollow ugc\">Google Review Widget<\/a> successfully style and filter Google Reviews as per your requirement to display only relevant and genuine Google Reviews on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Google Reviews and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-google-reviews-on-wordpress\/\" rel=\"nofollow ugc\">Embed Google Reviews on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Google Review Widget.<\/li>\n<\/ul>\n<p>Note: In Google Review Widget Upcoming google review feed will not be automatically updated for free plan users.<\/p>\n<h4>Steps to Embed YouTube Videos or YouTube Gallery on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>YouTube<\/strong> to collect YouTube Videos.<\/li>\n<li>Select your YouTube feed filter connection type from: YouTube Channel, YouTube Playlist, YouTube Shorts etc. to fetch YouTube Videos as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize YouTube Gallery Widget style and filter YouTube Videos as per your requirement to display only relevant and genuine YouTube Video on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the YouTube Gallery and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-youtube-video-on-wordpress\/\" rel=\"nofollow ugc\">Embed YouTube Video Gallery on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed YouTube Video Gallery successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Linkedin Feeds on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Linkedin<\/strong> to collect LinkedIn Feeds.<\/li>\n<li>Select your Linkedin feed filter connection type from: Linkedin Company Page URL, Linkedin Post URL, Linkedin Profile to fetch Linkedin Posts as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Linkedin Feed Widget style and filter Linkedin Posts as per your requirement to display only relevant and genuine Linkedin Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Linkedin Posts and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/support\/embed-linkedin-feeds-on-wordpress\/\" rel=\"nofollow ugc\">Embed Linkedin Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Linkedin Feed Widget successfully.<\/li>\n<\/ul>\n<p>Note: Company Page URL, Profile &amp; Hashtag &#8211; For Linkedin Widget users this method is only available with the <strong>Plus Plan<\/strong>.<\/p>\n<h3>Types of Instagram Feed Source and How to collect, curate and embed Instagram Feed on WordPress<\/h3>\n<h4>Steps to Embed Instagram Reels on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram<\/strong> to collect Instagram Reels Feed.<\/li>\n<li>Select your Instagram Feed filter connection type as Instagram Reels from: Instagram handle, Instagram Reels to collect Instagram Reels as per your preference.<\/li>\n<li>Now Choose Theme from <strong>10+ Layouts<\/strong> (Recommended &#8211; Story Theme), Then personalize your Instagram feed style using card style settings and filter Instagram feed to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Reels and then <strong>Copy ShortCode<\/strong> to Embed Instagram Reels on WordPress.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Reels Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Instagram Hashtag on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram Business<\/strong> to collect Instagram Hashtag Feed.<\/li>\n<li>Select your Instagram Feed filter connection type as Instagram Hashtag from: Instagram handle, Instagram Hashtag, Instagram Mention, Instagram Tagged, Instagram Story etc to collect Instagram Hashtag as per your preference.<\/li>\n<li>Now Choose Theme from <strong>10+ Layouts<\/strong> (Recommended &#8211; Story Theme), Then personalize your Instagram feed style using card style settings and filter Instagram feed to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Hashtag Feed and then <strong>Copy ShortCode<\/strong> to Embed Instagram Hashtag on WordPress.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Hashtag Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Facebook Reviews on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Facebook<\/strong> to collect Facebook feeds.<\/li>\n<li>Select your Facebook feed filter connection type as Facebook Reviews Feed from: Facebook Reviews, Facebook Album, Facebook Mentions, Facebook Profile, Fb Page, etc to fetch Facebook feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Facebook feed style and filter Facebook feeds as per your requirement to display only relevant and genuine Facebook Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Facebook Feed or FB Reviews Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-facebook-reviews-on-wordpress\/\" rel=\"nofollow ugc\">Embed FB Reviews on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed <a href=\"https:\/\/tagembed.com\/facebook-review-widget\/\" rel=\"nofollow ugc\">Facebook Reviews Widget<\/a> successfully.<\/li>\n<\/ul>\n<p>By following the above mentioned steps you will be able to successfully <a href=\"https:\/\/tagembed.com\/blog\/add-social-media-feed-to-wordpress\/\" rel=\"nofollow ugc\">add social media feed to WordPress<\/a> website in just a few mins.<\/p>\n<h3>Main Features Of The Tagembed Social Media Feeds WordPress Plugin<\/h3>\n<ul>\n<li><strong>Instant real-time content update<\/strong>: The social media widget on website gets updated automatically the moment a new content is uploaded on the social platform. In simply words, it enables curating and displaying the fresh content automatically on website.<\/li>\n<li><strong>Card Style<\/strong>: Personalize your card style as you love, with so many options to choose from like theme mode, aspect ratio, edge style, font, CTA, and more.<\/li>\n<li><strong>Content moderation<\/strong>: With a dynamic filtering options, curate and manage the social content before embedding it on your website. It lets you filter unwanted &amp; irrelevant social media content to fetches the highest quality content to display on website.<\/li>\n<li><strong>Custom CSS<\/strong>: Want to make your own custom design? Your ideas of a more creative, personalized, &amp; engaging social media widget will come to existence with the help of custom CSS features offered by Tagembed.<\/li>\n<li><strong>Robust analytics<\/strong>: The flexible and robust in-built analytics feature integrated into the platform manages the social media widget’s performance by creating reports regarding views, active users, customer engagement, total impressions, click-through rates, sentiments, etc.<\/li>\n<li><strong>Code-free<\/strong>: Using Tagembed social media feed wordpress plugin is entirely coding-free. It doesn’t require any special expertise and liberates you from pesky codes and their complex integration methods.<\/li>\n<\/ul>\n<h3>Why Choose The Tagembed WordPress Plugin?<\/h3>\n<ul>\n<li><strong>Escalated Sales &amp; Conversions<\/strong>: Got a <a href=\"https:\/\/tagembed.com\/blog\/5-star-google-reviews-ratings-for-business\/\" rel=\"nofollow ugc\">5-star Google reviews rating<\/a>? How about flaunting them in front of your visitors to build credibility? Showcase consumers, not only from Google but also from various other <a href=\"https:\/\/tagembed.com\/blog\/best-reviews-platforms\/\" rel=\"nofollow ugc\">review platforms<\/a>, to prove proof of your reliability. More than 85% of customers go through User-Generated Content during their purchase-related decisions. Once you have the trust and confidence of your customers, they will be more likely to purchase your products.<\/li>\n<li><strong>Robust Customer Support<\/strong>: We highly value and love our users and work hard to let them enjoy a seamless experience. However, if you come across any technical glitch or hindrance using the plugin, reach out to us and we will get back to you right away. Tagembed is an alternative to smash balloon, WPZoom social feed widget, Feed Them Social &#8211; Photo Galleries, 10websocial, spotlight social feeds, feedzy RSS Aggregator, Social Feed Gallery, Easy Social Feed &#8211; social photos gallery, Social Slider Feed, BlossomThemes Social Feed.<\/li>\n<\/ul>\n<h3>Support<\/h3>\n<p>We provide remarkable instant service we’d want to experience ourselves!!<br \/>\nFor any query, contact us at: <a href=\"mailto:&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#116;a&#103;e&#x6d;&#098;&#x65;&#100;&#x2e;&#099;&#x6f;&#109;\" rel=\"nofollow ugc\">&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#116;a&#103;e&#x6d;&#098;&#x65;&#100;&#x2e;&#099;&#x6f;&#109;<\/a><\/p>\n",
        "installation": "<ul>\n<li>Access the WordPress admin panel. In the plugin menu, click on “Add new?€? and search for the term <strong>Tagembed<\/strong>. Install it and click on “Activate now?€?.<\/li>\n<li>Or Download the Tagembed plugin zip file and unzip it. Upload the file in the \/wp-content\/plugins directory of your WordPress website. Click on the activate button.<\/li>\n<\/ul>\n<p>Post activation, visit Tagembed widget WordPress plugin and collect social media feeds, customize them and copy the shortcode. Paste the code on the website’s page or Post where you want to display social media feed on WordPress website.<\/p>\n<p>Step by Step Guide with Screen Shots : <a href=\"https:\/\/tagembed.com\/support\/social-media-feed-plugin-for-wordpress\/\" rel=\"nofollow ugc\">Installation Guide: Social Media Feed Plugin For WordPress<\/a><\/p>\n<p>Video Guide For <a href=\"https:\/\/www.youtube.com\/watch?v=svEiOzrvMQg\" rel=\"nofollow ugc\">WordPress Instagram Feed<\/a><\/p>\n<p>Video Guide For <a href=\"https:\/\/www.youtube.com\/watch?v=LqcWxNsDRss\" rel=\"nofollow ugc\">WordPress Facebook Feed<\/a><\/p>\n<p>Video Guide For <a href=\"https:\/\/www.youtube.com\/watch?v=XC6Cj1FNEIU\" rel=\"nofollow ugc\">WordPress RSS Feed<\/a><\/p>\n<p>Video Guide For <a href=\"https:\/\/www.youtube.com\/watch?v=LFLhfJ1ffYw\" rel=\"nofollow ugc\">WordPress Google Reviews<\/a><\/p>\n",
        "faq": "\n<dt id='what%20is%20the%20need%20for%20a%20social%20media%20feeds%20plugin%3F'>\nWhat is the need for a social media feeds plugin?\n<\/h4>\n<p>\n<p>Social Media feeds Plugin give a fresh and neoteric look to your website. It also boosts user engagement and increases conversions. User-generated content is trusted by everyone over any marketing campaign. Your brand culminates in the process of being admired by your target audience.<\/p>\n<\/p>\n<dt id='is%20this%20plugin%20free%3F'>\nIs this plugin free?\n<\/h4>\n<p>\n<p>Yes, the Tagembed social media feeds plugin also provides a free plan with 5 social networks. Also, there are higher plans available in the social media aggreagtor plugin with enhanced features and more social networks to make the best use of the plugin. Hence, make integration more smooth &amp; fluid.<\/p>\n<\/p>\n<dt id='will%20the%20steps%20require%20any%20coding%20skills%3F'>\nWill the steps require any coding skills?\n<\/h4>\n<p>\n<p>No. Tagembed is an advanced social media widget WordPress Plugin unlike any. Hence, embedding social media feeds using Tagembed social media aggregator plugin is entirely code-free.<\/p>\n<\/p>\n<dt id='do%20i%20need%20to%20register%20separately%20for%20the%20plugin%3F'>\nDo I need to register separately for the plugin?\n<\/h4>\n<p>\n<p>No. If you are an existing Tagembed Social Media Widget App user then you can directly login with the same credentials on the WordPress Plugin. Eitherly you can register for a new account.<\/p>\n<\/p>\n<dt id='can%20i%20display%20multiple%20social%20media%20feeds%20on%20my%20website%3F'>\nCan I display multiple Social Media feeds on my website?\n<\/h4>\n<p>\n<p>Yes, you can connect social media feeds from 18+ Social Platforms using Tagembed’s wordpress plugin such as Instagram to collect Instagram Feed, Facebook to collect Facebook Feed, YouTube to collect YouTube Shorts or YouTube Videos, Twitter to collect Twitter Feed, Linkedin to collect Linkedin Post or Linkedin Feed and more, all in a single widget and embed into your WordPress website.<\/p>\n<\/p>\n<dt id='what%20layouts%20can%20i%20use%20to%20showcase%20my%20social%20media%20feeds%3F'>\nWhat layouts can I use to showcase my social media feeds?\n<\/h4>\n<p>\n<p>You can choose from 10+ different layouts or themes i.e. Masonry, Grid, Slider, List etc that best fits your social media feed widget and also matches your website theme and design.<\/p>\n<\/p>\n<dt id='can%20i%20embed%20instagram%20reels%20using%20tagembed%20wordpress%20plugin%3F'>\nCan I embed Instagram Reels using Tagembed WordPress Plugin?\n<\/h4>\n<p>\n<p>Yes, you can easily embed Instagram Reels, IGTV, Instagram Stories and more using the Instagram Widget powered by Tagembed WordPress plugin.<\/p>\n<\/p>\n<dt id='can%20i%20embed%20youtube%20shorts%20using%20tagembed%20wordpress%20plugin%20in%20my%20youtube%20gallery%3F'>\nCan I embed YouTube Shorts using Tagembed WordPress Plugin in my YouTube Gallery?\n<\/h4>\n<p>\n<p>Yes, definitely you can embed YouTube Shorts on WordPress website. Select YouTube as your network and select feed filter as YouTube Shorts. Enter the channel url or name and click Create Button. Your YouTube Shorts will be collected as Youtube Video on your youtube gallery widget.<\/p>\n<\/p>\n<dt id='how%20to%20embed%20youtube%20playlist%20videos%20using%20tagembed%20wordpress%20plugin%3F'>\nHow to embed YouTube Playlist Videos using Tagembed WordPress Plugin?\n<\/h4>\n<p>\n<p>To embed YouTube Playlist video on WordPress website you need to select YouTube as your network and then in feed filter select as Youtube playlist and enter the playlist url. Your YouTube Videos will be added to the YouTube Gallery. Copy the shortcode from the display tab and paste it into the webpage or blog where you wish to embed YouTube Gallery.<\/p>\n<\/p>\n<dt id='what%20is%20social%20feed%20in%20social%20media%20aggregator%3F'>\nWhat is social feed in social media aggregator?\n<\/h4>\n<p>\n<p>Social Feeds are the collection of social media feeds that are collected from multiple sources into a unified platform called social media aggregator. Apart form collecting social feeds, social media aggregator also provides users a so-called social widget platform to filter, moderate, curate and customize social feeds to make it best fit into any platform you wish to embed.<\/p>\n<\/p>\n\n",
        "changelog": "<h4>5.1<\/h4>\n<ul>\n<li>New: Inherit feature &#8211; to automatically align your website font style &amp; colors with widget.<\/li>\n<\/ul>\n<h4>5.0<\/h4>\n<ul>\n<li>New: Major chnages in the chat support widget for our users.<\/li>\n<\/ul>\n<h4>4.9<\/h4>\n<ul>\n<li>Bugs Fix for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, and more.<\/li>\n<\/ul>\n<h4>4.8<\/h4>\n<ul>\n<li>Fix Security Nounce &#8211; for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, and more.<\/li>\n<\/ul>\n<h4>4.7<\/h4>\n<ul>\n<li>New: Instagram Handle Feed &#8211; Now you can collect public Instagram Profile posts and then embed Instagram Handle Feed on website.<\/li>\n<li>New: Facebook Page Feed &#8211; Now you can collect public Facebook Page posts and then embed Facebook Page Feed on website.<\/li>\n<li>New: Vivid Theme &#8211; Introducing New Vivid Theme to showcase your social media feed in colorful variations.<\/li>\n<li>Fix: Bugs fixed. Now social media feeds will load faster than before on website.<\/li>\n<\/ul>\n<h4>4.6<\/h4>\n<ul>\n<li>New: We have come up with some major networks and features dedicatedly for our WordPress plugin users.<\/li>\n<li>New: Airbnb Experiences Review &#8211; We are introducing a new connection method for our WordPress users where they can collect Airbnb reviews using a new connection type &#8220;Airbnb Experiences&#8221;.<\/li>\n<li>New: Slack Widget &#8211; Now you can showcase your slack feed to your website or screen using WordPress social media feed plugin.<\/li>\n<li>New: Vimeo Widget &#8211; Collect, curate, and embed vimeo video on your WordPress website in just a few clicks.<\/li>\n<li>New: Amazon Reviews &#8211; Introducing a new network Amazon Review widget for website. Now you can showcase your Amazon Product Reviews on your website to build trust among your potential users to make a decision directly from your website.<\/li>\n<li>New: Tripadvisor Review Widget &#8211; For all the travel advisors we are introducing a new network Tripadvisor review widget. Now you can showcase the reviews from Tripadvisor to your website for recommending better tour ideas with genuine users&#8217; experiences.<\/li>\n<li>New: Aliexpress Review Widget &#8211; Aggregate reviews from your Aliexpress product page and embed Aliexpress review directly to your website.<\/li>\n<li>Fix: We have updated the moderation panel. Earlier your expired feeds like Instagram Feed, Facebook Feed, Twitter Feed, YouTube Videos, Linkedin Feed, Vimeo Videos. Slack Feed, RSS feed etc couldn&#8217;t be updated automatically. This fix will now automatically refresh your expired feeds.<\/li>\n<li>New: Introducing Analytics 2.0 for all the WordPress plugin users so that you can track the performance of your embedded Instagram Feed, Facebook Feed, Twitter Feed, YouTube Videos, Linkedin Feed, Vimeo Videos. Slack Feed, RSS feed etc.<\/li>\n<\/ul>\n<h4>4.5<\/h4>\n<ul>\n<li>Fix: Account management issue &#8211; After updating plugin when user is trying to access their feeds like Instagram Feed, YouTube Gallery, Facebook Page, Twitter Feed, Google Reviews, Instagram Gallery or Instagram page feed, Review Widget, Twitter Feed, etc they were automatically getting logout. With the new fix they will remain login still after updating the plugin and access their Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Gallery etc.<\/li>\n<\/ul>\n<h4>4.4<\/h4>\n<ul>\n<li>New: Due to Twitter API update on 9th of Feb 2023 from free to paid, we will have to remove the free twitter feed to paid twitter feed. Unfortunately, twitter feed will no longer be available on TAGEMBED LITE PLAN but you can continue using Twitter widget with the help of paid plan and other widgets like Instagram Feed, YouTube Gallery, Facebook Page, Instagram Gallery or Instagram page feed.<\/li>\n<li>Fix: Cache issue with widgets like Instagram Feed, YouTube Gallery, Facebook Page, Instagram Gallery or Instagram page feed, Review Widget, Twitter Feed and more.<\/li>\n<li>New: Soon introducing a new way to collect reviews for your businesses using Tagembed review widget where the review plugin users will be able to grab more reviews from their clients.<\/li>\n<li>Fix: Soome minor bug fixes for Instagram Feed, YouTube Gallery, Facebook Page, Instagram page feed, Review Widget, Twitter Feed, Instagram Gallery and more.<\/li>\n<li>Fix: Grid Theme fix for feed widgets like Instagram Feed, YouTube Gallery, Facebook Page, Instagram Gallery or Instagram page feed, Review Widget, Twitter Feed and more, where the collected feed was not loading properly.<\/li>\n<\/ul>\n<h4>4.3<\/h4>\n<ul>\n<li>New: New Networks such as Tiktok Videos, LinkedIn Hashtag, Flickr Feed, VK Album &amp; Instagram Stories are now added to the Tagembed social media WordPress Plugin so that user can create Tiktok Videos, LinkedIN Hashtag, Flickr Feed, VK Album &amp; Instagram Stories directly from the plugin itself.<\/li>\n<li>New: Analytics &#8211; Now review the performance of your embedded UGC gallery or social media feed widget to understand the impact of your social widget on your website.<\/li>\n<li>Fix: Speed optimization for fast loading of Instagram Feed, Twitter Feed, Google Reviews, RSS Feed, YouTube video, Google News RSS Feed, Facebook Page Feed, Instagram slider and more.<\/li>\n<li>Fix: Optimization for themes like Instagram slider, Instagram carousel, Instagram Grid, Instagram Gallery, Instagram Wall, Instagram Story Themes and etc.<\/li>\n<li>Fix: Optimization for themes like Facebook slider, Facebook carousel, Facebook Grid, Facebook Gallery, Facebook Wall, Facebook Page, Facebook Story Themes and etc.<\/li>\n<li>New: Now you create your Instagram Feed, mastodon rss feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget etc faster with new user-flow.<\/li>\n<\/ul>\n<h4>4.2<\/h4>\n<ul>\n<li>New: Show More Feature &#8211; We have introduced a new show more feature under the footer settings that you can customize with your own preferred language. Making your native visitors easy to access and explore your Instagram Feed, News RSS Feed, YouTube Gallery, Facebook Page, Instagram Gallery, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video and more.<\/li>\n<li>New: Trim Content &#8211; Now you can trim content as per your requirement for captions, making the feed look beautiful. Instagram Feed, News RSS Feed, YouTube Gallery, Facebook Page, Instagram Gallery and more will look amazing with trim content.<\/li>\n<li>Fix: Fixed Private Post Expiry Issues for Instagram, Facebook, LinkedIn, TikTok. With the fix now your Instagram Feed, News RSS Feed, YouTube Gallery, Facebook Page, Instagram Gallery, Instagram Slider, Twitter Feed, Facebook Feed and more will not expire anymore.<\/li>\n<\/ul>\n<h4>4.1<\/h4>\n<ul>\n<li>Fix: Now easily embed Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget, custom instagram feed, custom facebook feed, on Elementor, Vamtam etc themes using Iframe Code or Short Code.<\/li>\n<li>New: Introducing full-flash JS Code so that you can easily embed Instagram Feed, mastodon rss feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget, on your website for making the social media widget plugin SEO friendly.<\/li>\n<li>Fix: Fixed Tagembed Block Issue for wordpress themes. Tagembed block was not visible when users try to embed Instagram Feed, mastodon feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget etc.<\/li>\n<\/ul>\n<h4>4.0<\/h4>\n<ul>\n<li>Fix: Tested and fixed issue for Tagembed Social Media Plugin.<\/li>\n<li>New: Introducing Lite Code (JS Code Beta) for Instagram Feed, mastodon rss feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget and more.<\/li>\n<\/ul>\n<h4>3.10<\/h4>\n<ul>\n<li>Fix: Tested and fixed issue for Social Media Plugin.<\/li>\n<\/ul>\n<h4>3.9<\/h4>\n<ul>\n<li>Fix: Tested and fixed issue for Social Media Plugin.<\/li>\n<\/ul>\n<h4>3.8<\/h4>\n<ul>\n<li>Fix: Tested and fixed issue for Social Media Plugin.<\/li>\n<\/ul>\n<h4>3.7<\/h4>\n<ul>\n<li>Fix: JS code is now loaded from a local file shipped within the plugin rather than an external CDN for use with the customizer in the admin area. So all files will be loaded from within the plugin letting you embed Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget etc.<\/li>\n<\/ul>\n<h4>3.6<\/h4>\n<ul>\n<li>Fix: Fixed Reconnecting &#8211; An account now results in deleting the original connection in the database and adding a new one. This will prevent issues with some systems caching. No More Updating Issues with Facebook, Instagram, Twitter, Youtube, Google Reviews, RSS Aggregator and more.<\/li>\n<\/ul>\n<h4>3.5<\/h4>\n<ul>\n<li>Fix: Tested and fixed for a third party plugin that was causing issue will creating Instagram Feed, Facebook Feed, Google Reviews, Twitter Feed, YouTube Channel Video, FB Page, RSS Feed using Tagembed Social Media WordPress Plugin.<\/li>\n<li>Fix: Tested and fixed for the WordPress media library that was causing image alignment issue when user is creating Facebook Feed, Twitter Feed, Instagram Feed, Google Reviews, YouTube Channel Video, FB Page, RSS Feed using Tagembed Social Media WordPress Plugin.<\/li>\n<li>Fix: Fixed Issue with the plugin auto-upadte icon that keeps on rotating even though the plugin is up-to-date. Now, if you install and activate the Tagembed: Embed Twitter Feed, Google Reviews, Youtube Videos and More Social Media Feeds.<\/li>\n<li>Fix: Now when you add Fb Page, Fb feed, Fb album, Insta feed, Insta Hashtag, Twitter Feed, Google Reviews and more on your widget it will be displayed in a new refreshed view with some technical glitches fixed.<\/li>\n<\/ul>\n<h4>3.4.1<\/h4>\n<ul>\n<li>Fix: We have tested and made fix for the new WordPress version 6.1 for all of our social feed such as Instagram Feed, Facebook Feed, Twitter Feed, Linkedin Feed, YouTube Video, Pinterest Feed, Yelp Reviews, Airbnb Reviews, Google Reviews, and more.<\/li>\n<\/ul>\n<h4>3.4<\/h4>\n<ul>\n<li>Fix: API update for Instagram Reels. Now you can collect Instagram Reels feed by just connecting your Instagram Handle Account and in a few seconds Instagram Reels will appear. Earlier there was a bug that doesn&#8217;t allow every user to collect Instagram Reels and would fail to fetch Instagram Reels.<\/li>\n<li>New: Earlier when you wanted to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews etc you need to copy the shortcode that was easy but some also needed HTML code or iFrame code that could allow more possibility to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews. With this update we have included HTML code and iFrame Code for all users.<\/li>\n<li>New: Linkedin Profile &#8211; Now you can collect Linkedin Feed using new method that is Linkedin Profile that allows you to collect Linkedin Feed from your personal Linkedin Profile in just a click.<\/li>\n<\/ul>\n<h4>3.3<\/h4>\n<ul>\n<li>New: Introducing new social media feed source, Tumblr. Now you can collect Tumblr Feed, customize and curate theme and then embed Tumblr Feed on WordPress website in just a few clicks.<\/li>\n<li>New: Introducing new social media feed source, Yelp. Now you can collect Yelp Review Feed, customize and curate theme and then embed Yelp Reviews on WordPress website in just a few clicks.<\/li>\n<li>New: Introducing new social media feed source, Capterra. Now you can collect Capterra Review Feed, customize and curate theme and then embed Capterra Reviews on WordPress website in just a few clicks.<\/li>\n<li>New: Introducing new social media feed source, Etsy. Now you can collect Etsy Review Feed, customize and curate theme and then embed Etsy Reviews on WordPress website in just a few clicks.<\/li>\n<li>Update: Custom CSS issues fix. Earlier when you collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos, the Custom CSS wouldn&#8217;t be applied in it but now with the issue fix you can easily collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Videos and add your custom CSS code to make it more astonishing.<\/li>\n<li>Update: Facebook Carousel Post issue fix. Earlier when you collect Facebook Feed, the Facebook Post with multiple Facebook images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Facebook Posts in one as a Facebook Carousel.<\/li>\n<li>Update: Linkedin Carousel Post issue fix. Earlier when you collect Linkedin Feed, the Linkedin Post with multiple Linkedin images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Linkedin Posts in one as a Linkedin Carousel.<\/li>\n<li>Update: Instagram Carousel Post issue fix. Earlier when you collect Instagram Feed, the Instagram Post with multiple Instagram images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Instagram Posts in one as a Instagram Carousel.<\/li>\n<li>Update: Instagram Slider Post issue fix. Earlier when you collect Instagram Feed, the Instagram Post wouldn&#8217;t be displayed as a Instagram Slider due to the missing Instagram Slider button but now with this update you display Instagram Slider precisely in a Slider.<\/li>\n<li>Update: Twitter Carousel Post issue fix. Earlier when you collect Twitter Feed, the Twitter Post with multiple Twitter images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Twitter Posts in one as a Twitter Carousel.<\/li>\n<li>New: Card Style customization update. Earlier when you collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos, their were limited card style settings that was just basic for normal use. Now when you collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Videos etc you can update your card view by following:\n<ul>\n<li>Content Alignment &#8211; Align your card&#8217;s content in three different style (Left, Right, Center) for Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos etc.<\/li>\n<li>Trim Content &#8211; Trim the content of your Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos etc. to a certain character so that the feed doesn&#8217;t look absurd.<\/li>\n<li>Aspect Ratio &#8211; Set aspect ratio for your Instagram Feed, TikTok Videos, Youtube Shorts, Linkedin Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos etc. as per your post ratio to match the aesthetic of your post style and website.<\/li>\n<li>Theme Mode &#8211; Make your card more interactive and less-straining with the latest trends. Dark &amp; Light Mode is now available for all social media feeds like Instagram Feed, TikTok Videos, Youtube Shorts, Linkedin Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos etc.<\/li>\n<li>Card Curve &#8211; Flaunt the view of your card with 3 different edge styles of curvness based on your website block theme. Hence, your Instagram Feed, TikTok Videos, Youtube Shorts, Linkedin Feed, Twitter Feed, Facebook Feed, Google Reviews and YouTube Videos etc. will look ashtonishing with square, or round edges.<\/li>\n<\/ul>\n<\/li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, Instagram Slider, YouTube video, Pinterest Feed, Facebook Page feed, YouTube Gallery, News RSS Feed and all other.<\/li>\n<\/ul>\n<h4>3.2<\/h4>\n<ul>\n<li>New: Now choose your personalized card style so that you can Embed Instagram Feed, Embed Facebook Feed, Embed Twitter Feed, Embed Facebook Reviews, Embed YouTube Video, Embed Pinterest Feed etc according to your website requirement.<\/li>\n<li>New: Introducing extra customization option into the plugin so that your Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Video, RSS Feed, Pinterest feed, YouTube Shorts, etc., look astonishing and also blends perfectly with your website.<\/li>\n<li>FIX: Youtube video, Twitter feed, facebook feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Youtube video, Twitter feed, facebook feed and Instagram feed will be displayed in proper alignment.<\/li>\n<li>FIX: Twitter Feed, Facebook feed, Youtube Video, Instagram Feed: Small bugs fixes for Twitter Feed, Facebook feed, YouTube Video &amp; Instagram Feed.<\/li>\n<li>FIX: Instagram Feed, Twitter feed, Facebook feed, Facebook reviews, youtube video caching for faster delivery.<\/li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with WordPress Version 6.0<\/li>\n<\/ul>\n<h4>3.1<\/h4>\n<ul>\n<li>New: Now choose what happens when you click when you Embed Instagram Feed, Embed Facebook Feed, Embed Twitter Feed, Embed Google Reviews, Embed YouTube Video, Embed RSS Feed etc. Want to redirect them to the specific social platform or open pop-up or no action, based on your requirement.<\/li>\n<li>New: Introducing custom CSS option into the plugin. Now make custom style of your widget so that your Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Video, RSS Feed, Pinterest feed, YouTube Shorts, etc., look astonishing and also blends perfectly with your website theme.<\/li>\n<li>FIX: Twitter Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Twitter Feed will be displayed in proper alignment.<\/li>\n<li>FIX: Youtube Video, Instagram Feed: Small bugs fix for YouTube Shorts &amp; Instagram Feed.<\/li>\n<li>FIX: Instagram Feed caching.<\/li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with WordPress Version 5.9.3<\/li>\n<\/ul>\n<h4>3.0<\/h4>\n<ul>\n<li>New: Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Video, RSS Feed etc: Now choose your custom layout from the customize tab. You can set your desired number of row &amp; column for your Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Video, RSS Feed etc., directly from the plugin. Earlier their was no such option.<\/li>\n<li>New: Embed Instagram Feed, Embed Facebook Feed, Embed Twitter Feed, Embed Google Reviews, Embed YouTube Video, Embed RSS Feed etc: Make your personalized card style using the new card settings option under the customize tab. You can set to display or hide author details, content, font style and many more for your Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Video, RSS Feed and other types of social media feeds that Tagembed offers, directly from the plugin. Earlier plugin didn&#8217;t had such option to personalize your card.<\/li>\n<li>FIX: Instagram Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Instagram Feed will be displayed in proper alignment.<\/li>\n<li>FIX: Twitter Feed: Small bugs fix for Twitter Hashtag Feed.<\/li>\n<li>FIX: YouTube Feed caching.<\/li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with WordPress Version 5.9.3<\/li>\n<\/ul>\n<h4>2.9<\/h4>\n<p>Bugs Fix for Linkedin Feed, Instagram Feed, Facebook Feed, Twitter Feed, Youtube Gallery, and Google Reviews. Also, now users can add several Linkedin posts using Linkedin Widget directly from the Tagembed Social Media Feed WordPress Plugin to WordPress site.<br \/>\n  Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with current wordpress version.<\/p>\n<h4>2.8<\/h4>\n<p>Introducing more ways to embed Instagram Feed on WordPress website such as: Instagram TV or IGTV, Instagram Reels, Instagram Stories, Instagram Mentions, and Instagram Tagged Feeds into your Instagram Widget, directly using Tagembed Social Media Feed WordPress Plugin.<br \/>\n  Minor Bugs Fix for Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews and Linkedin Feed.<br \/>\n  Earlier there was a bug which wouldn&#8217;t let user to collect all of the latest Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews and Linkedin Feed. Now, with the new update not only users will be able to collect Instagram Feed using different method but also all of the latest social feeds from Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews and Linkedin Feed will be collected in the Facebook Widget, Twitter Widget, YouTube Widget, Google Review Widget and Linkedin Widget, repectively.<br \/>\n  Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with current wordpress version.<\/p>\n<h4>2.7<\/h4>\n<p>Fixed PHP warnings and notices and tested upto wordpress 2.9 version.<br \/>\n  Fixed bugs for Instagram Slider, Facebook Feed, Youtube Gallery,  Twitter Feed, Instagram Stories, Google Reviews and Pinterest.<br \/>\n  Earlier Instagram Business account were not connecting properly, now you can easily connect your Instagram account to add Instagram Feed and Instagram Hashtag from any connected Instagram account.<br \/>\n  Same with Facebook Feed, Youtube Channel, Twitter Feed and Google Reviews. Now the connection between the networks are established and can be collected on the respective social media widget.<br \/>\n  Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed and all other with current wordpress version.<\/p>\n<h4>2.6<\/h4>\n<ul>\n<li>Fixed Bugs for Facebook Feed, Facebook Widget, Instagram Feed &amp; Instagram Widget and Improved Design for Twitter Feed, Twitter Widget, YouTube Video &amp; YouTube Gallery.<\/li>\n<\/ul>\n<h4>2.5<\/h4>\n<ul>\n<li>Now Display LinkedIn Feeds in Linkedin Widget, Youtube Videos and Youtube Shorts in YouTube Gallery and embed on website.<\/li>\n<\/ul>\n<h4>2.4<\/h4>\n<ul>\n<li>Introducing New Features to Display social media Feeds according to your need.<\/li>\n<li>Earlier Instagram Feed, YouTube Videos, Twitter Feed, Facebook feed cannot be pinned to top or highlighted. Now you Pin the post to the top, or Highlight Instagram Feed, Twitter Feed, YouTube Video, Facebook Feed.<\/li>\n<\/ul>\n<h4>2.3<\/h4>\n<ul>\n<li>Fixed Bugs for Instagram Feeds and Improved Design for Instagram Feed display. Earlier Instagram Feed pop-up was not responsive and Instagram pop-up used to shrink automatically. Now Instagram pop-up is responsive and Instagram feed featured pop-up is not shrinking.<br \/>\nFixed Twitter Feed Bugs and Improved Social Media Widget Design.<br \/>\nFix &#8211; Instagram API updated: Instagram connection method update for more smooth connection of Instagram with the plugin to collect Instagram Feed.<br \/>\nFix &#8211; Facebook cache optimize, now your collected Facebook feed will view more promising then before after you embed Facebook feed on website.<br \/>\nNew &#8211; Instagram IGTV: Introducing Instagram IGTV as a connection method to collect Instagram feed from Instagram as a Instagram IGTV method. Now embed Instagram TV video on your website.<\/li>\n<\/ul>\n<h4>2.2<\/h4>\n<p>Fixed Facebook Feed, YouTube Gallery, Instagram Feed Bugs and Improved Facebook Widget Design.<br \/>\n  New &#8211; Instagram Stories: Introducing Instagram Stories in Instagram connection method so that you can embed Instagram Stories on your website from your Instagram Handle. Just enter your Instagram Handle and get all of your Instagram Stories in the Instagram Widget.<br \/>\n  New &#8211; Twitter Hashtag: Introducing Twitter Hashtag in Twitter connection method so that you can embed Twitter hashtag on your website from your Twitter. Just enter your trending Twitter hashtag and get all of your Twitter Hashtag feed in the Twitter Widget.<br \/>\n  New &#8211; Facebook Handle: Introducing Facebook Handle in Facebook connection method so that you can embed Facebook Feed on your website from your Facebook Profile. Just connect your Facebook feed and get all of your Facebook feed in the Facebook Widget.<br \/>\n  New &#8211; New Gallery Theme for Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.<br \/>\n  New &#8211; New Classic carousel theme for Google Review, Trustpilot reviews, Tripadvisor reviews, etsy reviews, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed and more.<br \/>\n  Fix &#8211; Cache optimized for Google Review, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.<\/p>\n<h4>2.1<\/h4>\n<p>Added Powerful Filter Section. Choose the best social media feeds to display on your website. You can filter your collected Instagram Feed, Facebook Feed, Twitter Feed, YouTube Video and etc social media feeds based on the feed Post type such as images, videos, text. You can also public or private collected social media feeds.<br \/>\n  New &#8211; Instagram Reels: Introducing Instagram Reels conection method. Now you can add Instagram Feed to your Instagram Widget and finally embed Instagram Feed from Instagram Reels connnection method. Just enter the Instagram Handle name into the Instagram Reels section and all of your Instagram Reels video will be collected in the Instagram widget.<br \/>\n  Fix &#8211; YouTube Channel access token refresh: Now embed YouTube channel videos that is playable on a pop-up or can be redirected to YouTube.<br \/>\n  Fix &#8211; Facebook Feed Access token refresh: Facebook Feed connection will not fail like it was before for Facebook Page.<br \/>\n  New &#8211; YouTube Shorts: Introducing YouTube Shorts in YouTube connection method so that you can embed YouTube Shorts on your website from your YouTube Channel.<\/p>\n<h4>1.9<\/h4>\n<p>Fixed Bugs for Instagram Hashtag Feed and Improved Design for Twitter Hashtag Feed. Now you can add Instagram Feed from any Instagram Hashtag to your Instagram Widget. Also Twitter Feed got new design, when you collect Twitter Hashtag Feed it was showing some glitches in design but now Twitter feed is stable.<br \/>\n  New &#8211; Twitter Hashtags: Introducing Twitter Hashtags, Now you can add Twitter Hashtag Feed to your Twitter Widget and finally embed Twitter Feed from Twitter Hashtag connnection method.<br \/>\n  New &#8211; YouTube Channel: Introducing YouTube Channel connection method. Now you can add YouTube Channel Video Feed to your YouTube Widget and finally embed YouTube Feed from YouTube Channel connnection method.<br \/>\n  Fix &#8211; Instagram Access Token: Instagram Hashtag Access Token Refresh fix.<br \/>\n  Fix &#8211; Instagram Access Token: Instagram Handle Access Token Refresh fix.<br \/>\n  Fix &#8211; Instagram Access Token: Instagram Business Account Access Token Refresh fix from Facebook.<\/p>\n<h4>1.8<\/h4>\n<p>Easily Manage your plans within WordPress Dashboard. Now you can subscribe to Tagembed Plans for accessing extra social networks like Google Reviews, Instagram Stories, YouTube Videos, RSS Feed, Vimeo Video, Pinterest feed, Linkedin Feed, Tumblr Feed, Flickr Album, Slack Channels, Yelp etc., on the dashboard itself.<br \/>\n  New &#8211; Introducing Classic Card Theme for Instagram Feed, Twitter Feed, Facbook Feed, YouTube Feed, RSS Feed, Pinterest Feed. It is slighty round from edges and makes a perfect view for your Instagram Feed, Twitter Feed, Facbook Feed, YouTube Feed, RSS Feed, Pinterest Feed.<br \/>\n  Fix &#8211; Access Token Refresh issue resolved for Instagram. Now Instagram access token get validate successfully for Instagram Handle.<br \/>\n  New &#8211; Introducing Instagram Hashtags, Now you can add Instagram Hashtag Feed to your Instagram Widget and finally embed Instagram Feed from Instagram Hashtag connnection method.<br \/>\n  New &#8211; Introducing Twitter Mentions, Now you can add Twitter Mention Feed to your Twitter Widget and finally embed Twitter Feed from Twitter Mention connnection method.<\/p>\n<h4>1.7<\/h4>\n<p>Social Accounts can be managed within WordPress dashboard. Earlier when you add Instagram Feed, Twitter Feed, YouTube Video and Facebook Video user was not able to see the Instagram Widget, Twitter Widget, YouTube Gallery Widget and Facebook Widget on the dashboard. Now the new dashboard will show your Instagram Feed, Twitter Feed, YouTube video and Facebook Feed in your Instagram Widget, Twitter Widget, YouTube Gallery Widget and Facebook Widget.<br \/>\n  New &#8211; Instagram Tagged: Introducing Instagram tagged connection type to collect Instagram Tag posts on your Instagram Widget. Finally, you can embed Instagram feed with Instagram Tag posts to your wordpress website.<br \/>\n  Fix &#8211; Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews &#8211; layouts.<br \/>\n  New &#8211; Twitter favorites: Introducing Twitter favorites: Now you can collect Twitter Feed using Twitter Favorite connection method to your Twitter widget and embed twitter feed on website.<\/p>\n<h4>1.6<\/h4>\n<p>Making the world&#8217;s easiest Social media feeds plugin for wordpress. Now create and manage social media feeds directly from your wordpress dashboard and chat directly to our experts for any support.<br \/>\n  Fix &#8211; Access Token Refresh for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<br \/>\n  Fix &#8211; Access Token Refresh for 2nd feed created in a widget for all Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<br \/>\n  Fix &#8211; Cache Issue resolved of 2nd widget if created using Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<\/p>\n<h4>1.5<\/h4>\n<p>Fix &#8211; Bugs Fixes for Youtube video and Youtube playlist: Now you can create YouTube Gallery using new themes &amp; layouts. Also YouTube video can be added in Youtube Gallery from any playlist.<br \/>\n  Fix &#8211; Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Playlist, Google Reviews.<br \/>\n  New &#8211; Introducing custom posts feature to add custom Instagram Feed, custom Facebook Feed, custom Twitter Feed, custom Google Reviews Feed, custom Pinterest Feed, custom YouTube Feed, etc.<br \/>\n  Fix &#8211; Miscellaneous styling for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<\/p>\n<h4>1.4<\/h4>\n<p>Fix &#8211; Bugs Fixes for Youtube channel video: Earlier when collecting Youtube Videos, YouTube Channel wasn&#8217;t properly added. Now after fix you can add youtube video and create a Youtube Gallery using any YouTube Channel.<br \/>\n  Fix &#8211; Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Themes &amp; Layouts.<br \/>\n  Fix &#8211; Cache optimized for Instagram Feed, Twitter Feed, Facbook Feed, Google Reviews, YouTube Feed.<br \/>\n  New &#8211; Introducing Modern Card Theme for Instagram Feed, Twitter Feed, Facbook Feed, YouTube Feed, RSS Feed, Pinterest Feed.<br \/>\n  New &#8211; Introducing option to upload profile picture for Instagram Feed, Twitter Feed, Facbook Feed, YouTube Feed, RSS Feed, Pinterest Feed.<\/p>\n<h4>1.3<\/h4>\n<p>Fix &#8211; Fixed Instagram Feed Bugs and Improved Facebook Feed, Google Reviews Design.<br \/>\n  Fix &#8211; Layout loading is fixed. Now your Instagram feed, Facebook Feed, Google Reviews, Twitter Feed, YouTube feed will display in the proper alignment.<br \/>\n  New &#8211; Instagram Mentions: Introducing Instagram Mentions, Now you can add Instagram Mention Feed to your Instagram Widget and finally embed Instagram Feed from one more connnection method.<br \/>\n  New &#8211; Introducing Snapcard Theme for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, YouTube Feed to display galleries such as Instagram Gallery, Facebook Gallery, Twitter Gallery, YouTube Gallery on your website.<\/p>\n<h4>1.2<\/h4>\n<p>New &#8211; Improved Design for the better view of the Instagram Feed, Twitter Feed, Google Review &amp; Facebook Feed in Plugin.<br \/>\n  New &#8211; Now you can collect Instagram Feed and filter Instagram Feed as per your requirements. Not only that but you can also add Instagram Feed to your Instagram Widget and switch between different themes &amp; layouts to make your Instagram Feed best suit your website.<br \/>\n  New &#8211; Collect Twitter Feed and filter Twitter Feed as per your requirements. Not only that but you can also add Twitter Feed to your Twitter Widget and choose between different themes &amp; layouts to make your Twitter Feed best suit your website style.<br \/>\n  Fix &#8211; Cache problem is fixed now that will allow you to load your Instagram Feed, Facebook Feed, Twitter Feed, YouTube Feed, Google Review Feed faster on your website.<\/p>\n<h4>1.1<\/h4>\n<p>Fix &#8211; Fixed Bugs for Linkedin Post, Instagram Feed and Facebook Feed also Improved Design for the better view of the plugin.<br \/>\n  New &#8211; Instagram Handle: Now you can Embed Instagram Feed using Instagram Handle and you can also collect Instagram Feed from Instagram Business account to your Instagram Widget. Soon more Instagram connection methods will be released so that you  &hellip;<\/p>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-1.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-1.png?rev=3040127\" alt=\"Example preview of Instagram Feed widget\"><\/a><p>Example preview of Instagram Feed widget<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-2.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-2.png?rev=3040127\" alt=\"Example preview of Instagram Feed, Facebook Feed, YouTube Videos, Twitter Feed widget\"><\/a><p>Example preview of Instagram Feed, Facebook Feed, YouTube Videos, Twitter Feed widget<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-3.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-3.png?rev=3040127\" alt=\"Example Website with Google Review Widget Grid Layout\"><\/a><p>Example Website with Google Review Widget Grid Layout<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-4.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-4.png?rev=3040127\" alt=\"Example Website with Google Review Widget Carousel\/Slider Layout\"><\/a><p>Example Website with Google Review Widget Carousel\/Slider Layout<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-5.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-5.png?rev=3040127\" alt=\"Example Website with Google Review Widget List\/Table Layout\"><\/a><p>Example Website with Google Review Widget List\/Table Layout<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-6.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-6.png?rev=3040127\" alt=\"Signup to your Tagembed Social Media Feeds Plugin Account\"><\/a><p>Signup to your Tagembed Social Media Feeds Plugin Account<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-7.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-7.png?rev=3040127\" alt=\"Add Instagram Feed, Facebook Feed, YouTube Videos, Linkedin Feed, Twitter Feed, Stories, Reels, etc., on Social Media Feeds Widget.\"><\/a><p>Add Instagram Feed, Facebook Feed, YouTube Videos, Linkedin Feed, Twitter Feed, Stories, Reels, etc., on Social Media Feeds Widget.<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-8.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-8.png?rev=3040127\" alt=\"Copy and Paste Shortcode on your Page or Post to display Social media feeds\"><\/a><p>Copy and Paste Shortcode on your Page or Post to display Social media feeds<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-9.png?rev=3040127\"><img src=\"https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-9.png?rev=3040127\" alt=\"Choose from 10+ Themes and Layouts\"><\/a><p>Choose from 10+ Themes and Layouts<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Superpatiently<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/kueper2020\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1ea2f2bd7a37fc73124db086615111b8?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1ea2f2bd7a37fc73124db086615111b8?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/kueper2020\/\" class=\"reviewer-name\">kueper2020<\/a> on <span class=\"review-date\">January 11, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Awesome. Despite working the 1st time in google meet plus encountering various issues with sound Rahul (?) guided me through the entire process with endless patience and professionalism. Finally got my widget reconnected and running. Thank you!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Awesome plugin !!!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/nguyentramy87\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/420728715378e730230d9a8ede9c5378?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/420728715378e730230d9a8ede9c5378?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/nguyentramy87\/\" class=\"reviewer-name\">Winnie Yuen <small>(nguyentramy87)<\/small><\/a> on <span class=\"review-date\">December 20, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">As someone who regularly manages a WordPress site, I'm always on the lookout for plugins that not only ease my workflow but also enhance the user experience. Tagembed has been a game-changer in this aspect, particularly with its Twitter feed embedding capabilities.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Ease of Use:<br \/>Right from the start, Tagembed impresses with its user-friendly interface. Setting up and embedding a Twitter feed into my website was a breeze. The process is intuitive, which is a huge plus for both beginners and seasoned WordPress users.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Customization and Flexibility:<br \/>What sets Tagembed apart is its customization options. I could tailor the Twitter feed to match the look and feel of my website seamlessly. The flexibility to adjust layouts, designs, and even filter content means I can keep my feed relevant and engaging.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Support and Updates:<br \/>The support team deserves a special mention. They are responsive and genuinely helpful. Regular updates keep the plugin running smoothly, ensuring compatibility with the latest WordPress versions.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Highly recommended for its simplicity, efficiency, and excellent support !!!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Fantastic support!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/carlosesierra\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/6dcb506ffd1ab7d25ca74f3e698d97d4?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/6dcb506ffd1ab7d25ca74f3e698d97d4?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/carlosesierra\/\" class=\"reviewer-name\">carlosesierra<\/a> on <span class=\"review-date\">December 15, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">As mentioned Fantastic support. They took the time and went the extra mile to assist me and set me on the right direction on the implementation on the plugin. Thanks to Gaurav and the team! <\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good and fast support!<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/nsyahfiqa\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/0bdcffbb1105d5be6a840c9add926844?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/0bdcffbb1105d5be6a840c9add926844?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/nsyahfiqa\/\" class=\"reviewer-name\">nsyahfiqa<\/a> on <span class=\"review-date\">December 14, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I have problem with the FB connection and they directly helped me solve it. They also explain on why does the issue occur to me.<br \/>Apparently due to connecting different account.<br \/>Thanks for the great support! <\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Amazing Options and Amazing Support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/spyk-e\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/7eedc9db50f3aaa15dbbbb66e45f9ebb?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/7eedc9db50f3aaa15dbbbb66e45f9ebb?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/spyk-e\/\" class=\"reviewer-name\">spyk-e<\/a> on <span class=\"review-date\">December 2, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Ok so I am not one for writing a review unless it really is needed and first the options and flexibility (and ease of use) of the Tagembed solution is absolutely amazing! - now I did read reviewed of the great customer service and have to say this is the best customer service (Emma) I have ever experienced! so amazing job, many thanks and please keep going!!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">I love the plugin it solves my problem to display maximum social posts<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/visionglobalaus\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/5f841849929ed60f1a24b1d648ff0fd0?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/5f841849929ed60f1a24b1d648ff0fd0?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/visionglobalaus\/\" class=\"reviewer-name\">visionglobalaus<\/a> on <span class=\"review-date\">November 21, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Even their free version and support is outstanding, specially Emma the great customer support agent ... Thanks for the great plugin<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Very useful app! Incredible staff<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/andreaottaviano\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/0d01e0d90ee1cda12e2038b6dad762cd?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/0d01e0d90ee1cda12e2038b6dad762cd?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/andreaottaviano\/\" class=\"reviewer-name\">andreaottaviano<\/a> on <span class=\"review-date\">October 23, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I've downloaded the app for implementing LinkedIn feed on my website. I must say the app is very intuitive and good looking. Also, the team is fanstastic, always ready to help you. I recommand it!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/alexanderzachcorporateidentityfi\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/c7f945f76dd0fd84de68cc6211f39002?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/c7f945f76dd0fd84de68cc6211f39002?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/alexanderzachcorporateidentityfi\/\" class=\"reviewer-name\">alexanderzachcorporateidentityfi<\/a> on <span class=\"review-date\">October 22, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Good and quick support!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good plugin with great support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/thpadelis\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/10ce46ac9720f1e72d6c5aa6c357f822?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/10ce46ac9720f1e72d6c5aa6c357f822?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/thpadelis\/\" class=\"reviewer-name\">Pantelis Theodosiou <small>(thpadelis)<\/small><\/a> on <span class=\"review-date\">September 29, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">The plugin functions like magic, and the support team is fantastic. Thank You Very Much.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great plugin with great support.<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/lunagariyavishal\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/6196b26b3380f9035da93a4cbbb714fd?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/6196b26b3380f9035da93a4cbbb714fd?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/lunagariyavishal\/\" class=\"reviewer-name\">lunagariyavishal<\/a> on <span class=\"review-date\">September 29, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">The Support team is awesome, the plugin works like magic. Thank You Big Time.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "Collect &amp; Embed Instagram Feed, Embed Facebook Feed, Embed YouTube Videos, Embed Twitter Feed, Google Reviews &amp; 15+ Social Media Feed on website.",
    "description": "<p>Tagembed is a leading <strong>social media aggregator<\/strong> tool that lets users to aggregate (hashtag feed, handle feed, page feed, album feed), curate and embed <a href=\"https:\/\/www.instagram.com\/\" rel=\"nofollow ugc\">Instagram<\/a> Feed, Twitter Feed, Facebook Feed, YouTube Video, Google Reviews, RSS Feed, Linkedin Feed and 15+ more social feed networks. The plugin is extremely easy to use and has a no-complex structure. Users can enhance the overall look and efficiency of the widget by using a wide variety of customization &amp; personalization options offered by Tagembed &#8211; Social Media Feeds.<\/p>\n<p>Creating UGC Galleries or displaying social media feeds on websites is every brand’s best bet due to the amazing benefits like social connectivity, engagement and more that comes along with it. Join along and enjoy the advantages simply by installing the Tagembed <a href=\"https:\/\/tagembed.com\/wordpress-widget\/\" rel=\"nofollow ugc\">Best Social Media Widget WordPress Plugin<\/a><\/p>\n<h4>Update v4.7<\/h4>\n<p><strong>Instagram Handle Feed<\/strong> &#8211; Now you can collect public Instagram Profile posts and then <a href=\"https:\/\/tagembed.com\/blog\/embed-instagram-feed-on-website-for-free\/\" rel=\"nofollow ugc\">embed Instagram Feed on website<\/a>.<br \/>\n<strong>Facebook Page Feed<\/strong> &#8211; Now you can collect public Facebook Page posts and then embed Facebook Page Feed on website.<br \/>\n<strong>New Theme<\/strong> &#8211; Introducing New Vivid Theme to showcase your social media feed in colorful variations.<\/p>\n<h4>Update v4.6:<\/h4>\n<p><strong>Airbnb Experiences Review<\/strong> &#8211; New connection method to collect Airbnb reviews<br \/>\n<strong>Slack Widget<\/strong> &#8211; Introducing a new network Slack Feed for your website.<br \/>\n<strong>Vimeo Widget<\/strong> &#8211; Introducing a new network Vimeo Video Widget for your website.<br \/>\n<strong>Amazon Review Widget<\/strong> &#8211; Introducing new network Amazon Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-amazon-reviews-on-website\/\" rel=\"nofollow ugc\">embed Amazon reviews<\/a> to your website directly.<br \/>\n<strong>Tripadvisor Review Widget<\/strong> &#8211; Introducing new network Tripadvisor Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-tripadvisor-reviews-on-website\/\" rel=\"nofollow ugc\">add Tripadvisor reviews<\/a> to your WordPress website directly.<br \/>\n<strong>Aliexpress Review Widget<\/strong> &#8211; Introducing new network Aliexpress Reviews to <a href=\"https:\/\/tagembed.com\/blog\/embed-aliexpress-reviews-on-website\/\" rel=\"nofollow ugc\">embed Aliexpress reviews<\/a> to your WordPress website directly.<br \/>\n<strong>Analytics 2.0<\/strong><\/p>\n<h3>Note:<\/h3>\n<p>We provide shortcodes in JS for SEO Friendly widget for your website.<br \/>\nNew: Introducing TikTok Video, LinkedIn Hashtag Feed, Flickr Album, VK Feed and Instagram Stories in Tagembed social media feed WordPress Plugin.<\/p>\n<h3>How to Embed Social Media Feeds on WordPress using Tagembed WP Plugin<\/h3>\n<p>= Watch Full Video to understand the plugin better =<\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4FI2A5aoaL8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h3>Aggregate Content From Various Sources<\/h3>\n<ul>\n<li><strong>Embed Instagram Feed<\/strong>: Seamlessly collect content from one of the most super vibrant platforms with the <a href=\"https:\/\/tagembed.com\/instagram-widget\/wordpress\/\" rel=\"nofollow ugc\">Instagram Feed Widget WordPress<\/a> plugin. Aggregate the content using specific hashtags, usernames, mentions, etc.<\/li>\n<li><strong>Embed Facebook Feed<\/strong>: Collect content from one of the most popular and highly used social feed platforms in the world with the <a href=\"https:\/\/tagembed.com\/facebook-widget\/wordpress\/\" rel=\"nofollow ugc\">Facebook Feed Widget WordPress<\/a> plugin. Fetch content from specific profiles, usernames, mentions, etc.<\/li>\n<li><strong>Embed Twitter Feed<\/strong>: Social media users leverage Twitter as a microblogging platform to express their views and opinions openly. Integrate their Twitter Feed tweets into your marketing campaign using the <a href=\"https:\/\/tagembed.com\/twitter-widget\/wordpress\/\" rel=\"nofollow ugc\">Twitter Feed Widget WordPress<\/a> plugin.<\/li>\n<li><strong>Embed Google Reviews<\/strong>: Does your customers love your products and leave Google reviews? Extract their opinion and integrate Google Reviews into your WordPress website using the <a href=\"https:\/\/tagembed.com\/google-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Google Reviews Widget WordPress<\/a> plugin to win over the trust and confidence of your potential customers!<\/li>\n<li><strong>Embed YouTube Videos<\/strong>: YouTube Videos add liveliness and engagement elements to the website, doesn’t it? Embed Youtube videos hassle-free and without affecting the website speed using the <a href=\"https:\/\/tagembed.com\/youtube-widget\/wordpress\/\" rel=\"nofollow ugc\">YouTube Feed Widget WordPress<\/a> plugin.<\/li>\n<li><strong>Embed Linkedin Feeds<\/strong>: LinkedIn has that professional vibe that everyone loves. Now bring the same vibe to your website using the <a href=\"https:\/\/tagembed.com\/linkedin-widget\/wordpress\/\" rel=\"nofollow ugc\">Linkedin Feed Widget WordPress<\/a> plugin. Display company updates, latest information related to your brand, share expert insights, and more on your website with ease.<\/li>\n<li><strong>Embed RSS Feed<\/strong>: Now showcase blogs, articles, and more from your favorite website. Add RSS feed using <a href=\"https:\/\/tagembed.com\/rss-widget\/wordpress\/\" rel=\"nofollow ugc\">RSS Feed Widget WordPress<\/a> plugin. Hence, make your website more informative and engaging.<\/li>\n<li><strong>Embed Pinterest Feed<\/strong>: Add colorful content and ideas to your website, use Tagembed <a href=\"https:\/\/tagembed.com\/pinterest-widget\/wordpress\/\" rel=\"nofollow ugc\">Pinterest Feed Widget WordPress<\/a> plugin and create an everlasting impression with ideas in front of your visitors.<\/li>\n<li><strong>Embed Airbnb Reviews<\/strong>: Add authenticity of your Airbnb business to your website, using Tagembed <a href=\"https:\/\/tagembed.com\/airbnb-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Airbnb Reviews Widget WordPress<\/a> plugin and build trust among your visitors to grow business.<\/li>\n<li><strong>Embed Yelp Reviews<\/strong>: Win the trust of your potential customers and build trustful relationships with the new &amp; existing ones by opting to embed <a href=\"https:\/\/tagembed.com\/yelp-reviews-widget\/wordpress\/\" rel=\"nofollow ugc\">Yelp review Widget WordPress<\/a> Plugin.<\/li>\n<li><strong>Embed Facebook Reviews<\/strong>: Utilize the power of Facebook’s huge user base. Display the consumer reviews from Facebook Page, as Tagembed lets you to embed <a href=\"https:\/\/tagembed.com\/facebook-reviews-widgets\/wordpress\/\" rel=\"nofollow ugc\">Facebook reviews Widget WordPress<\/a> Plugin with ease.<\/li>\n<li><strong>Embed From Other Platforms<\/strong>: Apart from these, collect content from social media platforms like Pinterest, RSS, Airbnb, Yelp reviews, TikTok, Etsy reviews, Tumblr, etc.<\/li>\n<\/ul>\n<h3>Simple Steps to Embed Social Media Feed on WordPress Website<\/h3>\n<h4>Install Tagembed WordPress Plugin<\/h4>\n<ul>\n<li>Go to the Plugin Section on your WordPress dashboard and click on &#8220;Add New&#8221;.<\/li>\n<li><strong>Search Tagembed<\/strong> then <strong>Install &amp; Activate<\/strong> the plugin to get started.<\/li>\n<li>or You can Download the .zip file &amp; Upload the Tagembed Plugin then click &#8220;Activate&#8221; the Tagembed Widget.<\/li>\n<li>Register or Sign Up on Tagembed WordPress plugin.<\/li>\n<\/ul>\n<h4>Steps to Embed Instagram Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram<\/strong> or <strong>Instagram Business<\/strong> to collect Instagram feeds.<\/li>\n<li>Select your Instagram feed filter connection type from: Instagram handle, Instagram hashtag, Instagram mention, Instagram profile, Instagram stories, Instagram Reels, IGTV etc. to fetch Instagram feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Instagram feed style and filter Instagram feeds as per your requirement to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-instagram-feed-on-wordpress\/\" rel=\"nofollow ugc\">Embed Instagram Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Feed Widget successfully.<\/li>\n<\/ul>\n<p>Note: In Instagram Widget &#8211; Instagram Reels &amp; Instagram Stories are only available on Paid Plans.<\/p>\n<h4>Steps to Embed Facebook Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Facebook<\/strong> to collect Facebook feeds.<\/li>\n<li>Select your Facebook feed filter connection type from: Facebook Page, Facebook Page Reviews, Facebook Album etc to fetch Facebook feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Facebook feed style and filter Facebook feeds as per your requirement to display only relevant and genuine Facebook Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Facebook Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-facebook-feed-on-wordpress-website\/\" rel=\"nofollow ugc\">Embed Facebook Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Facebook Feed Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Twitter Feed on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Twitter<\/strong> to collect Twitter feeds.<\/li>\n<li>Select your Twitter feed filter connection type from: Twitter handle, Twitter hashtag, Twitter List, Twitter Favorites, Twitter Advanced (Query), etc. to fetch Twitter feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Twitter feed style and filter Twitter feeds as per your requirement to display only relevant and genuine Twitter Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Twitter Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/add-twitter-feeds-on-wordpress\/\" rel=\"nofollow ugc\">Embed Twitter Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to get it updated on <a href=\"https:\/\/tagembed.com\/twitter-widget\/\" rel=\"nofollow ugc\">Twitter Widget<\/a> and then embed Twitter Feed Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Google Reviews on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Google Review<\/strong> to collect Google Reviews in other words user reviews.<\/li>\n<li>Select your Google Reviews feed filter connection type from: My Places, Places, etc. to fetch Google Reviews as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize <a href=\"https:\/\/tagembed.com\/google-review-widget\/\" rel=\"nofollow ugc\">Google Review Widget<\/a> successfully style and filter Google Reviews as per your requirement to display only relevant and genuine Google Reviews on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Google Reviews and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-google-reviews-on-wordpress\/\" rel=\"nofollow ugc\">Embed Google Reviews on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Google Review Widget.<\/li>\n<\/ul>\n<p>Note: In Google Review Widget Upcoming google review feed will not be automatically updated for free plan users.<\/p>\n<h4>Steps to Embed YouTube Videos or YouTube Gallery on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>YouTube<\/strong> to collect YouTube Videos.<\/li>\n<li>Select your YouTube feed filter connection type from: YouTube Channel, YouTube Playlist, YouTube Shorts etc. to fetch YouTube Videos as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize YouTube Gallery Widget style and filter YouTube Videos as per your requirement to display only relevant and genuine YouTube Video on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the YouTube Gallery and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-youtube-video-on-wordpress\/\" rel=\"nofollow ugc\">Embed YouTube Video Gallery on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed YouTube Video Gallery successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Linkedin Feeds on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Linkedin<\/strong> to collect LinkedIn Feeds.<\/li>\n<li>Select your Linkedin feed filter connection type from: Linkedin Company Page URL, Linkedin Post URL, Linkedin Profile to fetch Linkedin Posts as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Linkedin Feed Widget style and filter Linkedin Posts as per your requirement to display only relevant and genuine Linkedin Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Linkedin Posts and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/support\/embed-linkedin-feeds-on-wordpress\/\" rel=\"nofollow ugc\">Embed Linkedin Feed on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Linkedin Feed Widget successfully.<\/li>\n<\/ul>\n<p>Note: Company Page URL, Profile &amp; Hashtag &#8211; For Linkedin Widget users this method is only available with the <strong>Plus Plan<\/strong>.<\/p>\n<h3>Types of Instagram Feed Source and How to collect, curate and embed Instagram Feed on WordPress<\/h3>\n<h4>Steps to Embed Instagram Reels on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram<\/strong> to collect Instagram Reels Feed.<\/li>\n<li>Select your Instagram Feed filter connection type as Instagram Reels from: Instagram handle, Instagram Reels to collect Instagram Reels as per your preference.<\/li>\n<li>Now Choose Theme from <strong>10+ Layouts<\/strong> (Recommended &#8211; Story Theme), Then personalize your Instagram feed style using card style settings and filter Instagram feed to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Reels and then <strong>Copy ShortCode<\/strong> to Embed Instagram Reels on WordPress.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Reels Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Instagram Hashtag on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Instagram Business<\/strong> to collect Instagram Hashtag Feed.<\/li>\n<li>Select your Instagram Feed filter connection type as Instagram Hashtag from: Instagram handle, Instagram Hashtag, Instagram Mention, Instagram Tagged, Instagram Story etc to collect Instagram Hashtag as per your preference.<\/li>\n<li>Now Choose Theme from <strong>10+ Layouts<\/strong> (Recommended &#8211; Story Theme), Then personalize your Instagram feed style using card style settings and filter Instagram feed to display only relevant and genuine Instagram Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Hashtag Feed and then <strong>Copy ShortCode<\/strong> to Embed Instagram Hashtag on WordPress.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed Instagram Hashtag Widget successfully.<\/li>\n<\/ul>\n<h4>Steps to Embed Facebook Reviews on WordPress using Tagembed Social Media Feed WordPress plugin<\/h4>\n<ul>\n<li>Click on <strong>Add Feed<\/strong> and select network as <strong>Facebook<\/strong> to collect Facebook feeds.<\/li>\n<li>Select your Facebook feed filter connection type as Facebook Reviews Feed from: Facebook Reviews, Facebook Album, Facebook Mentions, Facebook Profile, Fb Page, etc to fetch Facebook feeds as per your preference.<\/li>\n<li>Choose Theme from <strong>10+ Layouts<\/strong>, Personalize Facebook feed style and filter Facebook feeds as per your requirement to display only relevant and genuine Facebook Feed on WordPress website.<\/li>\n<li>Click on the Display tab Section to preview the Facebook Feed or FB Reviews Feed and <strong>Copy ShortCode<\/strong> to <a href=\"https:\/\/tagembed.com\/blog\/embed-facebook-reviews-on-wordpress\/\" rel=\"nofollow ugc\">Embed FB Reviews on WordPress<\/a>.<\/li>\n<li>Paste the shortcode on your desired page or post and update it to embed <a href=\"https:\/\/tagembed.com\/facebook-review-widget\/\" rel=\"nofollow ugc\">Facebook Reviews Widget<\/a> successfully.<\/li>\n<\/ul>\n<p>By following the above mentioned steps you will be able to successfully <a href=\"https:\/\/tagembed.com\/blog\/add-social-media-feed-to-wordpress\/\" rel=\"nofollow ugc\">add social media feed to WordPress<\/a> website in just a few mins.<\/p>\n<h3>Main Features Of The Tagembed Social Media Feeds WordPress Plugin<\/h3>\n<ul>\n<li><strong>Instant real-time content update<\/strong>: The social media widget on website gets updated automatically the moment a new content is uploaded on the social platform. In simply words, it enables curating and displaying the fresh content automatically on website.<\/li>\n<li><strong>Card Style<\/strong>: Personalize your card style as you love, with so many options to choose from like theme mode, aspect ratio, edge style, font, CTA, and more.<\/li>\n<li><strong>Content moderation<\/strong>: With a dynamic filtering options, curate and manage the social content before embedding it on your website. It lets you filter unwanted &amp; irrelevant social media content to fetches the highest quality content to display on website.<\/li>\n<li><strong>Custom CSS<\/strong>: Want to make your own custom design? Your ideas of a more creative, personalized, &amp; engaging social media widget will come to existence with the help of custom CSS features offered by Tagembed.<\/li>\n<li><strong>Robust analytics<\/strong>: The flexible and robust in-built analytics feature integrated into the platform manages the social media widget’s performance by creating reports regarding views, active users, customer engagement, total impressions, click-through rates, sentiments, etc.<\/li>\n<li><strong>Code-free<\/strong>: Using Tagembed social media feed wordpress plugin is entirely coding-free. It doesn’t require any special expertise and liberates you from pesky codes and their complex integration methods.<\/li>\n<\/ul>\n<h3>Why Choose The Tagembed WordPress Plugin?<\/h3>\n<ul>\n<li><strong>Escalated Sales &amp; Conversions<\/strong>: Got a <a href=\"https:\/\/tagembed.com\/blog\/5-star-google-reviews-ratings-for-business\/\" rel=\"nofollow ugc\">5-star Google reviews rating<\/a>? How about flaunting them in front of your visitors to build credibility? Showcase consumers, not only from Google but also from various other <a href=\"https:\/\/tagembed.com\/blog\/best-reviews-platforms\/\" rel=\"nofollow ugc\">review platforms<\/a>, to prove proof of your reliability. More than 85% of customers go through User-Generated Content during their purchase-related decisions. Once you have the trust and confidence of your customers, they will be more likely to purchase your products.<\/li>\n<li><strong>Robust Customer Support<\/strong>: We highly value and love our users and work hard to let them enjoy a seamless experience. However, if you come across any technical glitch or hindrance using the plugin, reach out to us and we will get back to you right away. Tagembed is an alternative to smash balloon, WPZoom social feed widget, Feed Them Social &#8211; Photo Galleries, 10websocial, spotlight social feeds, feedzy RSS Aggregator, Social Feed Gallery, Easy Social Feed &#8211; social photos gallery, Social Slider Feed, BlossomThemes Social Feed.<\/li>\n<\/ul>\n<h3>Support<\/h3>\n<p>We provide remarkable instant service we’d want to experience ourselves!!<br \/>\nFor any query, contact us at: <a href=\"mailto:&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#116;a&#103;e&#x6d;&#098;&#x65;&#100;&#x2e;&#099;&#x6f;&#109;\" rel=\"nofollow ugc\">&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#116;a&#103;e&#x6d;&#098;&#x65;&#100;&#x2e;&#099;&#x6f;&#109;<\/a><\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.5.1.zip",
    "upgrade_notice": {
        "5.1": "<ul>\n<li>New: Inherit feature - to automatically align your website font style &amp; colors with widget.<\/li>\n<\/ul>"
    },
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-1.png?rev=3040127",
            "caption": "Example preview of Instagram Feed widget"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-2.png?rev=3040127",
            "caption": "Example preview of Instagram Feed, Facebook Feed, YouTube Videos, Twitter Feed widget"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-3.png?rev=3040127",
            "caption": "Example Website with Google Review Widget Grid Layout"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-4.png?rev=3040127",
            "caption": "Example Website with Google Review Widget Carousel\/Slider Layout"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-5.png?rev=3040127",
            "caption": "Example Website with Google Review Widget List\/Table Layout"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-6.png?rev=3040127",
            "caption": "Signup to your Tagembed Social Media Feeds Plugin Account"
        },
        "7": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-7.png?rev=3040127",
            "caption": "Add Instagram Feed, Facebook Feed, YouTube Videos, Linkedin Feed, Twitter Feed, Stories, Reels, etc., on Social Media Feeds Widget."
        },
        "8": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-8.png?rev=3040127",
            "caption": "Copy and Paste Shortcode on your Page or Post to display Social media feeds"
        },
        "9": {
            "src": "https:\/\/ps.w.org\/tagembed-widget\/assets\/screenshot-9.png?rev=3040127",
            "caption": "Choose from 10+ Themes and Layouts"
        }
    },
    "tags": {
        "facebook": "facebook",
        "google-reviews": "Google Reviews",
        "instagram": "Instagram",
        "instagram-feed": "instagram feed",
        "twitter": "twitter"
    },
    "stable_tag": "5.1",
    "versions": {
        "3.10": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.3.10.zip",
        "3.9": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.3.9.zip",
        "4.0": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.0.zip",
        "4.1": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.1.zip",
        "4.2": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.2.zip",
        "4.3": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.3.zip",
        "4.4": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.4.zip",
        "4.5": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.5.zip",
        "4.6": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.6.zip",
        "4.7": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.7.zip",
        "4.8": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.8.zip",
        "4.9": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.4.9.zip",
        "5.0": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.5.0.zip",
        "5.1": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.5.1.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/tagembed-widget.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https:\/\/tagembed.com\/",
    "banners": {
        "low": "https:\/\/ps.w.org\/tagembed-widget\/assets\/banner-772x250.jpg?rev=2832110",
        "high": "https:\/\/ps.w.org\/tagembed-widget\/assets\/banner-1544x500.jpg?rev=2832110"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/tagembed-widget\/assets\/icon-256x256.png?rev=2832110",
        "2x": "https:\/\/ps.w.org\/tagembed-widget\/assets\/icon-256x256.png?rev=2832110"
    },
    "blocks": {
        "tagembed-block\/tagembed": {
            "name": "tagembed-block\/tagembed",
            "title": "Tagembed Widget"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 82,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}