{
    "name": "Timetics- AI-powered Appointment Booking with Visual Seat Plan and ultimate Calendar Scheduling",
    "slug": "timetics",
    "version": "1.0.20",
    "author": "<a href=\"https:\/\/arraytics.com\/\">Arraytics<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/arraytics\/",
    "contributors": {
        "arraytics": {
            "profile": "https:\/\/profiles.wordpress.org\/arraytics\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/722ee7f1a8a3604572eb6ae642430235?s=96&d=monsterid&r=g",
            "display_name": "Arraytics"
        },
        "abrasel600": {
            "profile": "https:\/\/profiles.wordpress.org\/abrasel600\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/be9ffb95a927c1d29b432a2d3260a12c?s=96&d=monsterid&r=g",
            "display_name": "Abdur Rahim Rasel"
        },
        "rezakhan995": {
            "profile": "https:\/\/profiles.wordpress.org\/rezakhan995\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/1539ed7cc23384ebf34f954bc128ea38?s=96&d=monsterid&r=g",
            "display_name": "Reza Khan"
        }
    },
    "requires": "5.2",
    "tested": "6.4.4",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 4,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/timetics\/",
    "support_threads": 4,
    "support_threads_resolved": 3,
    "active_installs": 1000,
    "downloaded": 15195,
    "last_updated": "2024-03-11 8:58am GMT",
    "added": "2023-01-30",
    "homepage": "https:\/\/arraytics.com\/timetics\/",
    "sections": {
        "description": "<p><em><a href=\"https:\/\/arraytics.com\/timetics\" rel=\"nofollow ugc\">Timetics<\/a><\/em> is an advanced booking plugin for WordPress. You can create and manage online schedules and unlimited appointments with Timetics. Integration of stripe payment gateways makes it easy to get paid smoothly.<\/p>\n<p>You can use the shortcode to add your schedule to any page. Your customers can book appointments, and Timetics also allows you to add bookings manually.<\/p>\n<p><em>Need help setting up your appointment Website? 👉 <a href=\"https:\/\/arraytics.com\/support\" rel=\"nofollow ugc\">Contact Us Here<\/a>.<\/em><\/p>\n<p><em>A few more helpful links here 👇<\/em><\/p>\n<p><em><a href=\"https:\/\/products.arraytics.com\/timetics\/booking\" rel=\"nofollow ugc\">Live Demo<\/a> | <a href=\"https:\/\/arraytics.com\/timetics\/\" rel=\"nofollow ugc\">Buy Pro<\/a> | <a href=\"https:\/\/docs.arraytics.com\" rel=\"nofollow ugc\">Documentation<\/a> | <a href=\"https:\/\/arraytics.com\/timetics-roadmaps\" rel=\"nofollow ugc\">Roadmaps<\/a><\/em><\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/qBqTz2wF3kk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<p>👍 Use this unique plugin and sell your schedule online. It will be helpful for coaches, consultants, mentors, teachers, and so on. If you want to manage your schedule online, Timetics is the plugin, you need now!<\/p>\n<h3>⭐ Timetics Features &#8211; Create Meetings &amp; Appointments, Track Meetings on Calendar, Charge Appointment Invitees, Do Virtual Meetings, and More<\/h3>\n<p>From creating meetings to receiving payments from customers\/clients &#8211; everything is possible through Timetics. Take a quick look at all the features of Timetics and take the first step to reach new heights with your business.<\/p>\n<h3>👉 Unlimited Meetings<\/h3>\n<p>Sky is the boundary while taking new participants in any meeting. It allows for an unlimited number of meetings to be scheduled, with no limit on the number of participants or the duration of the meetings.<\/p>\n<h3>👉 Unlimited Bookings<\/h3>\n<p>For any meeting, you can take unlimited booking. This is the way, you can take numbers of customers depending on your business. And the best part is, you don&#8217;t need to spend extra for taking unlimited booking.<\/p>\n<h3>👉 Unlimited Staff Members<\/h3>\n<p>You can add as many staff\/team members you need for your business and you won&#8217;t need to pay any extra dime for that. Inviting your staff\/team members is also very easy.<\/p>\n<h3>👉 One-to-One Meetings<\/h3>\n<p>In Timetics, you can easily arrange One-to-One meetings through Google Meet or in any location Time-Zone you prefer. You can set meeting duration, appointment price, meeting time, and you or your staff\/team member&#8217;s availability as well. Check <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/meetings\/one-on-one-meeting\/\" rel=\"nofollow ugc\">our documentation<\/a> to know the full procedure.<\/p>\n<h3>👉 Team Memebrs Management<\/h3>\n<p>There is no need to be concerned if your company employs a large number of people. You can add an unlimited number of team members based on your requirements. Everyone will have a <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/staff-list\/add-new-staff-host\/\" rel=\"nofollow ugc\">dedicated profile<\/a> for each member.<\/p>\n<h3>👉 Sales Analytics<\/h3>\n<p>Analytics is one of the important part for any business. From the Timetics analytics, you can see the performance of your business at a glance.<\/p>\n<h3>👉 Email Notification Staff<\/h3>\n<p>While you will add a new members at your meeting, your staff member will get an update email. They need to click on the given link to confirm their memebership.<\/p>\n<h3>👉 Email Notification Customer<\/h3>\n<p>Automatic updates help the admin save time and make it easy to manage meetings and bookings. The feature allows you to send an update to the meeting attendee automatically from the Timetics system. See <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/notifications\/email-notification\/\" rel=\"nofollow ugc\">how it works<\/a><\/p>\n<h3>👉 Google Meet Integration<\/h3>\n<p>Manage your online meeting with the most popular and free meeting platform Google Meet. The easy integration allow you to create and manage your bookings with Google Meet. Check <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/google-meet-calendar-integration\/\" rel=\"nofollow ugc\">our documentation here<\/a><\/p>\n<h3>👉 Google Calendar Integration<\/h3>\n<p>Simplify schedule management with the most popular <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/google-meet-calendar-integration\/\" rel=\"nofollow ugc\">Google calendar<\/a>. It allows you to easily keep your calendar in sync across all devices by linking your Google calendar account, ensuring that all your scheduled meetings and events are up-to-date.<\/p>\n<h3>👉 Stripe Payments Integration<\/h3>\n<p>Stripe is a popular online payment processing and commerce solution for internet businesses of all sizes. You can take appointment payments using <a href=\"https:\/\/stripe.com\" rel=\"nofollow ugc\">Stripe<\/a> on your website. Enable it by following <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/payment-type\/stripe\/\" rel=\"nofollow ugc\">Stripe Documentation<\/a> to make your payment system most customer-friendly.<\/p>\n<h3>👉 WooCommerce Integration<\/h3>\n<p>Now you can receive payments through <a href=\"https:\/\/wordpress.org\/plugins\/woocommerce\/\" rel=\"ugc\">WooCommerce<\/a> along side Stripe and Local Payment options. Just follow the instructions given in <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/payment-type\/woocommerce\" rel=\"nofollow ugc\">our documentation<\/a> and you will be all set.<\/p>\n<h3>👉 Availability Management<\/h3>\n<p>It allows you to manage your <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/general-settings\/general-settings-for-timetics\/\" rel=\"nofollow ugc\">schedule by setting<\/a> from your profile settings, checking your schedule, and booking meetings at convenient times. It also enables you to share your availability with others and schedule meetings quickly and easily.<\/p>\n<h3>👉 Date and time format support<\/h3>\n<p>Timetics support different date formate. You can add different time in your booking. Also both twelve hours and twenty four hours formate supported now.<\/p>\n<h3>👉 Added additional notes on booking<\/h3>\n<p>Taking notes is always important. Specially if it&#8217;s appointment and booking related meeting, then taking additional notes can help a lot. Timetics let&#8217;s your <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/bookings\/frontend-booking\/\" rel=\"nofollow ugc\">cutomers frontend booking<\/a> as per their neccessity.<\/p>\n<h3>👉 Booking status show in booking list<\/h3>\n<p>You can show the booking status in booking list. The feature is helpful for managing booking easily.<\/p>\n<h3>👉 User Dasboard<\/h3>\n<p>With the user dashboard, your customers can edit their profiles, check their booking history, Cancel, and reschedule any of their appointments at anytime. This will make your appointment booking website much more user friendly and your customers&#8217; user satisfaction will increase.<\/p>\n<h3>👉 Timezone Auto Detection<\/h3>\n<p>Suppose you and your client lives in different timezones. You set the meeting time according to your timezone. But for your client, calculating the local time their can be quite a problem. To reduce this problem, Timetics now has auto timezone detection feature. Timetics will automatically detect your client&#8217;s timezone and convert your given time to the client&#8217;s local time. This will remove all confusions about the meeting time.<\/p>\n<h3>👉 Shortcodes<\/h3>\n<p>If you want to add meeting lists and booking form on your website with the least amount of hassle, Timetics Shortcodes are here to save your day and time. More shortcodes features are coming too.<\/p>\n<h3>👉 User Onboarding<\/h3>\n<p>We know its becomes very tough sometimes while getting started with a new plugin. To reduce that hassle of yours, we have added a setup wizard that can help you to set up the basic requirements and show you the feature that you need. This will save a lot of time for you.<\/p>\n<h3>👉 Set Country Code for Phone Number<\/h3>\n<p>You can set your own country code in the phone number field.<\/p>\n<h3>👉 Add guest option on booking<\/h3>\n<p>Enhance your booking experience by easily specifying the number of guests, ensuring a seamless reservation process for groups of all sizes.<\/p>\n<h3>⭐ Timetics Pro Special Features<\/h3>\n<p>Enjoy the exclusive features of Timetics Pro and take your business to the next level. With Timetics Pro, you will have all the flexibilities you need. Take a look at all the exclusive features Timetics Pro Offers.<\/p>\n<h3>👉 One-to-Many Meeting Type (Pro)<\/h3>\n<p>At <a href=\"https:\/\/arraytics.com\/timetics\" rel=\"nofollow ugc\">Timetics<\/a>, meeting type one to many feature is available. It allows the admin to host special meeting where host will be one but participants can be one or more. This is one of the ideal meeting type, ussually called <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/meetings\/one-on-many-meeting\/\" rel=\"nofollow ugc\">one to many meeting<\/a>, for class room, online group hangout, technical consultancy.<\/p>\n<h3>👉 One-to-Many Meetings with Seat Plan (Pro)<\/h3>\n<p>You can sell visual placement based ticket with <a href=\"https:\/\/arraytics.com\/timetics\/\" rel=\"nofollow ugc\">Timetics<\/a>. The feature is now ready to help you selling <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/one-to-many-with-seat-mappro\/seatplan-from-frontend\/\" rel=\"nofollow ugc\">conferce ticket<\/a>, salun booking, theater hall booking and much more. Once admin allows, the users can choose the best seat and location for their needs. You can also use this visual seating plan feature to create a visual seat map for your restaurant as well.<br \/>\nOther important features added at Timetics recently:<br \/>\n<strong>👉 Filter on booking entry<\/strong><br \/>\n<strong>👉 Filter for meeting data<\/strong><\/p>\n<h3>👉 Customizable Booking Form<\/h3>\n<p>Getting to know about the case of the client\/customer before the meeting can save a lot of time at the meeting. Now, you can add custom fields to the booking form. With it, you can seve a lot of time at the meeting and make the time as effective as possible.<\/p>\n<h3>👉 Zoom Integration<\/h3>\n<p>We know that a lot of you are more comfortable using Zoom over Google Meet. <a href=\"https:\/\/zoom.us\/\" rel=\"nofollow ugc\">Zoom<\/a> has many useful features that Google Meet doesn&#8217;t have. That is why we have integrated Zoom so that you can go on with your <em>virtual meetings<\/em> and utilize all the exclusive features of Zoom by <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/zoom-integration\/\" rel=\"nofollow ugc\">integrating it<\/a>.<\/p>\n<h3>👉 FluentCRM Integration<\/h3>\n<p>No matter what business you do, Email marketing is very essential to keep the business going. That is why, we have integrated <a href=\"https:\/\/wordpress.org\/plugins\/fluent-crm\/\" rel=\"ugc\">FluentCRM<\/a> with Timetics. Now, you can run your business operations all from a single platform. Read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/fluentcrm-integrationpro\/\" rel=\"nofollow ugc\">our documentation<\/a> to know more details.<\/p>\n<h3>👉 iCal Integration<\/h3>\n<p>After integrating Google Calendar, we integrated iCal into Timetics. Now, apart from Google Calendar, you can also keep track of your future meetings on iCal as well. You can check out <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/apple-outlook-canlendar-integration\/\" rel=\"nofollow ugc\">the documentation<\/a> to know how to enable it.<\/p>\n<h3>👉 Outlook Calendar Integration<\/h3>\n<p>You will now be able to keep track of your meetings with Microsoft Outlook Calendar as well. Check out <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/apple-outlook-canlendar-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> on how you can enable Outlook Calendar with Timetics to know the full procedure.<\/p>\n<h3>👉 Pabbly Integration<\/h3>\n<p>With Pabbly you can integrate services and automate multiple software to your website in a way that data can be transferred among them smoothly. This will make your workflow smooth as butter. Give <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/pabbly-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> a read to know how you can enable Pabbly on your site.<\/p>\n<h3>👉 Zapier Integration<\/h3>\n<p>Zapier is an online platform that can help you to automate your workflow by connecting the apps and services you use. You can get your automated booking forms submitted through Zapier and everything will be easy for you to operate. Read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/zapier-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> on how to get Zapier step-by-step guide.<\/p>\n<h3>👉 Artificial Intelligence<\/h3>\n<p>Its the era of Artificial Intelligence (AI) and as a booking management plugin of this era, Timetics won’t fall behind. We have completed the first phase of AI integration with Timetics. Now, your customers will receive meeting recommendations based on their previous booking history.<br \/>\nThis will intrigue your customers to book more meetings and as a result your business will grow in a fast pace. To get a step-by-step guide, read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/openai-integration\/\" rel=\"nofollow ugc\">our documentation<\/a>.<\/p>\n<h3>👉 Availability Preference<\/h3>\n<p>There are times when we don&#8217;t feel like working or we need to keep the office close on public holidays. With the availability preference feature, you will be able to overwrite your availability schedule whenever you like.<\/p>\n<h3>👉 Reschedule Appointments<\/h3>\n<p>There are times when you need to reschedule an appointment due to unavoidable reasons. With this feature, you can change the schedule of any appointments with ease.<\/p>\n<h3>👉 Recurring Appointments<\/h3>\n<p>You no longer need to create and book the same appointment over and over again. With the recurring appointment feature, you can automate any number of meetings that needs to be done repetitively.<\/p>\n<h3>👉 WhatsApp Integration<\/h3>\n<p>With the Twilio Integration at your disposal, you can now send and receive SMS notification through WhatsApp and make a new way to connect with your clients.<\/p>\n<h3>👉 Select Multiple Host for a Meeting<\/h3>\n<p>This feature is pretty much self explanatory. You can select multiple host for a meeting from the admin dashboard without any hassle whatsoever.<\/p>\n<h3>👉 Niche based solutions<\/h3>\n<p>Make niche-oriented customizable appointments that relate to your niche and let your clients have a personalized experience.<\/p>\n<h3>👉 Export &amp; Import<\/h3>\n<p>Import &amp; export all your necessary data from your dashboard, with file formats like CSV, xl, and more.<\/p>\n<h3>👉 Calendar View<\/h3>\n<p>The Admin Calendar view offers comprehensive information regarding customers&#8217; present and upcoming scheduled appointments.<\/p>\n<h3>⭐ Features coming at Timetics<\/h3>\n<p>The Timetics team is working on multiple features. Here are some of them. You can have a look.<\/p>\n<h3>👉 CalDAV integration<\/h3>\n<p>Access calendar data on your webmail server, with a one-click setup and lots of features like sharing, notifications etc.<\/p>\n",
        "installation": "<ol>\n<li>Upload the plugin files to the <code>\/wp-content\/plugins\/timetics<\/code> directory, or install the plugin through the WordPress plugins screen directly.<\/li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress<\/li>\n<li>All Settings will be found in Admin sidebar -&gt; Timetics<\/li>\n<\/ol>\n",
        "changelog": "<h4>1.0.20 ( March 10, 2024 )<\/h4>\n<p>New: The &#8216;apply to all days&#8217; option has been added to the meeting availability.<br \/>\nTweaked: Optimized Min\/Max seat selection functionality and updated tooltip text for the next button.<br \/>\nTweaked: Replaced old logo with a new one in the setup wizard<\/p>\n<h4>1.0.19 ( February 18, 2024 )<\/h4>\n<p>Tweak: Updated text from &#8220;Staff Member \/ Host&#8221; to &#8220;Team Member \/ Organizer&#8221;<br \/>\nTweak: Changed &#8220;Book Appointment&#8221; to &#8220;Book Now&#8221; on Meeting list<br \/>\nFix: Super admin is now retained in staff lists during bulk deletion<br \/>\nFix: Issue causing no data on booking list after accessing edit drawer<br \/>\nFix: Sync problem between Calendar and Booking List view<br \/>\nFix: Overflow issue with staff working time<\/p>\n<h4>1.0.18 ( February 01, 2024 )<\/h4>\n<p>Tweak: Filter by booking date on the bookings list view<br \/>\nTweak: Calendar data and filter params sync<br \/>\nTweak: No Slot available message added on Frontend<br \/>\nTweak: Stripe payment client-side validation added<br \/>\nFix: Meeting category messages not showing issue fixed<br \/>\nFix: Meeting filter related issues fixed<br \/>\nFix: Meeting &#8220;Duplicate&#8221; suffix on edit issue fixed<br \/>\nFix: On Calendar view initial load, no bookings showing issue fixed<br \/>\nFix: Booking cancellation field not showing issue fixed<br \/>\nFix: Booking time synchronization with google calendar issues fixed<br \/>\nFix: Fronted booking list view API fetching issue fixed<br \/>\nFix: Staff Re-invite button loading issue fixed<br \/>\nFix: Staff email not edited issue fixed<br \/>\nFix: Protected route issue fixed<br \/>\nFix: Custom time setting field state clear issue fixed<br \/>\nFix: Notification email not sending properly issues fixed<\/p>\n<h4>1.0.17 ( January 22, 2024 )<\/h4>\n<p>Tweak: Meeting and Profile tab design update<br \/>\nTweak: Frontend booking confirmation and payment flow update<br \/>\nTweak: Meeting and Bookings empty data state design update.<br \/>\nTweak: &#8220;Select Staff&#8221; added in the category-wise meeting list view on frontend<br \/>\nTweak: Frontend booking time slot generation time reduced<br \/>\nTweak: Added loading state on notification switch<br \/>\nFix: Meeting list pagination and responsive issue fixed<br \/>\nFix: Increase \/ Decrease of numerical values on page scroll issue fixed<br \/>\nFix: Admin and frontend booking meeting end time issue fixed<br \/>\nFix: Settings default availability and staff availability setup issue issue fixed<br \/>\nFix: Meeting data range select issue fixed<br \/>\nFix: Staff selecting issue resolved in the category-wise meeting list view on frontend<\/p>\n<h4>1.0.16 ( January 03, 2024 )<\/h4>\n<p>Tweak: Calendar and booking list view optimized.<br \/>\nTweak: Calendar day view style updated.<br \/>\nTweak: Currency symbol added on frontend and dashboard.<br \/>\nTweak: Frontend category meeting list view loader added on selecting meeting.<br \/>\nFix: Admin booking invalid meeting end time issues fixed.<\/p>\n<h4>1.0.15 ( December 24, 2023 )<\/h4>\n<p>New: Category template variation added.<br \/>\nNew: Calendar day preview added.<br \/>\nTweak: Merged calendar view and bookings list view into one page.<br \/>\nTweak: Replaced side menu bookings with the calendar and changed menu position.<br \/>\nTweak: Meeting duration field added on meeting creation.<br \/>\nTweak: Settings page UI update.<br \/>\nFix: Primary and secondary color code setup issues fixed<br \/>\nFix: Resolved onboarding time and availability issues.<br \/>\nFix: User dashboard rescheduling issue fixed.<br \/>\nFix: Calendar booking details popover placement issue fixed.<\/p>\n<h4>1.0.14 ( December 06, 2023 )<\/h4>\n<p>Tweak: Payment does not enable show notice frontend<br \/>\nTweak: Frontend sidebar price icon update<br \/>\nFix: Meeting minimum notice time issue<br \/>\nFix: Searching meeting issue fix on create\/edit category modal.<br \/>\nFix: Onboarding time availability issue<br \/>\nFix: New staff add failed redirecting issue<br \/>\nFix: Totals bookings count issue on the overview page<br \/>\nFix: Category edit issue meeting list page<br \/>\nFix: Customer bookings count issue on the customer page<br \/>\nFix: Booking search issue<\/p>\n<h4>1.0.13 ( November 02, 2023 )<\/h4>\n<p>New   : Error page added.<br \/>\nNew   : Re-Invitation mail button added on the staff list.<br \/>\nTweak : Scroll bar add-on frontend time slot list.<br \/>\nTweak : Component loading spinner  improvement.<br \/>\nTweak : UX improvement for host schedules while create or edit a meeting.<br \/>\nFix   : Setting page availability weekly hours issue fixing.<br \/>\nFix   : Meeting list page icon color issue fixing.<br \/>\nFix   : Staff removed the error issue fixing.<br \/>\nFix   : Booking from admin panel was buggy .<br \/>\nFix   : Accurate host data was not showing while editing a meeting.<br \/>\nFix   : Booking couldn&#8217;t delete if meeting deleted<br \/>\nFix   : Current passord cound&#8217;t match<br \/>\nFix   : Booking default status couldn&#8217;t work<\/p>\n<h4>1.0.12 ( October 22, 2023 )<\/h4>\n<p>Fix     : Couldn&#8217;t authenticate google meet properly, it throws error when token expire<br \/>\nFix     : Couldn&#8217;t create same google meet meeting link for one to many meetings<br \/>\nFix     : Timeslot doesn&#8217;t show correctly, for different timezone<br \/>\nFix     : Booking number showing wrong information if timezone different<br \/>\nFix     : Staff member last name is required<br \/>\nFix     : Couldn&#8217;t set default content for notification email<br \/>\nFix     : Select google meet for meeting and not connect to google meet it didn&#8217;t show error message<br \/>\nFix     : Staff default status should be active if user is admin<br \/>\nFix     : Staff image couldn&#8217;t save properly<br \/>\nFix     : Persmission validation for meeting and booking<br \/>\nFix     : Staff password showing on staff api response<br \/>\nFix     : Staff delete not working for multisite<br \/>\nFix     : Google meet disconnect option not working<br \/>\nFix     : Default content should not same for staff and customer<br \/>\nFix     : Staffs select tooltip remove on meeting update<br \/>\nFix     : Bookings search field disabled<br \/>\nFix     : Availability and block days settings<br \/>\nTweak   : Set google meet connect option on settings for admin<br \/>\nTweak   : Cancel and reschedule link on booking email<br \/>\nTweak   : Support automatic payment method to stripe<br \/>\nTweak   : Added template type for email<br \/>\nTweak   : Update login url for staff<\/p>\n<h4>1.0.11 ( September 13, 2023 )<\/h4>\n<p>Fix   : Deleting a customer also deleted from the user panel<br \/>\nFix   : Disconnecting zoom authentication could not work<br \/>\nFix   : Invitation sending before placing order on woocommerce<br \/>\nFix   : After &#8220;cancelled&#8221; the appointment is not put back into the system as an available slot<br \/>\nFix   : Currency could not save properly<br \/>\nFix   : Category functionality couldn&#8217;t work properly<br \/>\nTweak : Network call optimization from frontend<br \/>\nTweak : Design update on booking pannel<br \/>\nTweak : Payment option update on booking<br \/>\nNew   : Meeting preview button added on meeting update page<\/p>\n<h4>1.0.10 ( August 30, 2023 )<\/h4>\n<p>New     : Generate demo data for meeting, booking, staff and customer.<br \/>\nTweak   : Location-type phone call added attendee or organizer phone number option.<br \/>\nTweak   : Show phone number field on booking if enable attendee phone number.<br \/>\nFix     : Timeslot for diffrent timezone is not working properly<\/p>\n<p>= 1.0.9 ( August 09, 2023 )=<br \/>\nFix : Compatible with WordPress 6.3<\/p>\n<p>= 1.0.8 ( August 02, 2023 )=<br \/>\nNew    : User onboarding<br \/>\nNew    : Country code added in phone number field<br \/>\nTweak  : Bug fix for meeting creation in the event of no date range is provided.<br \/>\nTweak  : customer&#8217;s phone number is shown on the booking details modal<br \/>\nFix    : Payment Setting tab  API call issue fixed<br \/>\nFix    : Frontend translation issue<\/p>\n<p>= 1.0.7 ( July 08, 2023 )=<br \/>\nNew   : Customer Dashboard<br \/>\nTweak : Details report about meetings, bookings and customer<br \/>\nNew   : Auto timezone detect for customer<\/p>\n<p>= 1.0.6 ( June 13, 2023 )=<br \/>\nNew   : Show meeting for booking in single page application<br \/>\nNew   : Reschedule Appointment<br \/>\nTweak : Calendar Localization<br \/>\nTweak : Accordion, tab, icon, shortcode page design updated<br \/>\nFix   : Couldn&#8217;t send email booking notification to customer<br \/>\nFix   : Timet slot couldn&#8217;t available if booking cancel<br \/>\nFix   : One to many meeting and meeting with Seatmap from admin couldn&#8217;t book properly<\/p>\n<p>= 1.0.5 ( May 28, 2023 )=<br \/>\nNew  : WooCommerce Integration<br \/>\nTweak: Field rearrange in the meeting creation<br \/>\nFix  : Available booking slot is not working properly on current date<br \/>\nFix  : Couldn&#8217;t redirect to admin dashboard after skiping staff integration<\/p>\n<p>= 1.0.4 ( May 13, 2023 )=<br \/>\n* Tweak: Added new hook for calendar settings on frontend<br \/>\n* Tweak: ptimize icon component<br \/>\n* Fix  : Time Format issue fixed<\/p>\n<p>= 1.0.3 ( April 12, 2023 )=<br \/>\nTweak: Admin UI improvement<br \/>\nFix: Date issue fix in frontend<\/p>\n<p>= 1.0.2 ( April 3, 2023 )=<br \/>\nAdded: Added filter on booking entry<br \/>\nAdded: Added Phone number field in frontend<br \/>\nAdded: Added filter for meeting data<br \/>\nFix  : Booking Confirmation mail sending issue<br \/>\nFix  : Total earnings showing wrong value<br \/>\nFix  : Coudn&#8217;t send google meet link when booking create<br \/>\nFix  : Email template jonning link updated<br \/>\nTweak: Location type<br \/>\nTweak: Updated meeting price<br \/>\nTweak: Updated post property<br \/>\nTweak: Added filter on meeting timeslot<br \/>\nTweak: Added meeting type for filtering<br \/>\nTweak: Refactoring post model<\/p>\n<p>= 1.0.1 ( February 13, 2023 )=<br \/>\nAdded: date and time format support<br \/>\nAdded: Meeting list shortcode added<br \/>\nAdded: Added additional notes on booking<br \/>\nAdded: Booking status show in booking list.<br \/>\nTweak: Added location on booking<br \/>\nTweak: Added location type on booking<br \/>\nTweak: Added default booking status from admin settings<br \/>\nTweak: Added default currency on admin settings<br \/>\nTweak: Added start of week on localize for frontend<br \/>\nTweak: Shortcodes page design improvement<br \/>\nTweak: Create meeting location improvement.<br \/>\nTweak:  All table responsive improvement.<br \/>\nTweak: Front-end booking part responsive improvement.<br \/>\nFix  : Deprecated error on google calendar for php8<br \/>\nFix  : Input field focus issue fixed.<br \/>\nFix  : Stripe payment error handle to front-end.<\/p>\n<p>= 1.0.0 ( January 30, 2023 )=<br \/>\n&#8211; initial release<\/p>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-1.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-1.png?rev=2857150\" alt=\"screenshot-1\"><\/a><p>screenshot-1<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-2.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-2.png?rev=2857150\" alt=\"screenshot-2\"><\/a><p>screenshot-2<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-3.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-3.png?rev=2857150\" alt=\"screenshot-3\"><\/a><p>screenshot-3<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-4.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-4.png?rev=2857150\" alt=\"screenshot-4\"><\/a><p>screenshot-4<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-5.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-5.png?rev=2857150\" alt=\"screenshot-5\"><\/a><p>screenshot-5<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-6.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-6.png?rev=2857150\" alt=\"screenshot-6\"><\/a><p>screenshot-6<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-7.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-7.png?rev=2857150\" alt=\"screenshot-7\"><\/a><p>screenshot-7<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-8.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-8.png?rev=2857150\" alt=\"screenshot-8\"><\/a><p>screenshot-8<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-9.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-9.png?rev=2857150\" alt=\"screenshot-9\"><\/a><p>screenshot-9<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-10.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-10.png?rev=2857150\" alt=\"screenshot-10\"><\/a><p>screenshot-10<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-11.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-11.png?rev=2857150\" alt=\"screenshot-11\"><\/a><p>screenshot-11<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-12.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-12.png?rev=2857150\" alt=\"screenshot-12\"><\/a><p>screenshot-12<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-13.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-13.png?rev=2857150\" alt=\"screenshot-13\"><\/a><p>screenshot-13<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-14.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-14.png?rev=2857150\" alt=\"screenshot-14\"><\/a><p>screenshot-14<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-15.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-15.png?rev=2857150\" alt=\"screenshot-15\"><\/a><p>screenshot-15<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-16.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-16.png?rev=2857150\" alt=\"screenshot-16\"><\/a><p>screenshot-16<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-17.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-17.png?rev=2857150\" alt=\"screenshot-17\"><\/a><p>screenshot-17<\/p><\/li><li><a href=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-18.png?rev=2857150\"><img src=\"https:\/\/ps.w.org\/timetics\/assets\/screenshot-18.png?rev=2857150\" alt=\"screenshot-18\"><\/a><p>screenshot-18<\/p><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Buggy<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/jacobwonder\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/847e3a7164d20d2ea55217ebedbf80fd?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/847e3a7164d20d2ea55217ebedbf80fd?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/jacobwonder\/\" class=\"reviewer-name\">Jacob Wonder <small>(jacobwonder)<\/small><\/a> on <span class=\"review-date\">March 27, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This plugin is buggy and definitely early stage. <br \/><br \/>This company is known for abandoning plugins, I hope someday to give it a better review.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Poor, Slow, Unhelpful Support, Buggy Plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"1 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"1\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><span class=\"star dashicons dashicons-star-empty\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/haserb\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/bb09be9517e99eaaaa96d8e71c9ab969?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/bb09be9517e99eaaaa96d8e71c9ab969?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/haserb\/\" class=\"reviewer-name\">haserb<\/a> on <span class=\"review-date\">January 26, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">The Timetics plugin has potential, but presently (in 2023-24) it has glitches. For starters it is NOT user-friendly. Set up is complex and there is no easy way to register the pro version.  Contacting support also requires users to jump through hoops. Support doesn't seem to be based on a Ticket system so there's no auto response message. Response-time took more than a week. For a business that relies on having a functional booking system, there is no room for such delays. Also the developer offers no support forum.  These are vital flaws that the developer should address if they want to be a valid, competent, contender in the booking plugin market.  I would not recommend this product until the developers address these and other major issues.  Not sure who rated them with 5 stars, but in my opinion, 1 to 2 stars is more than accurately fair.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">UPDATE: I contacted Arraytics, the company name behind Timetics. I used their only form of ticket request, a basic support form on their website. They claim there is an email but it does not work. They promised a refund but have yet to deliver. Their support staff asked for very private data to be shared through the unsecured form. The support is not prompt, honest or professional. I would steer clear of this company until they vastly improve. The risks and costs to customers are too high.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Best Appointment Booking plugins<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/abdurrahmancm\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/599f09c3f6e952c1f2c000fa02066911?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/599f09c3f6e952c1f2c000fa02066911?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/abdurrahmancm\/\" class=\"reviewer-name\">abdurrahmancm<\/a> on <span class=\"review-date\">June 4, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>arraytics is the best plugin for booking and appointments, I will recommend it for Small and Medium Businesses.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Good start<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/springbreak\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/64fe76057426511a39cdcd1737f58f52?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/64fe76057426511a39cdcd1737f58f52?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/springbreak\/\" class=\"reviewer-name\">springbreak<\/a> on <span class=\"review-date\">May 24, 2023<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p>It works fine, has a intuitive interface and good logic behind. I'm not a programmer, so I can't comment about the quality of coding, but so far so good - no conflicts or errors. Many features are under development as I can see in your roadmap, but please reevaluate priorities since some important points are \"in discussion\" (like recurring appointments, buffer time, user dashboard and profile...) In my opinion these are more important than niche solutions, for example)<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Overall this is a very promising solution! Waiting also for SaaS version!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "Timetics – Visual Seating Plan solution with Ai-powered appointment booking and effective calendar scheduling built for any business niche.",
    "description": "<p><em><a href=\"https:\/\/arraytics.com\/timetics\" rel=\"nofollow ugc\">Timetics<\/a><\/em> is an advanced booking plugin for WordPress. You can create and manage online schedules and unlimited appointments with Timetics. Integration of stripe payment gateways makes it easy to get paid smoothly.<\/p>\n<p>You can use the shortcode to add your schedule to any page. Your customers can book appointments, and Timetics also allows you to add bookings manually.<\/p>\n<p><em>Need help setting up your appointment Website? 👉 <a href=\"https:\/\/arraytics.com\/support\" rel=\"nofollow ugc\">Contact Us Here<\/a>.<\/em><\/p>\n<p><em>A few more helpful links here 👇<\/em><\/p>\n<p><em><a href=\"https:\/\/products.arraytics.com\/timetics\/booking\" rel=\"nofollow ugc\">Live Demo<\/a> | <a href=\"https:\/\/arraytics.com\/timetics\/\" rel=\"nofollow ugc\">Buy Pro<\/a> | <a href=\"https:\/\/docs.arraytics.com\" rel=\"nofollow ugc\">Documentation<\/a> | <a href=\"https:\/\/arraytics.com\/timetics-roadmaps\" rel=\"nofollow ugc\">Roadmaps<\/a><\/em><\/p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/qBqTz2wF3kk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<p>👍 Use this unique plugin and sell your schedule online. It will be helpful for coaches, consultants, mentors, teachers, and so on. If you want to manage your schedule online, Timetics is the plugin, you need now!<\/p>\n<h3>⭐ Timetics Features &#8211; Create Meetings &amp; Appointments, Track Meetings on Calendar, Charge Appointment Invitees, Do Virtual Meetings, and More<\/h3>\n<p>From creating meetings to receiving payments from customers\/clients &#8211; everything is possible through Timetics. Take a quick look at all the features of Timetics and take the first step to reach new heights with your business.<\/p>\n<h3>👉 Unlimited Meetings<\/h3>\n<p>Sky is the boundary while taking new participants in any meeting. It allows for an unlimited number of meetings to be scheduled, with no limit on the number of participants or the duration of the meetings.<\/p>\n<h3>👉 Unlimited Bookings<\/h3>\n<p>For any meeting, you can take unlimited booking. This is the way, you can take numbers of customers depending on your business. And the best part is, you don&#8217;t need to spend extra for taking unlimited booking.<\/p>\n<h3>👉 Unlimited Staff Members<\/h3>\n<p>You can add as many staff\/team members you need for your business and you won&#8217;t need to pay any extra dime for that. Inviting your staff\/team members is also very easy.<\/p>\n<h3>👉 One-to-One Meetings<\/h3>\n<p>In Timetics, you can easily arrange One-to-One meetings through Google Meet or in any location Time-Zone you prefer. You can set meeting duration, appointment price, meeting time, and you or your staff\/team member&#8217;s availability as well. Check <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/meetings\/one-on-one-meeting\/\" rel=\"nofollow ugc\">our documentation<\/a> to know the full procedure.<\/p>\n<h3>👉 Team Memebrs Management<\/h3>\n<p>There is no need to be concerned if your company employs a large number of people. You can add an unlimited number of team members based on your requirements. Everyone will have a <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/staff-list\/add-new-staff-host\/\" rel=\"nofollow ugc\">dedicated profile<\/a> for each member.<\/p>\n<h3>👉 Sales Analytics<\/h3>\n<p>Analytics is one of the important part for any business. From the Timetics analytics, you can see the performance of your business at a glance.<\/p>\n<h3>👉 Email Notification Staff<\/h3>\n<p>While you will add a new members at your meeting, your staff member will get an update email. They need to click on the given link to confirm their memebership.<\/p>\n<h3>👉 Email Notification Customer<\/h3>\n<p>Automatic updates help the admin save time and make it easy to manage meetings and bookings. The feature allows you to send an update to the meeting attendee automatically from the Timetics system. See <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/notifications\/email-notification\/\" rel=\"nofollow ugc\">how it works<\/a><\/p>\n<h3>👉 Google Meet Integration<\/h3>\n<p>Manage your online meeting with the most popular and free meeting platform Google Meet. The easy integration allow you to create and manage your bookings with Google Meet. Check <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/google-meet-calendar-integration\/\" rel=\"nofollow ugc\">our documentation here<\/a><\/p>\n<h3>👉 Google Calendar Integration<\/h3>\n<p>Simplify schedule management with the most popular <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/google-meet-calendar-integration\/\" rel=\"nofollow ugc\">Google calendar<\/a>. It allows you to easily keep your calendar in sync across all devices by linking your Google calendar account, ensuring that all your scheduled meetings and events are up-to-date.<\/p>\n<h3>👉 Stripe Payments Integration<\/h3>\n<p>Stripe is a popular online payment processing and commerce solution for internet businesses of all sizes. You can take appointment payments using <a href=\"https:\/\/stripe.com\" rel=\"nofollow ugc\">Stripe<\/a> on your website. Enable it by following <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/payment-type\/stripe\/\" rel=\"nofollow ugc\">Stripe Documentation<\/a> to make your payment system most customer-friendly.<\/p>\n<h3>👉 WooCommerce Integration<\/h3>\n<p>Now you can receive payments through <a href=\"https:\/\/wordpress.org\/plugins\/woocommerce\/\" rel=\"ugc\">WooCommerce<\/a> along side Stripe and Local Payment options. Just follow the instructions given in <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/payment-type\/woocommerce\" rel=\"nofollow ugc\">our documentation<\/a> and you will be all set.<\/p>\n<h3>👉 Availability Management<\/h3>\n<p>It allows you to manage your <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/general-settings\/general-settings-for-timetics\/\" rel=\"nofollow ugc\">schedule by setting<\/a> from your profile settings, checking your schedule, and booking meetings at convenient times. It also enables you to share your availability with others and schedule meetings quickly and easily.<\/p>\n<h3>👉 Date and time format support<\/h3>\n<p>Timetics support different date formate. You can add different time in your booking. Also both twelve hours and twenty four hours formate supported now.<\/p>\n<h3>👉 Added additional notes on booking<\/h3>\n<p>Taking notes is always important. Specially if it&#8217;s appointment and booking related meeting, then taking additional notes can help a lot. Timetics let&#8217;s your <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/bookings\/frontend-booking\/\" rel=\"nofollow ugc\">cutomers frontend booking<\/a> as per their neccessity.<\/p>\n<h3>👉 Booking status show in booking list<\/h3>\n<p>You can show the booking status in booking list. The feature is helpful for managing booking easily.<\/p>\n<h3>👉 User Dasboard<\/h3>\n<p>With the user dashboard, your customers can edit their profiles, check their booking history, Cancel, and reschedule any of their appointments at anytime. This will make your appointment booking website much more user friendly and your customers&#8217; user satisfaction will increase.<\/p>\n<h3>👉 Timezone Auto Detection<\/h3>\n<p>Suppose you and your client lives in different timezones. You set the meeting time according to your timezone. But for your client, calculating the local time their can be quite a problem. To reduce this problem, Timetics now has auto timezone detection feature. Timetics will automatically detect your client&#8217;s timezone and convert your given time to the client&#8217;s local time. This will remove all confusions about the meeting time.<\/p>\n<h3>👉 Shortcodes<\/h3>\n<p>If you want to add meeting lists and booking form on your website with the least amount of hassle, Timetics Shortcodes are here to save your day and time. More shortcodes features are coming too.<\/p>\n<h3>👉 User Onboarding<\/h3>\n<p>We know its becomes very tough sometimes while getting started with a new plugin. To reduce that hassle of yours, we have added a setup wizard that can help you to set up the basic requirements and show you the feature that you need. This will save a lot of time for you.<\/p>\n<h3>👉 Set Country Code for Phone Number<\/h3>\n<p>You can set your own country code in the phone number field.<\/p>\n<h3>👉 Add guest option on booking<\/h3>\n<p>Enhance your booking experience by easily specifying the number of guests, ensuring a seamless reservation process for groups of all sizes.<\/p>\n<h3>⭐ Timetics Pro Special Features<\/h3>\n<p>Enjoy the exclusive features of Timetics Pro and take your business to the next level. With Timetics Pro, you will have all the flexibilities you need. Take a look at all the exclusive features Timetics Pro Offers.<\/p>\n<h3>👉 One-to-Many Meeting Type (Pro)<\/h3>\n<p>At <a href=\"https:\/\/arraytics.com\/timetics\" rel=\"nofollow ugc\">Timetics<\/a>, meeting type one to many feature is available. It allows the admin to host special meeting where host will be one but participants can be one or more. This is one of the ideal meeting type, ussually called <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/meetings\/one-on-many-meeting\/\" rel=\"nofollow ugc\">one to many meeting<\/a>, for class room, online group hangout, technical consultancy.<\/p>\n<h3>👉 One-to-Many Meetings with Seat Plan (Pro)<\/h3>\n<p>You can sell visual placement based ticket with <a href=\"https:\/\/arraytics.com\/timetics\/\" rel=\"nofollow ugc\">Timetics<\/a>. The feature is now ready to help you selling <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/one-to-many-with-seat-mappro\/seatplan-from-frontend\/\" rel=\"nofollow ugc\">conferce ticket<\/a>, salun booking, theater hall booking and much more. Once admin allows, the users can choose the best seat and location for their needs. You can also use this visual seating plan feature to create a visual seat map for your restaurant as well.<br \/>\nOther important features added at Timetics recently:<br \/>\n<strong>👉 Filter on booking entry<\/strong><br \/>\n<strong>👉 Filter for meeting data<\/strong><\/p>\n<h3>👉 Customizable Booking Form<\/h3>\n<p>Getting to know about the case of the client\/customer before the meeting can save a lot of time at the meeting. Now, you can add custom fields to the booking form. With it, you can seve a lot of time at the meeting and make the time as effective as possible.<\/p>\n<h3>👉 Zoom Integration<\/h3>\n<p>We know that a lot of you are more comfortable using Zoom over Google Meet. <a href=\"https:\/\/zoom.us\/\" rel=\"nofollow ugc\">Zoom<\/a> has many useful features that Google Meet doesn&#8217;t have. That is why we have integrated Zoom so that you can go on with your <em>virtual meetings<\/em> and utilize all the exclusive features of Zoom by <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/zoom-integration\/\" rel=\"nofollow ugc\">integrating it<\/a>.<\/p>\n<h3>👉 FluentCRM Integration<\/h3>\n<p>No matter what business you do, Email marketing is very essential to keep the business going. That is why, we have integrated <a href=\"https:\/\/wordpress.org\/plugins\/fluent-crm\/\" rel=\"ugc\">FluentCRM<\/a> with Timetics. Now, you can run your business operations all from a single platform. Read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/fluentcrm-integrationpro\/\" rel=\"nofollow ugc\">our documentation<\/a> to know more details.<\/p>\n<h3>👉 iCal Integration<\/h3>\n<p>After integrating Google Calendar, we integrated iCal into Timetics. Now, apart from Google Calendar, you can also keep track of your future meetings on iCal as well. You can check out <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/apple-outlook-canlendar-integration\/\" rel=\"nofollow ugc\">the documentation<\/a> to know how to enable it.<\/p>\n<h3>👉 Outlook Calendar Integration<\/h3>\n<p>You will now be able to keep track of your meetings with Microsoft Outlook Calendar as well. Check out <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/apple-outlook-canlendar-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> on how you can enable Outlook Calendar with Timetics to know the full procedure.<\/p>\n<h3>👉 Pabbly Integration<\/h3>\n<p>With Pabbly you can integrate services and automate multiple software to your website in a way that data can be transferred among them smoothly. This will make your workflow smooth as butter. Give <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/pabbly-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> a read to know how you can enable Pabbly on your site.<\/p>\n<h3>👉 Zapier Integration<\/h3>\n<p>Zapier is an online platform that can help you to automate your workflow by connecting the apps and services you use. You can get your automated booking forms submitted through Zapier and everything will be easy for you to operate. Read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/zapier-integration\/\" rel=\"nofollow ugc\">our documentation<\/a> on how to get Zapier step-by-step guide.<\/p>\n<h3>👉 Artificial Intelligence<\/h3>\n<p>Its the era of Artificial Intelligence (AI) and as a booking management plugin of this era, Timetics won’t fall behind. We have completed the first phase of AI integration with Timetics. Now, your customers will receive meeting recommendations based on their previous booking history.<br \/>\nThis will intrigue your customers to book more meetings and as a result your business will grow in a fast pace. To get a step-by-step guide, read <a href=\"https:\/\/docs.arraytics.com\/docs\/timetics\/integrations\/openai-integration\/\" rel=\"nofollow ugc\">our documentation<\/a>.<\/p>\n<h3>👉 Availability Preference<\/h3>\n<p>There are times when we don&#8217;t feel like working or we need to keep the office close on public holidays. With the availability preference feature, you will be able to overwrite your availability schedule whenever you like.<\/p>\n<h3>👉 Reschedule Appointments<\/h3>\n<p>There are times when you need to reschedule an appointment due to unavoidable reasons. With this feature, you can change the schedule of any appointments with ease.<\/p>\n<h3>👉 Recurring Appointments<\/h3>\n<p>You no longer need to create and book the same appointment over and over again. With the recurring appointment feature, you can automate any number of meetings that needs to be done repetitively.<\/p>\n<h3>👉 WhatsApp Integration<\/h3>\n<p>With the Twilio Integration at your disposal, you can now send and receive SMS notification through WhatsApp and make a new way to connect with your clients.<\/p>\n<h3>👉 Select Multiple Host for a Meeting<\/h3>\n<p>This feature is pretty much self explanatory. You can select multiple host for a meeting from the admin dashboard without any hassle whatsoever.<\/p>\n<h3>👉 Niche based solutions<\/h3>\n<p>Make niche-oriented customizable appointments that relate to your niche and let your clients have a personalized experience.<\/p>\n<h3>👉 Export &amp; Import<\/h3>\n<p>Import &amp; export all your necessary data from your dashboard, with file formats like CSV, xl, and more.<\/p>\n<h3>👉 Calendar View<\/h3>\n<p>The Admin Calendar view offers comprehensive information regarding customers&#8217; present and upcoming scheduled appointments.<\/p>\n<h3>⭐ Features coming at Timetics<\/h3>\n<p>The Timetics team is working on multiple features. Here are some of them. You can have a look.<\/p>\n<h3>👉 CalDAV integration<\/h3>\n<p>Access calendar data on your webmail server, with a one-click setup and lots of features like sharing, notifications etc.<\/p>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.20.zip",
    "upgrade_notice": [],
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-1.png?rev=2857150",
            "caption": "screenshot-1"
        },
        "2": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-2.png?rev=2857150",
            "caption": "screenshot-2"
        },
        "3": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-3.png?rev=2857150",
            "caption": "screenshot-3"
        },
        "4": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-4.png?rev=2857150",
            "caption": "screenshot-4"
        },
        "5": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-5.png?rev=2857150",
            "caption": "screenshot-5"
        },
        "6": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-6.png?rev=2857150",
            "caption": "screenshot-6"
        },
        "7": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-7.png?rev=2857150",
            "caption": "screenshot-7"
        },
        "8": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-8.png?rev=2857150",
            "caption": "screenshot-8"
        },
        "9": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-9.png?rev=2857150",
            "caption": "screenshot-9"
        },
        "10": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-10.png?rev=2857150",
            "caption": "screenshot-10"
        },
        "11": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-11.png?rev=2857150",
            "caption": "screenshot-11"
        },
        "12": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-12.png?rev=2857150",
            "caption": "screenshot-12"
        },
        "13": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-13.png?rev=2857150",
            "caption": "screenshot-13"
        },
        "14": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-14.png?rev=2857150",
            "caption": "screenshot-14"
        },
        "15": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-15.png?rev=2857150",
            "caption": "screenshot-15"
        },
        "16": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-16.png?rev=2857150",
            "caption": "screenshot-16"
        },
        "17": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-17.png?rev=2857150",
            "caption": "screenshot-17"
        },
        "18": {
            "src": "https:\/\/ps.w.org\/timetics\/assets\/screenshot-18.png?rev=2857150",
            "caption": "screenshot-18"
        }
    },
    "tags": {
        "appointment": "appointment",
        "appointment-booking": "appointment booking",
        "booking": "booking",
        "booking-calendar": "booking calendar",
        "schedule": "schedule"
    },
    "stable_tag": "1.0.20",
    "versions": {
        "1.0.0": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.0.zip",
        "1.0.1": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.1.zip",
        "1.0.10": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.10.zip",
        "1.0.11": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.11.zip",
        "1.0.12": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.12.zip",
        "1.0.13": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.13.zip",
        "1.0.14": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.14.zip",
        "1.0.15": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.15.zip",
        "1.0.16": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.16.zip",
        "1.0.17": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.17.zip",
        "1.0.18": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.18.zip",
        "1.0.19": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.19.zip",
        "1.0.2": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.2.zip",
        "1.0.20": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.20.zip",
        "1.0.3": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.3.zip",
        "1.0.4": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.4.zip",
        "1.0.5": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.5.zip",
        "1.0.6": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.6.zip",
        "1.0.7": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.7.zip",
        "1.0.8": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.8.zip",
        "1.0.9": "https:\/\/downloads.wordpress.org\/plugin\/timetics.1.0.9.zip",
        "trunk": "https:\/\/downloads.wordpress.org\/plugin\/timetics.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https:\/\/ps.w.org\/timetics\/assets\/banner-772x250.png?rev=3014508",
        "high": "https:\/\/ps.w.org\/timetics\/assets\/banner-1544x500.png?rev=3014508"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/timetics\/assets\/icon-128x128.png?rev=3014508",
        "2x": "https:\/\/ps.w.org\/timetics\/assets\/icon-256x256.png?rev=3014508"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}