{
    "name": "Unlimited Elements For Elementor (Free Widgets, Addons, Templates)",
    "slug": "unlimited-elements-for-elementor",
    "version": "1.5.102",
    "author": "<a href=\"http:\/\/unlimited-elements.com\">Unlimited Elements<\/a>",
    "author_profile": "https:\/\/profiles.wordpress.org\/unitecms\/",
    "contributors": {
        "unitecms": {
            "profile": "https:\/\/profiles.wordpress.org\/unitecms\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/425c41541ef064fe2abf68eca1e5f2e7?s=96&d=monsterid&r=g",
            "display_name": "Unlimited Elements"
        },
        "valiano": {
            "profile": "https:\/\/profiles.wordpress.org\/valiano\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/944a72c78ce1379c4dca1d71457abb4f?s=96&d=monsterid&r=g",
            "display_name": "valiano"
        },
        "iritmega": {
            "profile": "https:\/\/profiles.wordpress.org\/iritmega\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/3a62433e753b8ed1368ed269a30e6cb0?s=96&d=monsterid&r=g",
            "display_name": "iritmega"
        },
        "amitkeren": {
            "profile": "https:\/\/profiles.wordpress.org\/amitkeren\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/25a743443a5ac3ae42b74e96c9a933ea?s=96&d=monsterid&r=g",
            "display_name": "amitkeren"
        },
        "axmusic": {
            "profile": "https:\/\/profiles.wordpress.org\/axmusic\/",
            "avatar": "https:\/\/secure.gravatar.com\/avatar\/45d9ef3df447c15da36c9afca2ae983d?s=96&d=monsterid&r=g",
            "display_name": "Adarsh Pawar"
        }
    },
    "requires": "3.5",
    "tested": "6.5.2",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 372,
        "4": 4,
        "3": 1,
        "2": 3,
        "1": 10
    },
    "num_ratings": 390,
    "support_url": "https:\/\/wordpress.org\/support\/plugin\/unlimited-elements-for-elementor\/",
    "support_threads": 16,
    "support_threads_resolved": 11,
    "active_installs": 200000,
    "downloaded": 7994270,
    "last_updated": "2024-04-04 2:53pm GMT",
    "added": "2018-02-01",
    "homepage": "http:\/\/unlimited-elements.com",
    "sections": {
        "description": "<p><strong>Elementor<\/strong> users, elevate your web design experience with <strong>Unlimited Elements for Elementor<\/strong>. An all in one plugin that instantly gives you the most advanced widgets and tools to make better Elementor websites faster.  Take your WordPress website to the next level.<\/p>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\">View Elementor Widgets Demos<\/a><br \/>\n<br \/>\nBrowse our extensive collection of free widgets or upgrade to our pro version for access to over 200 additional unique drag and drop widgets for <strong>Elementor<\/strong>. Each widget provides a wide range of options to easily control every aspect. If you can&#8217;t find what you need, our <strong>Widget Creator<\/strong> Framework empowers you to create any widget you can imagine.<\/p>\n<h3>Plugin Features<\/h3>\n<ul>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\"><strong>Widget Library<\/strong><\/a> – Enhance the popular Elementor page builder with our user-friendly and innovative widget library. Simplify your website by finding everything you need in one place, without the need for multiple plugins.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/widget-creator\/\" rel=\"nofollow ugc\"><strong>Widget Creator<\/strong><\/a> – Save valuable time by eliminating the need to search for numerous plugins and add-ons. Instead, create customized, professional widgets that perfectly align with your website requirements.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\"><strong>Elementor Templates<\/strong><\/a> – Effortlessly kickstart your web project with pre-designed templates. Say goodbye to endless searches for inspiration or starting from scratch. Get your project up and running in seconds with our collection of template kits.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-templates\/\" rel=\"nofollow ugc\"><strong>Elementor Templates<\/strong><\/a> – Effortlessly kickstart your web project with pre-designed templates. Say goodbye to endless searches for inspiration or starting from scratch. Get your project up and running in seconds with our collection of template kits.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/loop-builder-for-elementor\/\" rel=\"nofollow ugc\"><strong>Loop Builder<\/strong><\/a> – Easily create dynamic Loop Items within the Elementor Theme Builder by utilizing any loop widget layout of your preference. Effortlessly populate the chosen widget with dynamic content to craft versatile and engaging Loop Items.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/background-widgets-for-elementor\/\" rel=\"nofollow ugc\"><strong>Background Widgets<\/strong><\/a> – Elevate your web designs instantly with our user-friendly animated backgrounds available in our extensive widget library. Experience seamless integration and unleash your creativity like never before.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-widgets-filters-tools\/\" rel=\"nofollow ugc\"><strong>Post Widgets &amp; Filters<\/strong><\/a> – Easily create stunning post layouts with real-time filters. Improve the browsing experience for website visitors by helping them find the content they&#8217;re looking for. Effortlessly display posts using advanced criteria on your entire website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/woo\/\" rel=\"nofollow ugc\"><strong>WooCommerce Widgets &amp; Filters<\/strong><\/a> – Create stunning product layouts with dynamic real-time filters. Showcase your products and categories in a wide array of interactive formats, such as grids, carousels, sliders, and more.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/remote-control-widgets\/\" rel=\"nofollow ugc\"><strong>Woo Widgets &amp; Filters<\/strong><\/a> – Unleash your creativity with advanced and customizable layouts. Take full control of your designs and make them truly unique using the remote controls. Stand out from the crowd with layouts that are both eye-catching and distinctive.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/sync-widgets\/\" rel=\"nofollow ugc\"><strong>Sync Between Widgets<\/strong><\/a> – Elevate your web designs to new heights by seamlessly synchronizing multiple item-based widgets. This powerful feature empowers you to effortlessly create intricate and personalized layouts, taking your designs to the next level of sophistication.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/multi-source-galleries\/\" rel=\"nofollow ugc\"><strong>Multi-Source Galleries<\/strong><\/a> – Empower your gallery showcase by effortlessly featuring Woo products, WordPress posts, Instagram feeds, and a variety of other sources, including various API integrations.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/live-copy-paste\/\" rel=\"nofollow ugc\"><strong>Live Copy Paste<\/strong><\/a> – Copy and paste fully designed sections from the Unlimited Elements website directly to your website, saving you time and ensuring you can finish your web project as soon as possible.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/mega-menu-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Mega Menu Builder<\/strong><\/a> – Easily craft a distinctive Mega Menu for your website navigation by incorporating images, icons, links, and various Elementor widgets into unique menu layouts.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/mega-slider-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Mega Slider Builder<\/strong><\/a> – Easily turn any Elementor sections into slider slides. Now you can amaze your website visitors with jaw-dropping slider designs that look amazing on any device.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/multi-source\/\" rel=\"nofollow ugc\"><strong>Multi-Source Widgets<\/strong><\/a> – Add content dynamically to item-based widgets effortlessly with support for ACF repeaters, JSON\/CSV files, Woo Products, WordPress posts, users, menus, and a range of API integrations.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/dynamic-post-popup-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Dynamic Popup Builder<\/strong><\/a> – Dynamically create a popup to add a quick view of the post without leaving the page. Use an Elementor single post template to create the layout of the dynamic popup.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/form-builder\/\" rel=\"nofollow ugc\"><strong>Elementor Form Builder<\/strong><\/a> – Build advanced forms effortlessly using the drag-and-drop form builder. Whether it’s a simple or complex form, our straightforward form widgets make it quick and easy to create forms, improving your workflow.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/calculators\/\" rel=\"nofollow ugc\"><strong>Calculator Builder<\/strong><\/a> – Easily design professional calculators for any type of industry. Whether you need a loan calculator, mortgage calculator or business calculator, our powerful and intuitive drag and drop builder makes it easy to create complex calculators with ease.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/filters\/\" rel=\"nofollow ugc\"><strong>Elementor Filter Widgets<\/strong><\/a> – Unlock the potential of the AJAX-based faceted filter system, seamlessly empowering you to craft diverse layouts with ease. Take control by applying multiple filters, ensuring a super-fast and dynamic filtering experience tailored to your website needs.<\/p>\n<\/li>\n<\/ul>\n<h3>Widget Library<\/h3>\n<p>Find everything you need in one convenient package and supercharge your <strong>Elementor<\/strong> website.<\/p>\n<h3>Creative Widgets for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/flip-box-widget-for-elementor\/\" rel=\"nofollow ugc\">Flip Box Widget for Elementor (Free)<\/a>  Attract attention from website visitors with the Flip Box widget for Elementor pages. It adds a playful hover effect to your website content, keeping users engaged and increasing interaction.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/svg-animation-widget-for-elementor\" rel=\"nofollow ugc\">SVG Animation Widget for Elementor (Free)<\/a>  The SVG animation widget for Elementor simplifies the process of creating stunning SVG animations for your website. You don&#8217;t need any coding skills &#8211; simply copy and paste your SVG code, and your animated icon is good to go.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/animated-hamburger-icon-for-elementor\/\" rel=\"nofollow ugc\">Animated Hamburger Icon Widget for Elementor (Free)<\/a>  Enhance your Elementor Pro popups effortlessly by using the animated hamburger icon widget. Take it a step further by incorporating a menu within a popup, creating a captivating full-screen menu experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/lordicon-animated-icons-widget-for-elementor\/\" rel=\"nofollow ugc\">Lordicon: Animated Icons Widget for Elementor (Free)<\/a>  Discover the power of Lordicons, an extensive animated icon library featuring over 1500 free and premium Lottie animations. Effortlessly download icons as Lottie JSON files or simply copy the CDN link. Unleash the potential of your designs with Lordicons!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/timeline-bullets-widget-for-elementor\/\" rel=\"nofollow ugc\">Timeline Bullets Widget for Elementor (Free)<\/a>  Showcase your features or services using bullet points for easy readability of important information. Customize the settings of the Timeline Bullets widget to achieve your desired appearance and functionality.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/blob-shape-widget-for-elementor\/\" rel=\"nofollow ugc\">Blob Shapes Widget for Elementor (Free)<\/a>  Transform images into captivating and dynamic blob shapes with mesmerizing morphing effects using this incredible Elementor widget. Unleash your creativity with random, distinctive, and natural-looking blobs that will add a touch of uniqueness to your designs.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/number-box-widget-widget-for-elementor\/\" rel=\"nofollow ugc\">Number Box Widget for Elementor (Free)<\/a>  Enhance your designs with eye-catching number blocks in various styles. The Number Box widget for Elementor allows you to display content for easy-to-follow diagrams and clear instructions.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/docs\/icon-bullets\/\" rel=\"nofollow ugc\">Icon Bullets Widget for Elementor (Free)<\/a>  Elevate your feature lists with the Icon Bullets widget. Showcase distinct icons and styles for each item, personalize icon titles and accompanying text. Effortlessly emphasize key features on your Elementor website using the Bullets widget.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-zoom-magnifier-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Zoom Magnifier Widget for Elementor (Pro)<\/a>  The Image Zoom Magnifier is an Elementor widget that creates a direction-aware magnifying glass effect. It offers inner zoom functionality for any image, allowing you to easily enlarge images with a touch, click, or mouseover. Enhance your image viewing experience with this incredible tool!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-box-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Icon Box Accordion Widget for Elementor (Pro)<\/a>  The Icon Box Accordion widget creates a visually appealing layout of icon boxes with an interactive accordion effect. When hovered upon, the icon boxes expand and display additional information.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/morph-slider-widget-for-elementor\/\" rel=\"nofollow ugc\">Morph Slider Widget for Elementor (Pro)<\/a>  The Morph Slider allows you to easily create stunning image slideshows for your Elementor website. It utilizes a WebGL-based Image slider effect with advanced transitions such as noise, displacement, blend, and color mix to design one-of-a-kind visuals.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-reveal-on-scroll-widget-for-elementor\" rel=\"nofollow ugc\">Scroll Image Reveal Widget for Elementor (Pro)<\/a>  Enhance your Elementor website design with the Scroll Image Reveal widget. This impressive feature creates an engaging reveal effect on your images as users scroll to them.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Accordion Widget for Elementor (Pro)<\/a>  The Image Accordion widget enables you to present a collection of images in a compact and interactive manner. Additionally, it offers the flexibility to reveal more details or showcase a larger view of each image.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-shapes-for-elementor-page-builder\/\" rel=\"nofollow ugc\">Image Shapes Widget for Elementor (Pro)<\/a>  Enhance your image design effortlessly with the Image Shapes Elementor widget. Easily create captivating images using pre-defined clipping masks, unlocking endless possibilities for your element layouts. Explore a variety of shapes to add a touch of creativity to your designs.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-particle-widget-for-elementor\/\" rel=\"nofollow ugc\">Particle Image Widget for Elementor (Pro)<\/a>  Enhance your images with a captivating dispersion interactive distortion effect using the Particle Image widget for Elementor. Transform any image into a mesmerizing visual experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-tabs-widget-for-elementor\" rel=\"nofollow ugc\">Icon Tabs Widget for Elementor (Pro)<\/a>  The Icon Tab widget for Elementor allows you to effortlessly display your text on your page, neatly organized into horizontal or vertical tabs. With the option to customize your tabs using icons, you can create an interactive and enjoyable reading experience for your website visitors.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/background-switcher-widget-for-elementor\/\" rel=\"nofollow ugc\">Background Switcher Widget for Elementor (Pro)<\/a>  The Background Switcher widget lets you create stylish content boxes. When you hover over a content box, it dynamically changes the background for the entire section. Impress your audience with smooth and seamless background transitions as they interact with your website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Icon Accordion Widget for Elementor (Pro)<\/a>  The Icon Accordion widget for Elementor page builder offers a wide selection of styles to create interactive collapsible content with different layouts on your page. Each accordion item can be accompanied by an icon for enhanced visual representation.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/before-after-widget-for-elementor\/\" rel=\"nofollow ugc\">Before After Widget for Elementor (Pro)<\/a>  Effortlessly compare changes using the Before After widget. Experience the transformation at a glance, whether it&#8217;s photos, designs, or anything else. Elevate your visual storytelling with ease!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/shape-bullets-widget-for-elementor\/\" rel=\"nofollow ugc\">Shape Bullets Widget for Elementor (Pro)<\/a>  The Shape Bullets Widget for Elementor simplifies the creation of a well-structured bulleted list. Each item can have its own unique icon, enclosed in visually appealing shapes. This enhances visual appeal and improves organization and readability.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/flip-box-carousel-widget-for-elementor\/\" rel=\"nofollow ugc\">Flip Box Carousel Widget for Elementor (Pro)<\/a>  Enhance your Elementor page with the captivating Flip Box Carousel effect. Add a dynamic touch to showcase your content engagingly and interactively. Each item in the carousel acts as a flip box, revealing compelling additional content.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/scroll-sequance-widget-for-elementor\/\" rel=\"nofollow ugc\">Scroll Sequence Widget for Elementor (Pro)<\/a>  Elevate your website with the Scroll Sequence Widget. Convert collections of images into captivating web experiences. Engage your audience with seamless animations of image sequences, all triggered by scrolling.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/rhombus-grid-widget-for-elementor\/\" rel=\"nofollow ugc\">Rhombus Grid Widget for Elementor (Pro)<\/a>  Use the Rhombus Grid widget for Elementor to create a unique and creative layout style for your content. Let your creativity shine and engage your audience with a visually striking design that will make a lasting impact.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/christmas-icons-widget-for-elementor\/\" rel=\"nofollow ugc\">Christmas Icons Widget for Elementor (Pro)<\/a>  The Christmas Icons widget provides 25 specially designed icons for the festive season. Each icon comes with 3 unique styles, adding a delightful touch to your holiday designs.<\/p>\n<\/li>\n<\/ol>\n<h3>Tools for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/animated-mouse-scroll-icon-widget-for-elementor\/\" rel=\"nofollow ugc\">Animated Mouse Scroll Icon Widget for Elementor (Free)<\/a>  The Animated Mouse Scroll Icon is a captivating animation that prompts users to explore further content by scrolling down the page.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/contact-form-7-widget-for-elementor\/\" rel=\"nofollow ugc\">Contact Form 7 Widget for Elementor (Free)<\/a>  The Contact Form 7 widget is a valuable tool that makes customizing the appearance of your contact forms in the Elementor page builder easier. With this widget, you can enhance the visual appeal of your contact forms directly from the page builder interface.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/notification-widget-for-elementor\" rel=\"nofollow ugc\">Notification Widget for Elementor (Free)<\/a>  The Notification widget allows you to easily display an eye-catching alert box and draw attention to important messages on your Elementor website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/event-box-widget-for-elementor\" rel=\"nofollow ugc\">Event Box Widget for Elementor (Free)<\/a>  Enhance your website with the Event Box widget. It&#8217;s designed to showcase events and special occasions in a stunning display. Present your events in a user-friendly format, complete with a call-to-action button for seamless ticket purchase or event enrollment.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-tooltip-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Tooltip Widget for Elementor (Free)<\/a>  The Image Tooltip widget provides a simple way to add tooltips to images on a webpage, allowing for additional information or call-to-action text. It also supports linking the image to another page.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/360-product-viewer-widget-for-elementor\/\" rel=\"nofollow ugc\">360° Product Viewer Widget for Elementor (Pro)<\/a>  Present your product from all perspectives using the immersive 360° Product Viewer widget for Elementor. This powerful tool allows customers to interact with and examine every intricate detail, giving them a complete understanding of your product.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/currency-converter-widget-for-elementor\/\" rel=\"nofollow ugc\">Currency Converter Widget for Elementor (Pro)<\/a>  Easily convert currencies with our intuitive Currency Converter widget. Stay updated on real-time exchange rates and effortlessly calculate conversions on your website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-scroll-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Scroll Widget for Elementor (Pro)<\/a>  Elevate your image display effortlessly with the Image Scroll Widget. This feature enables a seamless vertical scroll, smoothly moving images from top to bottom as users hover over them.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/job-listing-widget-for-elementor\/\" rel=\"nofollow ugc\">Job Listing Widget for Elementor (Pro)<\/a>  Effortlessly post detailed job listings using the Job Listing widget for Elementor. Attract potential candidates and simplify the recruitment process by showcasing a wide range of positions, breaking through geographical barriers, and emphasizing the required qualifications and skills for each role.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/event-list-widget-for-elementor\/\" rel=\"nofollow ugc\">Event List Widget for Elementor (Pro)<\/a>  The Event List Widget makes it easy to display upcoming events and special occasions on your Elementor websites. You can populate the widget with dynamic data using posts and connect it to advanced filters and tools for added functionality.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/hotspots-for-elementor-page-builder\/\" rel=\"nofollow ugc\">Hotspots Widget for Elementor (Pro)<\/a>  Improve your images with interactive hotspots featuring tooltips and the choice of a built-in popup. Each hotspot popup can include an image and descriptive text, creating an engaging user experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/360-panorama-virtual-tour-widget-for-elementor\/\" rel=\"nofollow ugc\">360 Panorama Virtual Tour Widget for Elementor (Pro)<\/a>  Create captivating 360 tours on your Elementor website. Allow visitors to remotely explore your place and stay engaged. With a virtual tour, they can navigate through your location in a 360 panoramic view, getting a realistic feel of its appearance.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/qr-code-widget-for-elementor\/\" rel=\"nofollow ugc\">QR Code Widget for Elementor (Pro)<\/a>  The QR Code widget for Elementor simplifies the process of creating and integrating QR codes into your WordPress website. Generate QR codes for text, phone numbers, links, or email addresses with ease, enhancing user engagement and interaction.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/layers-widget-for-elementor\/\" rel=\"nofollow ugc\">Layers Widget for Elementor (Pro)<\/a>  Effortlessly layer images, text, shapes, and icons on your Elementor pages with the Image Layers widget, a straightforward solution for precise positioning and design flexibility.<\/p>\n<\/li>\n<\/ol>\n<h3>Post Widgets for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-tabs-for-elementor\/\" rel=\"nofollow ugc\">Post Tabs Widget for Elementor (Free)<\/a>  Create engaging tab designs for showcasing your WordPress posts using the Post Tabs widget. Organize your top blog pieces by tags or categories in an interactive layout.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-accordions-for-elementor\/\" rel=\"nofollow ugc\">Post Accordion Widget for Elementor (Free)<\/a>  The Post Accordion Widget in WordPress lets you display posts, pages, products, or custom post types in a distinctive and interactive accordion layout. It condenses information, saving space. Visitors can quickly scan titles and expand relevant items to read more, catering to their specific needs and interests.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-carousel-lite-widget-for-elementor\" rel=\"nofollow ugc\">Post Carousel Lite Widget for Elementor (Free)<\/a>  The Post Carousel Lite widget allows you to choose a collection of posts, pages, products, or any custom post type. You can filter them by category, tags, or author. These selected items are then presented in a visually appealing and interactive  &hellip;<\/p>\n<\/li>\n<\/ol>\n",
        "installation": "<p>Note : This plugin works with Elementor. Make sure you have <a href=\"https:\/\/wordpress.org\/plugins\/elementor\/\" rel=\"ugc\">Elementor<\/a> installed.<\/p>\n<ol>\n<li>Upload the plugin folder to the <code>\/wp-content\/plugins\/<\/code> directory, or install the plugin through the WordPress plugins screen directly.<\/li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress<\/li>\n<li>Navigate to Unlimited Elements in the WordPress side menu and install the widget you want by hovering over it and clicking install.<\/li>\n<\/ol>\n",
        "faq": "\n<dt id='can%20i%20use%20the%20plugin%20without%20elementor%3F'>\nCan I use the plugin without Elementor?\n<\/h4>\n<p>\n<p>No. You cannot use the plugin without Elementor since it&#8217;s an addon for Elementor.<\/p>\n<\/p>\n<dt id='does%20the%20plugin%20work%20with%20any%20theme%3F'>\nDoes the plugin work with any theme?\n<\/h4>\n<p>\n<p>Absolutely! The plugin will work with any theme where Elementor works.<\/p>\n<\/p>\n<dt id='what%20if%20i%20update%20to%20the%20premium%20version%20after%20using%20the%20free%20version%3F'>\nWhat if I update to the Premium version after using the Free version?\n<\/h4>\n<p>\n<p>Your existing elements\/content will work with the premium version. So you wonâ€™t lose your any of your hard work.<\/p>\n<\/p>\n<dt id='can%20i%20get%20a%20refund%3F'>\nCan I get a refund?\n<\/h4>\n<p>\n<p>If you are not happy with your purchase at anytime just contact us and we will refund 100% of your money no questions asked.<\/p>\n<\/p>\n<dt id='do%20you%20offer%20a%20renewals%20discount%3F'>\nDo you offer a renewals discount?\n<\/h4>\n<p>\n<p>Yes, you get 25% discount for all annual plan automatic renewals. The renewal price will never be increased so long as the subscription is not cancelled.<\/p>\n<\/p>\n<dt id='how%20do%20i%20install%20and%20activate%20the%20%27unlimited%20elements%20for%20elementor%27%20plugin%20on%20wordpress%3F'>\nHow do I install and activate the &#8216;Unlimited Elements for Elementor&#8217; plugin on WordPress?\n<\/h4>\n<p>\n<p>To install the &#8216;Unlimited Elements&#8217; plugin on your WordPress site, access your WordPress Dashboard and go to Plugins -&gt; Add New. In the search box, enter &#8216;Unlimited Elements.&#8217; Locate the plugin in the search results and click on the &#8216;Install Now&#8217; button. Once the installation is finished, click on the &#8216;Activate&#8217; button, and &#8216;Unlimited Elements for Elementor&#8217; will be successfully activated on your WordPress site.<\/p>\n<\/p>\n<dt id='do%20i%20need%20to%20know%20code%20to%20use%20unlimited%20elements%3F'>\nDo I need to know code to use Unlimited Elements?\n<\/h4>\n<p>\n<p>No, you do not need to know code to leverage the widgets and other tools provided by the Unlimited Elements plugin. It is designed to be user-friendly, allowing you to enhance your Elementor experience without any coding expertise. However, for users familiar with code, the plugin offers the added advantage of a widget creator, enabling the creation of custom Elementor widgets for a more tailored and advanced design experience.<\/p>\n<\/p>\n<dt id='is%20my%20site%20secure%20with%20unlimited%20elements%3F'>\nIs my site secure with Unlimited Elements?\n<\/h4>\n<p>\n<p>Yes, Unlimited Elements is a secure plugin. The plugin is regularly updated to adhere to common security standards, ensuring a secure environment for your website.<\/p>\n<\/p>\n<dt id='what%20types%20of%20filters%20does%20unlimited%20elements%20provide%3F'>\nWhat types of filters does Unlimited Elements provide?\n<\/h4>\n<p>\n<p>Unlimited Elements offers a variety of filter types, including search filters, dropdowns, tabs filters, checkboxes filters, and WooCommerce-related filters, providing a diverse range of options for dynamic and versatile website filtering.<\/p>\n<\/p>\n<dt id='are%20the%20filters%20compatible%20with%20any%20post%20type%20or%20woocommerce%20products%3F'>\nAre the filters compatible with any post type or WooCommerce products?\n<\/h4>\n<p>\n<p>Yes, all the filters provided by Unlimited Elements are live Ajax filters, ensuring dynamic and seamless filtering experiences. They are compatible with any post type, including custom post types, and WooCommerce products, offering versatile functionality for a wide range of content on your website. Utilize specific WooCommerce filters to enhance the shopping experience for your customers, such as the price range slider filter and color swatches filter for products with different colors.<\/p>\n<\/p>\n<dt id='can%20i%20use%20unlimited%20elements%20to%20display%20custom%20post%20types%20in%20my%20widgets%3F'>\nCan I use Unlimited Elements to display custom post types in my widgets?\n<\/h4>\n<p>\n<p>Yes, Unlimited Elements supports showcasing custom post types with advanced query selection and seamless connection to any filter from the UE library. This allows for tailored and dynamic content presentation on your website using the plugin&#8217;s versatile features.<\/p>\n<\/p>\n<dt id='what%20are%20multi-source%20widgets%20in%20unlimited%20elements%3F'>\nWhat are multi-source widgets in Unlimited Elements?\n<\/h4>\n<p>\n<p>Multi-source widgets in Unlimited Elements enable the population of item-based widgets with various dynamic source types. These widgets can be populated using sources like ACF repeater fields, WooCommerce products, custom post types, Instagram feeds, and various API integrations. This versatility allows for the seamless integration of diverse content into widgets, enhancing the flexibility and functionality of your website elements.<\/p>\n<\/p>\n<dt id='should%20i%20use%20remote%20control%20widgets%20or%20the%20sync%20widgets%20function%20in%20unlimited%20elements%3F'>\nShould I use Remote Control Widgets or the Sync Widgets function in Unlimited Elements?\n<\/h4>\n<p>\n<p>The choice depends on your design preferences. If you want complete control, go for Remote Control Widgets. For synchronized layouts, choose Sync Widgets. They can also be used together for even more powerful customization options in Unlimited Elements.<\/p>\n<\/p>\n\n",
        "changelog": "<p>version 1.5.101: 2024-04-03<\/p>\n<p>Plugin Changes:<\/p>\n<ul>\n<li>Feature &#8211; added &#8220;date time&#8221; attribute to items attributes list<\/li>\n<li>Feature &#8211; made some integration for &#8220;relevanssi&#8221; plugin<\/li>\n<li>Feature &#8211; added woo rating stars to multisource fields<\/li>\n<li>Feature &#8211; added visual text that showing the form fields conditions<\/li>\n<li>Fix &#8211; fixed filters mode init mode<\/li>\n<li>Fix &#8211; fixed various filters related bugs<\/li>\n<li>Fix &#8211; fixed ucpage parameter fetch for pagination in archive page<\/li>\n<li>Fix &#8211; fixed gallery from meta field item source texts <\/li>\n<li>Fix &#8211; fixed some number field processing<\/li>\n<li>Fix &#8211; fixed multisep form with template submit<\/li>\n<\/ul>\n<p>Widgets Changes:<\/p>\n<ul>\n<li>Feature: Radio Button Field (Pro) &#8211; Implemented &#8216;Set First Item Selected&#8217; option. This new functionality allows users to automatically select the first item in the widget.<\/li>\n<li>Feature: Fullscreen Menu (Free) &#8211; Implemented &#8216;Open Current Submenu On Page Load&#8217; option. This new functionality allows users to automatically expand the current submenu on page load, providing immediate access to relevant content.<\/li>\n<li>Feature: Background Slider (Pro) &#8211; Introduced &#8216;Add SEO Tags&#8217; option, allowing users to include alt and title attributes for images for improved search engine optimization of the widget content.<\/li>\n<li>Feature: Floating Chat Buttons (Pro) &#8211; Introduced &#8220;Close Message Box After Send&#8221; option, allowing automatic closure of the message box after clicking the send button for improved user experience and convenience.<\/li>\n<li>Feature: Floating Chat Buttons (Pro) &#8211; Introduced &#8220;Close Button After Click&#8221; option, enabling automatic closure of the buttons after clicking any button, eliminating the need for manual closure for enhanced user convenience and interaction.<\/li>\n<li>Feature: Content Grid (Pro) &#8211; Implemented &#8216;Description&#8217; option. This new functionality allows users to add a description to the widget, providing additional context or instructions.<\/li>\n<li>Feature: SVG Animation (Free) &#8211; Optimized widget for Elementor Popup compatibility. This update ensures seamless integration and improved performance when using the widget within Elementor Popups.<\/li>\n<li>Feature: Animated Ripples (Pro) &#8211; Introduced &#8216;Ripple Scale&#8217; option, enabling users to control the size of the ripples for enhanced visual customization and effect.<\/li>\n<li>Feature: Interactive Circle Infographic (Pro) &#8211; Implemented &#8216;Item Trigger type&#8217; for Segment Layout type. This new functionality allows segments to be opened by hovering on them, providing users with an alternative interaction method.<\/li>\n<li>Feature: Line Text Divider (Free) &#8211; Added styling options including Line Thickness, Line Border Radius, Line Shadow, Text Typography, Background Color, Padding, Border, Border Radius, and Box Shadow for enhanced customization. Additionally, existing styling options have been improved for better optimization and user experience.<\/li>\n<li>Feature: Price Range Filter (Pro) &#8211; Implemented Grow Effect on Thumb Hover option. This new functionality allows users to enable the grow effect on thumbnail hover.<\/li>\n<li>Feature: Price Range Filter (Pro) &#8211; Implemented Hide Default Arrows option. This new functionality allows users to hide default arrows, providing enhanced customization of the widget&#8217;s appearance and behavior.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Implemented &#8216;Show Time Ago&#8217; option. This new functionality allows users to display the time elapsed since a publish event, providing context and improving user engagement.<\/li>\n<li>Feature: Dropdown Field (Pro) &#8211; Implemented &#8216;Required&#8217; option. This new functionality allows users to mark a field as required, ensuring that users must fill it out before submitting the form.<\/li>\n<li>Feature: Submit Button (Free) &#8211; Implemented &#8216;Empty Field Error Text&#8217; option. This new functionality allows users to customize the error message displayed when a required field is left empty.<\/li>\n<li>Feature: Icon Bullets (Free) &#8211; Implemented &#8216;Title Color Hover&#8217; and &#8216;Text Color Hover&#8217; options. These new functionalities allow users to customize the color of titles and text when hovered over, providing enhanced interactivity and visual feedback.<\/li>\n<li>Feature: Unlimited Charts (Pro) &#8211; Implemented &#8216;Font Family&#8217; option for Label X Axis and Y Axis. This new functionality allows users to customize the font family for labels displayed on the X and Y axes, providing enhanced typography control.<\/li>\n<li>Feature: Overlay Carousel (Pro) &#8211; Implemented &#8216;Show Arrows&#8217; option and updated Arrows styling options. This new functionality allows users to control the visibility of arrows and customize their styling, providing more flexibility in widget design and navigation.<\/li>\n<li>Feature: Post Timeline (Pro) &#8211; Implemented &#8216;Empty Message&#8217; option. This new functionality allows users to display a custom message when no posts are found, providing better user feedback and enhancing the user experience.<\/li>\n<li>Feature: Checkbox Field (Pro) &#8211; Implemented &#8216;Required&#8217; option. This new functionality allows users to mark a field as required, ensuring that users must fill it out before submitting the form.<\/li>\n<li>Feature: Radio Button Field (Pro) &#8211; Implemented &#8216;Required&#8217; option. This new functionality allows users to mark a field as required, ensuring that users must fill it out before submitting the form.<\/li>\n<li>Change: Checkboxes Filter (Pro) &#8211; Added &#8216;aria-label&#8217; attribute to links. This new functionality enhances accessibility by providing descriptive labels for elements.<\/li>\n<li>Change: Post Carousel (Pro) &#8211; Added &#8216;alt&#8217; and &#8216;title&#8217; attributes to the image for improved SEO optimization and accessibility.<\/li>\n<li>Change: Flip Box Carousel (Pro) &#8211; Changed some selectors in CSS to avoid empty items appearing on live page.<\/li>\n<li>Change: Underline Animated Button (Free) &#8211; Changed <\/li>\n<\/ul>\n<p>&lt;<\/p>\n<p>section&gt; tag to<\/p>\n<p>&lt;<\/p>\n<p>div&gt;. This update improves the semantic structure of the widget, ensuring better compatibility with various screen readers and accessibility standards.<br \/>\n* Change: Unlimited Charts (Pro) &#8211; Updated the animation option to trigger animation when the chart comes into view instead of upon initial load, improving user experience and visual appeal.<br \/>\n* Change: Submit Button (Free) &#8211; Changed the position of Empty Field Errors to be grouped after the submit button. This update enhances the layout and organization of error messages, providing users with a clearer indication of missing information before submission.<br \/>\n* Change: Post Blocks (Free) &#8211; Changed CSS selector for Typography option for better accessibility. This update improves the accessibility of the Typography option by using a more descriptive and accessible CSS selector.<br \/>\n* Change: List Marquee (Pro) &#8211; Increased speed limit to 1000. This update enhances the speed capabilities of the widget, allowing for faster performance and smoother animations.<br \/>\n* Change: Checkbox Field (Pro) &#8211; Increased accessibility by adding IDs to input elements and &#8220;for&#8221; attributes to label elements. This update improves accessibility by associating labels with their corresponding form controls, making it easier for screen readers and other assistive technologies to interpret and navigate the form.<br \/>\n* Change: Masonry Gallery (Pro) &#8211; Implemented &#8216;Autoplay Video In Lightbox&#8217; option. This new functionality allows users to enable autoplay for videos displayed within the lightbox, providing a more dynamic and engaging viewing experience.<br \/>\n* Change: WhatsApp Chat (Pro) &#8211; Added &#8216;aria-label&#8217; attribute to links. This new functionality enhances accessibility by providing descriptive labels for elements.<br \/>\n* Fix: Number Field (Pro) &#8211; Implemented CSS protection from the max-width CSS property. This new functionality safeguards against unintended styling conflicts or overrides caused by the max-width property.<br \/>\n* Fix: Fullscreen Menu (Free) &#8211; Addressed issue where the fullscreen menu was not displayed correctly in Safari browser.<br \/>\n* Fix: Image Scroll (Pro) &#8211; Resolved 404 error appearing every time Overlay element was added on the page. This fix ensures that the Overlay element is loaded correctly without triggering a 404 error.<\/p>\n<p>version 1.5.100: 2024-03-17<\/p>\n<p>Plugin Changes:<\/p>\n<ul>\n<li>Feature: added option to connect the filters to some specific grid group<\/li>\n<li>Fix: fixed js run for background output not always happend<\/li>\n<li>Fix: filters was shown only related to grid taxonomies after changing to &#8220;all&#8221; <\/li>\n<li>Fix: returned some tiles gallery images that was missing<\/li>\n<\/ul>\n<p>Widgets Changes:<\/p>\n<ul>\n<li>Feature: List (Free) &#8211; Implemented &#8216;Open Link in New Tab&#8217; option. This new functionality allows users to specify whether links should open in a new tab, providing flexibility in link behavior.<\/li>\n<li>Feature: Compact Gallery (Free) &#8211; Implemented &#8216;Hide Thumbnail Panel Under Width&#8217; option. This new functionality allows users to hide the thumbnail panel when the viewport width is below a specified threshold, optimizing the display for smaller screens.<\/li>\n<li>Feature: Select Dropdown Filter (Pro) &#8211; Implemented &#8216;Connect To Grids Group&#8217; option. This new functionality allows users to connect the filter widget to a particular grid widget.<\/li>\n<li>Feature: Checkboxes Filter (Pro) &#8211; Implemented &#8216;Connect To Grids Group&#8217; option. This new functionality allows users to connect the filter widget to a particular grid widget.<\/li>\n<li>Feature: Tabs Filter (Pro) &#8211; Implemented &#8216;Connect To Grids Group&#8217; option. This new functionality allows users to connect the filter widget to a particular grid widget.<\/li>\n<li>Feature: Scroll Sequence (Pro) &#8211; Added &#8216;Image Horizontal Shift&#8217; option, allowing users to adjust the horizontal position of the image for enhanced customization and layout control.<\/li>\n<\/ul>\n<p>version 1.5.99: 2024-03-11<\/p>\n<ul>\n<li>Fix &#8211; updated multisource image fields<\/li>\n<li>Fix &#8211; fixed some small php bug with strtobool function<\/li>\n<\/ul>\n<p>version 1.5.98: 2024-03-05<\/p>\n<ul>\n<li>Fix Some small gutenberg related bug fix<\/li>\n<\/ul>\n<p>version 1.5.97: 2024-03-04<\/p>\n<p>Plugin Updates:<\/p>\n<ul>\n<li>Fix: allow showing authors name translated<\/li>\n<li>Change: updated font awesome version to 6<\/li>\n<li>Fix: done some link attribute security fix<\/li>\n<\/ul>\n<p>Widgets Updates:<\/p>\n<ul>\n<li>Feature: Accordion Menu (Pro) &#8211; Implemented &#8216;Active State Color&#8217; options for Sub Menu items. This new functionality allows users to customize the color of sub-menu items when they are in the active state, providing enhanced visual feedback.<\/li>\n<li>Feature: Content Slider (Pro) &#8211; Made &#8216;Slide Margin&#8217; option available for Full Slider Type and Offset Slider Type. This update expands the usability of the margin customization, allowing users to set margins between slides in both Full Slider and Offset Slider configurations.<\/li>\n<li>Feature: Icon Tabs (Pro) &#8211; Made &#8216;Start Collapsed&#8217; option responsive. This update ensures that the &#8216;Start Collapsed&#8217; behavior adjusts responsively, providing a consistent and user-friendly experience across various devices and screen sizes.<\/li>\n<li>Feature: Post Accordion (Free) &#8211; Introduced &#8216;Expand All Accordion&#8217; functionality, enabling users to expand all accordion items with a single click for improved content accessibility.<\/li>\n<li>Feature: Fullscreen Menu (Free) &#8211; Introduced option to customize the thickness of the animated hamburger icon bars, providing users with greater control over the visual appearance of the icon.<\/li>\n<li>Change: Coverflow Carousel (Pro) &#8211; Updated &#8216;Button Link&#8217; option: if empty, no link will be applied. This modification ensures that if the &#8216;Button Link&#8217; option is left empty, no link will be associated with the button within the widget.<\/li>\n<li>Fix: Product Carousel (Pro) &#8211; Optimized widget HTML code. This update enhances performance and efficiency by streamlining the HTML structure of the widget.<\/li>\n<li>Fix: Content Tabs (Free) &#8211; Improved widget interaction within an Elementor&#8217;s popup. This update ensures a more seamless and optimized experience when utilizing the widget within a popup setting.<\/li>\n<\/ul>\n<p>version 1.5.96: 2024-02-26<\/p>\n<p>Plugin Updates:<\/p>\n<ul>\n<li>Feature: added option for time_ago_short in timelines that will show shorter version of minutes and hours text<\/li>\n<li>Feature: added defaults for weather widget<\/li>\n<li>Fix: fixed hourly weather fields<\/li>\n<li>Fix: fixed the import with images functionality<\/li>\n<li>Fix: set default timeout to remote requests<\/li>\n<li>Fix: fixed the image duplicate when importing templates<\/li>\n<\/ul>\n<p>Widgets Updates:<\/p>\n<ul>\n<li>Feature: Side Menu (Pro) &#8211; Implemented &#8216;Menu Padding&#8217; option. This new functionality allows users to set padding for the menu, providing control over the spacing and layout within the widget.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Introduced a new value for &#8216;Meta Data Position&#8217; option called &#8216;Before Title&#8217;. This new functionality allows users to position meta data before the title, providing additional flexibility in content layout.<\/li>\n<li>Feature: Loop Carousel (Pro) &#8211; Implemented &#8216;Stage Padding&#8217; option. This new functionality allows users to set stage padding, displaying a part of the previous and next carousel items for a more visually appealing and dynamic presentation.<\/li>\n<li>Feature: Interactive Circle Infographic (Pro) &#8211; Implemented &#8216;Selected Item Number&#8217; option. This new functionality allows users to select a specific item by default, enhancing user experience by highlighting a predetermined item upon initialization.<\/li>\n<li>Feature: Unlimited Timeline (Free) &#8211; Introduced option to display the image on the opposite side of the content for enhanced layout flexibility and customization.<\/li>\n<li>Feature: Thumbnail Slider (Pro) &#8211; Introduced &#8216;Multi Source&#8217; option, enabling users to select gallery items from various sources for enhanced flexibility and content integration.<\/li>\n<li>Feature: Timer Countdown Banner (Pro) &#8211; Added &#8216;Direction&#8217; option to support RTL (Right-to-Left) layout websites.<\/li>\n<li>Feature: Post Horizontal Timeline (Pro) &#8211; Introduced Background Color and Icon Color options for Navigation Arrows in disabled mode. This new functionality allows users to customize the appearance of navigation arrows when they are disabled, providing enhanced visual control.<\/li>\n<li>Feature: Post Timeline (Pro) &#8211; Implemented &#8216;Time Ago Type&#8217; option. This new functionality allows users to choose the type of time ago representation, providing flexibility in how time is displayed within the widget.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Implemented &#8216;Text Custom Field&#8217; option. This new functionality allows users to add a custom field under the main Posts Text, providing additional customization for displaying content.<\/li>\n<li>Feature: Post Timeline (Pro) &#8211; Implemented &#8216;Link Type&#8217; option for all link elements in the widget. This new functionality allows users to choose the type of link for various elements within the widget, enhancing control over linking behavior.<\/li>\n<li>Feature: Remote Link (Pro) &#8211; Introduced active state for the link. This new functionality allows users to customize the appearance of the link when it is in an active state, providing enhanced visual feedback.<\/li>\n<li>Feature: Dynamic Post Popup (Pro) &#8211; Implemented &#8216;Hide Vertical Scrollbar in Popup&#8217; option. This new functionality allows users to hide the vertical scrollbar within the popup, providing a cleaner and more focused appearance.<\/li>\n<li>Feature: Icon Carousel (Pro) &#8211; Introduced &#8216;Autoplay Pause on Hover&#8217; option, allowing users to pause autoplay functionality when hovering over the carousel for improved control and interaction.<\/li>\n<li>Feature: Dynamic Post Popup (Pro) &#8211; Introduced Entrance Animation functionality for the popup. This new feature allows users to apply entrance animations, enhancing the visual appeal and engagement when the popup appears.<\/li>\n<li>Feature: Unlimited Timeline (Free) &#8211; Implemented &#8216;Content Box Link&#8217; option. This new functionality allows users to link the entire content box, providing a convenient way to associate a link with the entire widget item.<\/li>\n<li>Feature: Text Field (Free) &#8211; Added &#8216;Read Only&#8217; option, allowing users to set the field as read-only for preventing user input while retaining visibility of the text.<\/li>\n<li>Feature: Unlimited Charts (Pro) &#8211; Introduced &#8216;Radar Range&#8217; option for Radar chart, allowing users to set the minimum range value for improved data visualization.<\/li>\n<li>Feature: Testimonial Carousel (Pro) &#8211; Added &#8216;Rating&#8217; field to the Source option. This new functionality allows users to incorporate a rating field as a source for the widget, expanding the available data sources for enhanced content display.<\/li>\n<li>Feature: Multi Step Form (Pro) &#8211; Introduced &#8216;Direction&#8217; option. This new functionality is useful for RTL (Right-to-Left) websites, allowing users to set the direction of the widget layout accordingly.<\/li>\n<li>Feature: Unlimited Timeline (Free) &#8211; Introduced option for users to customize the text of each item&#8217;s button, providing greater flexibility.<\/li>\n<li>Feature: Post List (Free) &#8211; Implemented &#8216;Space Between Categories&#8217; option. This new functionality allows users to set spacing between categories, providing control over the layout and visual presentation of category elements.<\/li>\n<li>Feature: Memory Game (Pro) &#8211; Introduced &#8216;Add Completion Time to Form Field&#8217; option, enabling users to automatically append the time taken to complete the memory game to a designated form field.<\/li>\n<li>Feature: Post Timeline (Pro) &#8211; Implemented &#8216;Add Link For The Whole Item&#8217; option. This new functionality allows users to add a link to the entire widget item, enhancing the interactive capabilities and providing a clickable area for the entire item.<\/li>\n<li>Feature: Post Carousel (Pro) &#8211; Implemented &#8216;Text Padding&#8217; and &#8216;Title Padding&#8217; options. This new functionality allows users to set padding for text and title elements, providing enhanced control over spacing and layout within the widget.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Introduced &#8216;Date Modified&#8217; options. This new functionality allows users to display the date when a post was last modified, providing additional information and transparency in content presentation.<\/li>\n<li>Feature: Unlimited Google Maps (Pro) &#8211; Introduced options to customize Maps Controls icons&#8217; color and background color. This new functionality allows users to personalize the appearance of map controls, enhancing visual customization.<\/li>\n<li>Feature: Unlimited Google Maps (Pro) &#8211; Implemented &#8216;Disable Map Interaction On Mobile&#8217; option. This new functionality allows users to disable map interaction specifically on mobile devices, providing control over the user experience on smaller screens.<\/li>\n<li>Change: Content Tabs (Free) &#8211; Modified behavior of &#8216;Start Collapsed&#8217; option when used with &#8216;Set Hash&#8217;. If the URL has a hash, the first opened tab will be determined by the hash, providing a more dynamic and user-friendly experience.<\/li>\n<li>Change: Dropdown Button (Pro) &#8211; Removed Text Decoration CSS property from dropdown items. This update enhances the visual presentation by eliminating unnecessary text decoration.<\/li>\n<li>Change: Woo Mini Cart (Pro) &#8211; Added separate border options for &#8216;View Cart&#8217; and &#8216;Checkout&#8217; buttons, providing users with more customization flexibility for button styling.<\/li>\n<li>Change: Swipe Carousel (Pro) &#8211; Modified &#8216;Enable Link&#8217; option. Now, the entire item serves as a link, providing a more intuitive and consistent approach to linking within the widget.<\/li>\n<li>Fix: Submit Button (Free) &#8211; Corrected default values in email 2 that were leading to validation errors.<\/li>\n<li>Fix: Post Carousel Lite (Free) &#8211; Addressed issue where the carousel was not displaying on mobile devices.<\/li>\n<li>Fix: Icon Tabs (Pro) &#8211; Resolved issue with the &#8216;Start Collapsed&#8217; option. The fix ensures that the &#8216;Start Collapsed&#8217; option now functions correctly, delivering the intended collapsed behavior upon initialization.<\/li>\n<li>Fix: Post Grid (Pro) &#8211; Optimized widget item HTML code. This update enhances performance and efficiency by streamlining the HTML structure of widget items.<\/li>\n<li>Fix: Unlimited Timeline (Free) &#8211; Optimized item HTML code. This update improves performance and efficiency by refining the HTML structure of individual items within the widget.<\/li>\n<li>Fix: Unlimited Timeline (Free) &#8211; Optimized CSS code. This update improves performance and reduces the overall footprint of the stylesheet, enhancing efficiency and loading times.<\/li>\n<li>Fix: Remote Link (Pro) &#8211; Resolved issue where the Text Shadow option was erroneously interpreted as Box Shadow. The fix ensures that the Text Shadow option now functions correctly, providing the intended text shadow effect.<\/li>\n<li>Fix: Scroll Sequence (Pro) &#8211; Revised and improved descriptions of the widget fields for better clarity.<\/li>\n<li>Fix: Post Magazine Grid (Pro) &#8211; Added &#8216;raw&#8217; tag to category names to fix the display issue where the &#8216;&amp;&#8217; symbol in category names was not displaying correctly.<\/li>\n<li>Fix: Before After (Pro) &#8211; Improved widget interaction with Elementor&#8217;s Popups. This update ensures seamless integration and optimal performance when using the widget within Elementor&#8217;s Popup functionality.<\/li>\n<li>Fix: Grid Gallery (Pro) &#8211; Resolved an issue where the widget was not extending to full width within Elementor Container.<\/li>\n<li>Fix: Particle Image (Pro) &#8211; Added protection from lazy load. This update ensures compatibility and proper functionality, mitigating potential issues related to lazy loading on various platforms.<\/li>\n<\/ul>\n<p>version 1.5.95: 2024-02-12:<\/p>\n<ul>\n<li>Feature: Ensure that the blog displayed on the &#8220;Home&#8221; page of the plugin is always up-to-date.<\/li>\n<li>Feature: Implemented support for tags in the widget catalog.<\/li>\n<li>Feature: Added an option for galleries to play videos in muted mode.<\/li>\n<li>Feature: Integrated weather forecast data preparation for the widget.<\/li>\n<li>Fix: Addressed some minor potential security risks associated with the import templates functionality.<\/li>\n<li>Fix: Rectified email validation for Form Email2.<\/li>\n<li>Fix: Resolved some issues with the price range filter.<\/li>\n<li>Fix: fixed the problem where dynamic template styles disappeared after updating Elementor Pro.<\/li>\n<\/ul>\n<p>Widgets Updates:<\/p>\n<ul>\n<li>Feature: Image Zoom Content Box (Free) &#8211; Implemented &#8216;Title Tag&#8217; option. This new functionality allows users to specify the HTML tag for titles within the widget, providing flexibility and control over the semantic structure of the content.<\/li>\n<li>Feature: Post Accordion (Free) &#8211; Implemented &#8216;Disable Link in Image&#8217; option. This new functionality allows users to disable the link associated with an image, providing more control over the interactive behavior of images within the widget.<\/li>\n<li>Feature: Slider Gallery (Free) &#8211; Implemented &#8216;Mute Video&#8217; option. This new functionality allows to play videos muted by default. Volume can be adjusted in video players on live page.<\/li>\n<li>Feature: Unlimited Charts (Pro) &#8211; Implemented &#8216;Item Bar Width&#8217; option. This new functionality allows users to customize the width of individual bars, providing greater control over the visual representation of items.<\/li>\n<li>Feature: Remote Item Navigation (Pro) &#8211; Introduced &#8216;Border Override Color&#8217; options for Regular and Active states. This new functionality allows users to customize border colors separately for both Regular and Active states, enhancing visual styling in the widget.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Implemented &#8216;Title Min Height&#8217; option. This new functionality allows users to set a minimum height for the title, offering more control over the visual presentation and consistency in the widget.<\/li>\n<li>Feature: Checkbox Field (Pro) &#8211; Introduced &#8216;Show Link&#8217; option. This new functionality enables users to show or hide links and customize their styling within the widget, offering more control over the interactive elements.<\/li>\n<li>Feature: Counter (Free) &#8211; Implemented &#8216;Add Link To Widget Container&#8217; option. This new functionality allows users to include a link, enhancing the interactive capabilities of the element by enabling navigation to another page or resource.<\/li>\n<li>Feature: Icon Box Accordion (Pro) &#8211; Introduced &#8216;Icon + Text&#8217; option for Graphic Element. This new value expands customization by allowing users to display both an icon and text within the Graphic Element for richer visual representation.<\/li>\n<li>Feature: Before After (Pro) &#8211; Added support for the widget inside Elementor&#8217;s Tabs widget. This enhancement ensures seamless integration and compatibility, allowing users to utilize the widget effectively within Elementor&#8217;s Tabs.<\/li>\n<li>Feature: Justified Image Carousel (Pro) &#8211; Implemented &#8216;Hide Inactive Arrow&#8217; option. This new functionality allows users to hide inactive arrows, providing a cleaner and more focused appearance in the widget interface.<\/li>\n<li>Feature: Layers (Pro) &#8211; Added shadow for icon type layers.<\/li>\n<li>Feature: Icon Pointer Button (Pro) &#8211; Introduced &#8216;Direction&#8217; option. This new functionality allows users to specify the direction for RTL (Right-to-Left) or LTR (Left-to-Right) websites, ensuring proper layout alignment based on language direction.<\/li>\n<li>Feature: Loop Carousel (Pro) &#8211; Implemented &#8216;Auto Height&#8217; option. This new functionality adjusts the height of the slider dynamically based on the height of the current slide, providing a more adaptive and seamless user experience.<\/li>\n<li>Feature: Justified Image Carousel (Pro) &#8211; Option to fix the broken layout (resulting in a duplicate carousel) caused by delayed image loading, this solution verifies that the images are loaded before initializing the carousel.<\/li>\n<li>Feature: Remote Tabs (Pro) &#8211; Introduced styling options for Border Radius, Border, and Shadow for the image of the active tab.<\/li>\n<li>Feature: Layers (Pro) &#8211; Added background color, padding and radius for text fields.<\/li>\n<li>Feature: WhatsApp Chat (Pro) &#8211; z-index option for Popup, allowing users to customize the stacking order of the Popup for better control over its visibility in relation to other elements.<\/li>\n<li>Feature: WhatsApp Chat (Pro) &#8211; Introduced option to customize the Popup Title, along with styling options for enhanced visual control and personalization.<\/li>\n<li>Feature: Swipe Carousel (Pro) &#8211; Introduced &#8216;Additional Title&#8217; options. This new functionality expands customization by providing additional settings for titles, allowing users to further enhance the visual presentation of titles within the widget.<\/li>\n<li>Feature: Content Grid (Pro) &#8211; Introduced &#8216;Image Scale&#8217; option. This new functionality allows users to scale the images, providing enhanced control over the visual presentation within the widget.<\/li>\n<li>Feature: Fullscreen Menu (Free) &#8211; Implemented feature &#8211; automatically opens menu item if it matches the current page URL.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Added Option to show post tags, providing users with the ability to showcase tags associated with each post.<\/li>\n<li>Feature: Post Magazine Grid (Pro) &#8211; Introduced &#8216;Image Scale&#8217; and &#8216;CSS Filters&#8217; options along with the hover transition duration for enhanced image customization.<\/li>\n<li>Feature: Card Carousel (Free) &#8211; Implemented &#8216;Image Position&#8217; option. This new functionality allows users to customize the position of image within the widget, providing enhanced control over the visual layout.<\/li>\n<li>Feature: Layers (Pro) &#8211; Added mouse parallax effect, adds a captivating and interactive dimension to the user interface.<\/li>\n<li>Feature: Swipe Carousel (Pro) &#8211; Introduced additional styling options. This new set of functionalities allows users to further customize and refine the visual appearance of the widget, providing enhanced styling possibilities.<\/li>\n<li>Feature: Mega Menu (Pro) &#8211; Implemented &#8216;Close Transition Speed&#8217; option. This new functionality enables users to set the speed of close animations for the dropdown, enhancing visual transitions and customization.<\/li>\n<li>Feature: Unlimited Carousel (Pro) &#8211; Added &#8216;Image Position&#8217; option, allowing users to customize the position of the image above or below the content for enhanced layout flexibility.<\/li>\n<li>Feature: Layers (Pro) &#8211; Implemented motion effects—now elements can bounce up and down and move left to right for a livelier interface.<\/li>\n<li>Feature: Unlimited Google Maps (Pro) &#8211; Implemented &#8216;Center Info Window&#8217; option. This new functionality allows users to center the info window on the map, providing enhanced visibility and focus on the selected location.<\/li>\n<li>Feature: Unlimited Google Maps (Pro) &#8211; Implemented &#8216;Close After Outside Info Window Click&#8217; option. This new functionality allows users to close the info window after clicking outside of it on the map, enhancing user interaction and control.<\/li>\n<li>Feature: Layers (Pro) &#8211; Implemented responsive settings for individual layers, allowing users to toggle each layer on or off based on the specific device requirements.<\/li>\n<li>Feature: Image Accordion (Pro) &#8211; Added &#8216;Title HTML Tag&#8217; option, providing users with better SEO control by allowing customization of HTML tags for widget titles.<\/li>\n<li>Feature: Content Tabs (Free) &#8211; Introduced option to fire a resize event on tab click, ensuring proper functionality of other widgets inside tab content for a smoother and more seamless user experience.<\/li>\n<li>Feature: Event List (Pro) &#8211; Implemented &#8216;Remove Expired Event Item&#8217; option. This new functionality allows users to automatically remove event items that have expired, streamlining content management within the widget.<\/li>\n<li>Feature: Post Grid (Pro) &#8211; Added typography option for post tags, allowing users to customize the font style, size, and other typographic attributes.<\/li>\n<li>Feature: Event List (Pro) &#8211; Implemented &#8216;Horizontal Align&#8217; option. This new functionality allows users to customize the horizontal alignment of the button, providing enhanced control over the layout within the widget.<\/li>\n<li>Feature: vCard (Pro) &#8211; Introduced option to include social media links in downloadable VCF contact file, enhancing contact information with additional social network profiles for improved connectivity.<\/li>\n<li>Change: Toggle Text Button (Free) &#8211; Upgraded textarea to full functionality editor, providing users with enhanced editing capabilities.<\/li>\n<li>Change: vCard (Pro) &#8211; Updated vCard JavaScript library to the latest version, ensuring compatibility with current standards and latest feature availability.<\/li>\n<li>Fix: Woo Product List (Free) &#8211; Introduced &#8216;Layout Type&#8217; option. This new functionality allows users to set the layout as either column or row, providing flexibility in organizing and displaying content within the widget.<\/li>\n<li>Fix: vCard (Pro) &#8211; Resolved issue where QR code was not scanning on some apps.<\/li>\n<li>Fix: Hotspots (Pro) &#8211; Rebuilt JavaScript code for better interaction. Removed unnecessary code to optimize performance and streamline functionality.<\/li>\n<li>Fix: Sideways Vertical Text (Pro) &#8211; Text layout shifting issue on Safari browser.<\/li>\n<li>Fix: Content Tabs (Free) &#8211; Resolved issue with scrolling to the top of the page after tab click. The fix ensures that tab clicks no longer trigger unintended scrolling to the top, providing a smoother user experience.<\/li>\n<li>Fix: Fullscreen Menu (Free) &#8211; Resolved issue with the vertical scrollbar appearing on hover.<\/li>\n<li>Fix: Testimonial Carousel (Pro) &#8211; The issue where styling attributes (size and color) for SVG icons were not taking effect.<\/li>\n<li>Fix: Content Tabs (Free) &#8211; Resolved issue in Content Tabs when Before After widget couldn&#8217;t function inside tabs. The fix ensures proper functionality, allowing users to utilize the widget as intended.<\/li>\n<li>Fix: Woo Product Grid (Pro) &#8211; Added image HTML attributes to product images.<\/li>\n<li>Fix: Fullscreen Menu (Free) &#8211; Resolved issue where the size of social icons wasn&#8217;t responding to the option value. The fix ensures that the specified option value now accurately reflects the size of social icons.<\/li>\n<li>Fix: Counter (Free) &#8211; Removed unnecessary space in &#8216;Before Text&#8217; and &#8216;After Text&#8217; options. This update improves the clarity and presentation of the text by eliminating unnecessary spacing.<\/li>\n<li>Fix: Content Tabs (Free) &#8211; Added support for Elementor Tabs widget. This enhancement ensures seamless integration and compatibility, allowing users to incorporate the widget effortlessly within Elementor Tabs.<\/li>\n<li>Fix: Fullscreen Menu (Free) &#8211; Resolved an issue where incorrect icons were being displayed after selecting a menu item.<\/li>\n<li>Fix: Woo Mini Cart (Pro) &#8211; Improved widget compatibility with optimization plugins like WP Rocket. This update ensures seamless integration, optimizing performance and enhancing the overall user experience when using these plugins.<\/li>\n<li>Fix: Post Accordion (Free) &#8211; Updated post content loading method to resolve the issue where, on some sites, post content was not displaying correctly.<\/li>\n<li>Fix: Dropdown Field (Pro) &#8211; Fixed an issue when Dropdown Field couldn&#8217;t parse Field Name to Number Field widget.<\/li>\n<li>Fix: Card Carousel (Free) &#8211; Resolved issue where Transition Speed wasn&#8217;t working for non-default animations. The fix ensures that Transition Speed now functions correctly for all animations, providing consistent and reliable behavior.<\/li>\n<li>Fix: Unlimited Google Maps (Pro) &#8211; Removed default 2px border with blue color from one of the map elements. This update improves the visual presentation by eliminating an unnecessary border.<\/li>\n<\/ul>\n<p>version 1.5.94: 2024-01-25:<\/p>\n<ul>\n<li>Feature: added option to message individual fields for the form<\/li>\n<li>Change: removed instagram blocked api message &#8211; the instagram functionality is active now!<\/li>\n<li>Change: added default values to currency fields<\/li>\n<li>Fix: fixed small php bug regarding date field in items<\/li>\n<li>\n<p>Fix: fixed some small xss vulnurability that pachstack discovered<\/p>\n<\/li>\n<li>\n<p>Feature: Number Field (Pro) &#8211; Introduced &#8216;Enable Date Field in Formula&#8217; option. This new functionality enables the use of Date Field in formula by allowing the addition or subtraction of days.<\/p>\n<\/li>\n<li>Feature: Unlimited Charts (Pro) &#8211; Introduced &#8216;Remove Items with 0 Value&#8217; option.  &hellip;<\/li>\n<\/ul>\n",
        "screenshots": "<ol><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-1.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-1.jpg?rev=3034669\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-2.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-2.jpg?rev=3034669\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-3.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-3.jpg?rev=3034669\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-4.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-4.jpg?rev=3034669\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-5.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-5.jpg?rev=3034669\" alt=\"\"><\/a><\/li><li><a href=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-6.jpg?rev=3034669\"><img src=\"https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-6.jpg?rev=3034669\" alt=\"\"><\/a><\/li><\/ol>",
        "reviews": "<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great support with tech issues and improvements<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/lcrdd\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/88ba624ce88f00c13fc49f5b1fdb6b0d?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/88ba624ce88f00c13fc49f5b1fdb6b0d?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/lcrdd\/\" class=\"reviewer-name\">lcrdd<\/a> on <span class=\"review-date\">April 4, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This is a powerful plugin and I am only using a couple of its widgets but it does exactly what I needed for a particular website.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">I received great support on a ticket I wrote about a few different issues. One issue was a bug and the others were accessibility features missing that I noticed with some of the Unlimited Elements widgets. Everything was addressed by the team and now the website homepage scores a 100 out of 100 for accessibility on Google Page Speed. I am grateful to Adarsh, Igor and Max who helped me with my ticket.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Excellent customer service<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/iangrantaeg\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1286f7df87d1bc08f8a602d4c78214e8?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1286f7df87d1bc08f8a602d4c78214e8?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/iangrantaeg\/\" class=\"reviewer-name\">iangrantaeg<\/a> on <span class=\"review-date\">April 4, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\"><em>Adarsh Pawar<\/em> was amazing and great plugin - always very helpful <\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Perfect support for the perfect plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/premeta\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/8a06cd666fe1339775531256db202bc7?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/8a06cd666fe1339775531256db202bc7?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/premeta\/\" class=\"reviewer-name\">premeta<\/a> on <span class=\"review-date\">March 23, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I am very grateful to the customer service team Unlimited Elements (Premium) for their patience and professionalism. <br \/>The widgets are very convenient to work with, everything is intuitive, and if there are any questions, the support team responds instantly and answers all questions. I plan to continue using these widgets and recommend them to everyone.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Perfect Support for Unlimited Elements (Premium)<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/hollisan\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/ce9009749db6f6b8e81a6c4be0861122?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/ce9009749db6f6b8e81a6c4be0861122?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/hollisan\/\" class=\"reviewer-name\">hollisan<\/a> on <span class=\"review-date\">March 17, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">I had a problem with the remote widgets after an update of the plugIn. I spend quite a long time to fix this myself. The first response after I opened a ticket was quite fast on a Saturday morning and the problem needed to be forwarded to second level support. From here I received an answer later that day in the night. I did not correctly understand the response immediatelly. But then I found out it was the correct and best way to reponse. My problem was fixed with the answer and I was very impressed about the pace and the short way to explain my fault.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Perfect support team, I am impressed. Thank you very much.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great tooling, no more need for Elementor PRO<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/fogoh\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/baab432e6b01e577ffeb323d5a583f76?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/baab432e6b01e577ffeb323d5a583f76?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/fogoh\/\" class=\"reviewer-name\">fogoh<\/a> on <span class=\"review-date\">March 6, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Very happy I found unlimited elements for elementor, with the free version of elementor combined you can do everything you want and even more!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Love this plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/fraukoenig\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/35332e0e64d518c577ed73e2c50c07f7?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/35332e0e64d518c577ed73e2c50c07f7?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/fraukoenig\/\" class=\"reviewer-name\">fraukoenig<\/a> on <span class=\"review-date\">March 4, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This plugin is the best extension for the Elementor pagebuilder. And listen: We had a small question about an adjustment in the widget Accordion Menu. The support was really fast and the developers quickly added this extension to mark the Menu Sub Item as active. Thank you so much.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Game Changing Plugin<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/jbaldwin8\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/134c34a22b69461116ca6f9d97119ed8?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/134c34a22b69461116ca6f9d97119ed8?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/jbaldwin8\/\" class=\"reviewer-name\">jbaldwin8<\/a> on <span class=\"review-date\">February 27, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">This is an incredible plugin. Not only does it have amazing out of the box widgets for Elementor that have great designs, animations and features, it also offers flexibility with allowing remote control of interconnecting widgets - a feature that I have not seen in any other Elementor add on. Unlimited Elements for Elementor also allows you to customise the fields, HTML, CSS and Java Script of any of the widgets to completely make them your own, which is totally next level. And to top it all off the support I have received from Adarsh and the team is the highest quality that I have ever come across. This plugin is a total game changer for front-end website developers.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Magical !<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/thomasusa\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/85982f6371ad1abb33db44672fb20c74?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/85982f6371ad1abb33db44672fb20c74?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/thomasusa\/\" class=\"reviewer-name\">thomasusa<\/a> on <span class=\"review-date\">February 26, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">There was no way I would get it in anywhere with Elementor without these guys. The only way elementor really works is if you structure all the data.  This is exactly what these elements do and the support is five star.  They have modified widgets for me.  10 star!<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/alex290686\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/e865ba0511316f75855fb526a44f5e6b?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/e865ba0511316f75855fb526a44f5e6b?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/alex290686\/\" class=\"reviewer-name\">alex290686<\/a> on <span class=\"review-date\">February 25, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">Thank you for support. You helped me to resolve at issue and added new functionality to the widget.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p class=\"\">Thanks a lot<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n<div class=\"review\">\n\t<div class=\"review-head\">\n\t\t<div class=\"reviewer-info\">\n\t\t\t<div class=\"review-title-section\">\n\t\t\t\t<h4 class=\"review-title\">Great support<\/h4>\n\t\t\t\t<div class=\"star-rating\">\n\t\t\t\t<div class=\"wporg-ratings\" aria-label=\"5 out of 5 stars\" data-title-template=\"%s out of 5 stars\" data-rating=\"5\" style=\"color:#ffb900;\"><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><span class=\"star dashicons dashicons-star-filled\"><\/span><\/div>\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t<p class=\"reviewer\">\n\t\t\t\tBy <a href=\"https:\/\/profiles.wordpress.org\/stefanglauch\/\"><img alt='' src='https:\/\/secure.gravatar.com\/avatar\/1adfc4cf5fe7893e9d8f49d627b31cdb?s=16&#038;d=monsterid&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/1adfc4cf5fe7893e9d8f49d627b31cdb?s=32&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-16 photo' height='16' width='16' loading='lazy' decoding='async'\/><\/a><a href=\"https:\/\/profiles.wordpress.org\/stefanglauch\/\" class=\"reviewer-name\">stefanglauch<\/a> on <span class=\"review-date\">February 19, 2024<\/span>\t\t\t<\/p>\n\t\t<\/div>\n\t<\/div>\n\t<div class=\"review-body\"><!-- wp:paragraph -->\n<p class=\"\">The Developers responded very quickly to our individual requirements and provided competent assistance. Many thanks, especially to Denys.<\/p>\n<!-- \/wp:paragraph --><\/div>\n<\/div>\n"
    },
    "short_description": "Elementor all-in-one addons pack that offers a wide range of features to enhance your website. Discover over 100 free Elementor widgets, 10 free anima &hellip;",
    "description": "<p><strong>Elementor<\/strong> users, elevate your web design experience with <strong>Unlimited Elements for Elementor<\/strong>. An all in one plugin that instantly gives you the most advanced widgets and tools to make better Elementor websites faster.  Take your WordPress website to the next level.<\/p>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\">View Elementor Widgets Demos<\/a><br \/>\n<br \/>\nBrowse our extensive collection of free widgets or upgrade to our pro version for access to over 200 additional unique drag and drop widgets for <strong>Elementor<\/strong>. Each widget provides a wide range of options to easily control every aspect. If you can&#8217;t find what you need, our <strong>Widget Creator<\/strong> Framework empowers you to create any widget you can imagine.<\/p>\n<h3>Plugin Features<\/h3>\n<ul>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\"><strong>Widget Library<\/strong><\/a> – Enhance the popular Elementor page builder with our user-friendly and innovative widget library. Simplify your website by finding everything you need in one place, without the need for multiple plugins.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/widget-creator\/\" rel=\"nofollow ugc\"><strong>Widget Creator<\/strong><\/a> – Save valuable time by eliminating the need to search for numerous plugins and add-ons. Instead, create customized, professional widgets that perfectly align with your website requirements.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-widgets\/\" rel=\"nofollow ugc\"><strong>Elementor Templates<\/strong><\/a> – Effortlessly kickstart your web project with pre-designed templates. Say goodbye to endless searches for inspiration or starting from scratch. Get your project up and running in seconds with our collection of template kits.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/elementor-templates\/\" rel=\"nofollow ugc\"><strong>Elementor Templates<\/strong><\/a> – Effortlessly kickstart your web project with pre-designed templates. Say goodbye to endless searches for inspiration or starting from scratch. Get your project up and running in seconds with our collection of template kits.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/loop-builder-for-elementor\/\" rel=\"nofollow ugc\"><strong>Loop Builder<\/strong><\/a> – Easily create dynamic Loop Items within the Elementor Theme Builder by utilizing any loop widget layout of your preference. Effortlessly populate the chosen widget with dynamic content to craft versatile and engaging Loop Items.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/background-widgets-for-elementor\/\" rel=\"nofollow ugc\"><strong>Background Widgets<\/strong><\/a> – Elevate your web designs instantly with our user-friendly animated backgrounds available in our extensive widget library. Experience seamless integration and unleash your creativity like never before.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-widgets-filters-tools\/\" rel=\"nofollow ugc\"><strong>Post Widgets &amp; Filters<\/strong><\/a> – Easily create stunning post layouts with real-time filters. Improve the browsing experience for website visitors by helping them find the content they&#8217;re looking for. Effortlessly display posts using advanced criteria on your entire website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/woo\/\" rel=\"nofollow ugc\"><strong>WooCommerce Widgets &amp; Filters<\/strong><\/a> – Create stunning product layouts with dynamic real-time filters. Showcase your products and categories in a wide array of interactive formats, such as grids, carousels, sliders, and more.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/remote-control-widgets\/\" rel=\"nofollow ugc\"><strong>Woo Widgets &amp; Filters<\/strong><\/a> – Unleash your creativity with advanced and customizable layouts. Take full control of your designs and make them truly unique using the remote controls. Stand out from the crowd with layouts that are both eye-catching and distinctive.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/sync-widgets\/\" rel=\"nofollow ugc\"><strong>Sync Between Widgets<\/strong><\/a> – Elevate your web designs to new heights by seamlessly synchronizing multiple item-based widgets. This powerful feature empowers you to effortlessly create intricate and personalized layouts, taking your designs to the next level of sophistication.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/multi-source-galleries\/\" rel=\"nofollow ugc\"><strong>Multi-Source Galleries<\/strong><\/a> – Empower your gallery showcase by effortlessly featuring Woo products, WordPress posts, Instagram feeds, and a variety of other sources, including various API integrations.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/live-copy-paste\/\" rel=\"nofollow ugc\"><strong>Live Copy Paste<\/strong><\/a> – Copy and paste fully designed sections from the Unlimited Elements website directly to your website, saving you time and ensuring you can finish your web project as soon as possible.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/mega-menu-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Mega Menu Builder<\/strong><\/a> – Easily craft a distinctive Mega Menu for your website navigation by incorporating images, icons, links, and various Elementor widgets into unique menu layouts.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/mega-slider-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Mega Slider Builder<\/strong><\/a> – Easily turn any Elementor sections into slider slides. Now you can amaze your website visitors with jaw-dropping slider designs that look amazing on any device.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/multi-source\/\" rel=\"nofollow ugc\"><strong>Multi-Source Widgets<\/strong><\/a> – Add content dynamically to item-based widgets effortlessly with support for ACF repeaters, JSON\/CSV files, Woo Products, WordPress posts, users, menus, and a range of API integrations.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/dynamic-post-popup-widget-for-elementor\/\" rel=\"nofollow ugc\"><strong>Dynamic Popup Builder<\/strong><\/a> – Dynamically create a popup to add a quick view of the post without leaving the page. Use an Elementor single post template to create the layout of the dynamic popup.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/form-builder\/\" rel=\"nofollow ugc\"><strong>Elementor Form Builder<\/strong><\/a> – Build advanced forms effortlessly using the drag-and-drop form builder. Whether it’s a simple or complex form, our straightforward form widgets make it quick and easy to create forms, improving your workflow.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/calculators\/\" rel=\"nofollow ugc\"><strong>Calculator Builder<\/strong><\/a> – Easily design professional calculators for any type of industry. Whether you need a loan calculator, mortgage calculator or business calculator, our powerful and intuitive drag and drop builder makes it easy to create complex calculators with ease.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/filters\/\" rel=\"nofollow ugc\"><strong>Elementor Filter Widgets<\/strong><\/a> – Unlock the potential of the AJAX-based faceted filter system, seamlessly empowering you to craft diverse layouts with ease. Take control by applying multiple filters, ensuring a super-fast and dynamic filtering experience tailored to your website needs.<\/p>\n<\/li>\n<\/ul>\n<h3>Widget Library<\/h3>\n<p>Find everything you need in one convenient package and supercharge your <strong>Elementor<\/strong> website.<\/p>\n<h3>Creative Widgets for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/flip-box-widget-for-elementor\/\" rel=\"nofollow ugc\">Flip Box Widget for Elementor (Free)<\/a>  Attract attention from website visitors with the Flip Box widget for Elementor pages. It adds a playful hover effect to your website content, keeping users engaged and increasing interaction.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/svg-animation-widget-for-elementor\" rel=\"nofollow ugc\">SVG Animation Widget for Elementor (Free)<\/a>  The SVG animation widget for Elementor simplifies the process of creating stunning SVG animations for your website. You don&#8217;t need any coding skills &#8211; simply copy and paste your SVG code, and your animated icon is good to go.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/animated-hamburger-icon-for-elementor\/\" rel=\"nofollow ugc\">Animated Hamburger Icon Widget for Elementor (Free)<\/a>  Enhance your Elementor Pro popups effortlessly by using the animated hamburger icon widget. Take it a step further by incorporating a menu within a popup, creating a captivating full-screen menu experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/lordicon-animated-icons-widget-for-elementor\/\" rel=\"nofollow ugc\">Lordicon: Animated Icons Widget for Elementor (Free)<\/a>  Discover the power of Lordicons, an extensive animated icon library featuring over 1500 free and premium Lottie animations. Effortlessly download icons as Lottie JSON files or simply copy the CDN link. Unleash the potential of your designs with Lordicons!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/timeline-bullets-widget-for-elementor\/\" rel=\"nofollow ugc\">Timeline Bullets Widget for Elementor (Free)<\/a>  Showcase your features or services using bullet points for easy readability of important information. Customize the settings of the Timeline Bullets widget to achieve your desired appearance and functionality.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/blob-shape-widget-for-elementor\/\" rel=\"nofollow ugc\">Blob Shapes Widget for Elementor (Free)<\/a>  Transform images into captivating and dynamic blob shapes with mesmerizing morphing effects using this incredible Elementor widget. Unleash your creativity with random, distinctive, and natural-looking blobs that will add a touch of uniqueness to your designs.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/number-box-widget-widget-for-elementor\/\" rel=\"nofollow ugc\">Number Box Widget for Elementor (Free)<\/a>  Enhance your designs with eye-catching number blocks in various styles. The Number Box widget for Elementor allows you to display content for easy-to-follow diagrams and clear instructions.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/docs\/icon-bullets\/\" rel=\"nofollow ugc\">Icon Bullets Widget for Elementor (Free)<\/a>  Elevate your feature lists with the Icon Bullets widget. Showcase distinct icons and styles for each item, personalize icon titles and accompanying text. Effortlessly emphasize key features on your Elementor website using the Bullets widget.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-zoom-magnifier-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Zoom Magnifier Widget for Elementor (Pro)<\/a>  The Image Zoom Magnifier is an Elementor widget that creates a direction-aware magnifying glass effect. It offers inner zoom functionality for any image, allowing you to easily enlarge images with a touch, click, or mouseover. Enhance your image viewing experience with this incredible tool!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-box-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Icon Box Accordion Widget for Elementor (Pro)<\/a>  The Icon Box Accordion widget creates a visually appealing layout of icon boxes with an interactive accordion effect. When hovered upon, the icon boxes expand and display additional information.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/morph-slider-widget-for-elementor\/\" rel=\"nofollow ugc\">Morph Slider Widget for Elementor (Pro)<\/a>  The Morph Slider allows you to easily create stunning image slideshows for your Elementor website. It utilizes a WebGL-based Image slider effect with advanced transitions such as noise, displacement, blend, and color mix to design one-of-a-kind visuals.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-reveal-on-scroll-widget-for-elementor\" rel=\"nofollow ugc\">Scroll Image Reveal Widget for Elementor (Pro)<\/a>  Enhance your Elementor website design with the Scroll Image Reveal widget. This impressive feature creates an engaging reveal effect on your images as users scroll to them.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Accordion Widget for Elementor (Pro)<\/a>  The Image Accordion widget enables you to present a collection of images in a compact and interactive manner. Additionally, it offers the flexibility to reveal more details or showcase a larger view of each image.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-shapes-for-elementor-page-builder\/\" rel=\"nofollow ugc\">Image Shapes Widget for Elementor (Pro)<\/a>  Enhance your image design effortlessly with the Image Shapes Elementor widget. Easily create captivating images using pre-defined clipping masks, unlocking endless possibilities for your element layouts. Explore a variety of shapes to add a touch of creativity to your designs.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-particle-widget-for-elementor\/\" rel=\"nofollow ugc\">Particle Image Widget for Elementor (Pro)<\/a>  Enhance your images with a captivating dispersion interactive distortion effect using the Particle Image widget for Elementor. Transform any image into a mesmerizing visual experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-tabs-widget-for-elementor\" rel=\"nofollow ugc\">Icon Tabs Widget for Elementor (Pro)<\/a>  The Icon Tab widget for Elementor allows you to effortlessly display your text on your page, neatly organized into horizontal or vertical tabs. With the option to customize your tabs using icons, you can create an interactive and enjoyable reading experience for your website visitors.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/background-switcher-widget-for-elementor\/\" rel=\"nofollow ugc\">Background Switcher Widget for Elementor (Pro)<\/a>  The Background Switcher widget lets you create stylish content boxes. When you hover over a content box, it dynamically changes the background for the entire section. Impress your audience with smooth and seamless background transitions as they interact with your website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/icon-accordion-widget-for-elementor\/\" rel=\"nofollow ugc\">Icon Accordion Widget for Elementor (Pro)<\/a>  The Icon Accordion widget for Elementor page builder offers a wide selection of styles to create interactive collapsible content with different layouts on your page. Each accordion item can be accompanied by an icon for enhanced visual representation.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/before-after-widget-for-elementor\/\" rel=\"nofollow ugc\">Before After Widget for Elementor (Pro)<\/a>  Effortlessly compare changes using the Before After widget. Experience the transformation at a glance, whether it&#8217;s photos, designs, or anything else. Elevate your visual storytelling with ease!<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/shape-bullets-widget-for-elementor\/\" rel=\"nofollow ugc\">Shape Bullets Widget for Elementor (Pro)<\/a>  The Shape Bullets Widget for Elementor simplifies the creation of a well-structured bulleted list. Each item can have its own unique icon, enclosed in visually appealing shapes. This enhances visual appeal and improves organization and readability.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/flip-box-carousel-widget-for-elementor\/\" rel=\"nofollow ugc\">Flip Box Carousel Widget for Elementor (Pro)<\/a>  Enhance your Elementor page with the captivating Flip Box Carousel effect. Add a dynamic touch to showcase your content engagingly and interactively. Each item in the carousel acts as a flip box, revealing compelling additional content.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/scroll-sequance-widget-for-elementor\/\" rel=\"nofollow ugc\">Scroll Sequence Widget for Elementor (Pro)<\/a>  Elevate your website with the Scroll Sequence Widget. Convert collections of images into captivating web experiences. Engage your audience with seamless animations of image sequences, all triggered by scrolling.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/rhombus-grid-widget-for-elementor\/\" rel=\"nofollow ugc\">Rhombus Grid Widget for Elementor (Pro)<\/a>  Use the Rhombus Grid widget for Elementor to create a unique and creative layout style for your content. Let your creativity shine and engage your audience with a visually striking design that will make a lasting impact.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/christmas-icons-widget-for-elementor\/\" rel=\"nofollow ugc\">Christmas Icons Widget for Elementor (Pro)<\/a>  The Christmas Icons widget provides 25 specially designed icons for the festive season. Each icon comes with 3 unique styles, adding a delightful touch to your holiday designs.<\/p>\n<\/li>\n<\/ol>\n<h3>Tools for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/animated-mouse-scroll-icon-widget-for-elementor\/\" rel=\"nofollow ugc\">Animated Mouse Scroll Icon Widget for Elementor (Free)<\/a>  The Animated Mouse Scroll Icon is a captivating animation that prompts users to explore further content by scrolling down the page.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/contact-form-7-widget-for-elementor\/\" rel=\"nofollow ugc\">Contact Form 7 Widget for Elementor (Free)<\/a>  The Contact Form 7 widget is a valuable tool that makes customizing the appearance of your contact forms in the Elementor page builder easier. With this widget, you can enhance the visual appeal of your contact forms directly from the page builder interface.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/notification-widget-for-elementor\" rel=\"nofollow ugc\">Notification Widget for Elementor (Free)<\/a>  The Notification widget allows you to easily display an eye-catching alert box and draw attention to important messages on your Elementor website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/event-box-widget-for-elementor\" rel=\"nofollow ugc\">Event Box Widget for Elementor (Free)<\/a>  Enhance your website with the Event Box widget. It&#8217;s designed to showcase events and special occasions in a stunning display. Present your events in a user-friendly format, complete with a call-to-action button for seamless ticket purchase or event enrollment.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-tooltip-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Tooltip Widget for Elementor (Free)<\/a>  The Image Tooltip widget provides a simple way to add tooltips to images on a webpage, allowing for additional information or call-to-action text. It also supports linking the image to another page.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/360-product-viewer-widget-for-elementor\/\" rel=\"nofollow ugc\">360° Product Viewer Widget for Elementor (Pro)<\/a>  Present your product from all perspectives using the immersive 360° Product Viewer widget for Elementor. This powerful tool allows customers to interact with and examine every intricate detail, giving them a complete understanding of your product.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/currency-converter-widget-for-elementor\/\" rel=\"nofollow ugc\">Currency Converter Widget for Elementor (Pro)<\/a>  Easily convert currencies with our intuitive Currency Converter widget. Stay updated on real-time exchange rates and effortlessly calculate conversions on your website.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/image-scroll-widget-for-elementor\/\" rel=\"nofollow ugc\">Image Scroll Widget for Elementor (Pro)<\/a>  Elevate your image display effortlessly with the Image Scroll Widget. This feature enables a seamless vertical scroll, smoothly moving images from top to bottom as users hover over them.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/job-listing-widget-for-elementor\/\" rel=\"nofollow ugc\">Job Listing Widget for Elementor (Pro)<\/a>  Effortlessly post detailed job listings using the Job Listing widget for Elementor. Attract potential candidates and simplify the recruitment process by showcasing a wide range of positions, breaking through geographical barriers, and emphasizing the required qualifications and skills for each role.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/event-list-widget-for-elementor\/\" rel=\"nofollow ugc\">Event List Widget for Elementor (Pro)<\/a>  The Event List Widget makes it easy to display upcoming events and special occasions on your Elementor websites. You can populate the widget with dynamic data using posts and connect it to advanced filters and tools for added functionality.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/hotspots-for-elementor-page-builder\/\" rel=\"nofollow ugc\">Hotspots Widget for Elementor (Pro)<\/a>  Improve your images with interactive hotspots featuring tooltips and the choice of a built-in popup. Each hotspot popup can include an image and descriptive text, creating an engaging user experience.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/360-panorama-virtual-tour-widget-for-elementor\/\" rel=\"nofollow ugc\">360 Panorama Virtual Tour Widget for Elementor (Pro)<\/a>  Create captivating 360 tours on your Elementor website. Allow visitors to remotely explore your place and stay engaged. With a virtual tour, they can navigate through your location in a 360 panoramic view, getting a realistic feel of its appearance.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/qr-code-widget-for-elementor\/\" rel=\"nofollow ugc\">QR Code Widget for Elementor (Pro)<\/a>  The QR Code widget for Elementor simplifies the process of creating and integrating QR codes into your WordPress website. Generate QR codes for text, phone numbers, links, or email addresses with ease, enhancing user engagement and interaction.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/layers-widget-for-elementor\/\" rel=\"nofollow ugc\">Layers Widget for Elementor (Pro)<\/a>  Effortlessly layer images, text, shapes, and icons on your Elementor pages with the Image Layers widget, a straightforward solution for precise positioning and design flexibility.<\/p>\n<\/li>\n<\/ol>\n<h3>Post Widgets for Elementor<\/h3>\n<ol>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-tabs-for-elementor\/\" rel=\"nofollow ugc\">Post Tabs Widget for Elementor (Free)<\/a>  Create engaging tab designs for showcasing your WordPress posts using the Post Tabs widget. Organize your top blog pieces by tags or categories in an interactive layout.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-accordions-for-elementor\/\" rel=\"nofollow ugc\">Post Accordion Widget for Elementor (Free)<\/a>  The Post Accordion Widget in WordPress lets you display posts, pages, products, or custom post types in a distinctive and interactive accordion layout. It condenses information, saving space. Visitors can quickly scan titles and expand relevant items to read more, catering to their specific needs and interests.<\/p>\n<\/li>\n<li>\n<p><a href=\"https:\/\/unlimited-elements.com\/post-carousel-lite-widget-for-elementor\" rel=\"nofollow ugc\">Post Carousel Lite Widget for Elementor (Free)<\/a>  The Post Carousel Lite widget allows you to choose a collection of posts, pages, products, or any custom post type. You can filter them by category, tags, or author. These selected items are then presented in a visually appealing and interactive  &hellip;<\/p>\n<\/li>\n<\/ol>\n",
    "download_link": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.zip",
    "upgrade_notice": [],
    "screenshots": {
        "1": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-1.jpg?rev=3034669",
            "caption": ""
        },
        "2": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-2.jpg?rev=3034669",
            "caption": ""
        },
        "3": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-3.jpg?rev=3034669",
            "caption": ""
        },
        "4": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-4.jpg?rev=3034669",
            "caption": ""
        },
        "5": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-5.jpg?rev=3034669",
            "caption": ""
        },
        "6": {
            "src": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/screenshot-6.jpg?rev=3034669",
            "caption": ""
        }
    },
    "tags": {
        "addons": "addons",
        "elementor": "elementor",
        "elementor-addons": "elementor addons",
        "elementor-widget": "elementor widget",
        "elements": "elements"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.5.44": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.44.zip",
        "1.5.82": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.82.zip",
        "1.5.85": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.85.zip",
        "1.5.88": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.88.zip",
        "1.5.92": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.92.zip",
        "1.5.93": "https:\/\/downloads.wordpress.org\/plugin\/unlimited-elements-for-elementor.1.5.93.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http:\/\/unlimited-elements.com\/",
    "banners": {
        "low": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/banner-772x250.jpg?rev=3008076",
        "high": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/banner-1544x500.jpg?rev=3008076"
    },
    "icons": {
        "1x": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/icon-128x128.gif?rev=3008076",
        "2x": "https:\/\/ps.w.org\/unlimited-elements-for-elementor\/assets\/icon-256x256.gif?rev=3008076"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "es_ES",
            "version": "1.5.102",
            "updated": "2024-02-27 22:45:09",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "it_IT",
            "version": "1.5.102",
            "updated": "2024-01-25 19:06:26",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "nl_NL_formal",
            "version": "1.5.102",
            "updated": "2024-04-03 20:37:49",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "nl_NL",
            "version": "1.5.102",
            "updated": "2024-04-03 19:14:48",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "ru_RU",
            "version": "1.5.102",
            "updated": "2023-07-13 14:18:34",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "unlimited-elements-for-elementor",
            "language": "zh_CN",
            "version": "1.5.102",
            "updated": "2024-03-03 10:02:42",
            "package": "https:\/\/downloads.wordpress.org\/translation\/plugin\/unlimited-elements-for-elementor\/1.5.102\/zh_CN.zip"
        }
    ]
}